{
	"date": "Friday, December 29, 2006",
	"title": "Fellow Travelers' Advisory from Anne Feeney - JANUARY 2007, VOLUME TWO, #10",
	"body": "Fellow Travelers' Advisory from Anne Feeney - JANUARY 2007, VOLUME TWO, #10<br><br>********************************************<br><br>IMMEDIATE DESTINATIONS (details at the end):<br><br>PITTSBURGH CD RELEASE (January 4th)<br>SANTA CRUZ, CA<br>SAN FRANCISCO, CA<br>BERKELEY, CA<br>NEVADA CITY, CA<br>ASHLAND, OR<br>PORTLAND, OR<br>EUGENE, OR<br>VANCOUVER, BC<br>VICTORIA, BC<br>SALT SPRING, BC<br>BELLINGHAM, WA<br>SEATTLE, WA<br>TACOMA, WA<br><br>and then TEXAS!! FLORIDA!! NEW ENGLAND!!!<br><br><br>*******************************************<br><br>You can have the Fellow Travelers' Advisory delivered to you once a month by <a href=\"http://annefeeney.com/newsletter.html\">signing up!</a><br><br>If you didn't get my new CD in your Christmas stocking, treat yourself! You can get it at <a href=\"http://cdbaby.com/cd/annefeeney6\">CDBaby.</a><br><br>********************************************<br>IN THIS ISSUE:<br><br>MY NEW YEAR'S RESOLUTIONS FOR YOU<br>GONE TO JAIL FOR JUSTICE<br>JACKIE BROWN FOR JACKSONVILLE<br>ROUGH MIX OF NEW SONG ON MYSPACE<br>GOT CDs FOR KPFK LABOR SHOW???<br>DUMP THE BOSSES OFF YOUR BACK UPDATE<br>THE YEAR IN REVIEW IN A MINUTE<br>2006 REST IN PEACE<br>FAVORITE MOVIES OF 2006<br>GIGS PAST AND FUTURE, &amp; MANY MANY THANKS!<br><br>********************************************<br><br><br>MY NEW YEAR'S RESOLUTIONS FOR YOU -<br><br>PLEASE drop me a line from time to time and let me know what you're up to... anne@annefeeney.com<br><br>As most of you could guess, I have no corporate sponsors - I really count on you to spread the word about my shows and my CDs. PLEASE forward the Fellow Travelers' Advisory widely and let your friends know about my music. I really appreciate it.<br><br>If you see that I'm playing in a town where you have friends, colleagues, relatives - PLEASE tell them about my music, or better yet, buy them one of my CDs and encourage them to catch me live.<br><br>Check around to see if there are regular house concerts in your town. If you've never been to one, go! It's a wonderfully intimate and enjoyable way to hear live music and meet your neighbors.<br><br>If there isn't a house concert series in your town, consider hosting one. It's not that difficult. Email me if you're interested in learning how to host a house concert.<br><br>If you see that I'm headed your way, check around to see if there are any rallies, riots, conventions, picnics or parties near you that I should know about. I do about 80% of my booking from tips that I get from you.<br><br>Look for shows and recordings by other wonderful artists, like evan greer, charlie king &amp; karen brandow, chris chandler, dave lippman, rebel voices, joe jencks, linda allen, emma's revolution, david rovics, david roth, kim &amp; reggie... and of course so many many more..<br>Lots of them can be found <a href=\"http://cdbaby.com/group/annespicks\">here.</a><br><br>***********************************<br>GONE TO JAIL FOR JUSTICE<br><br>This holiday season let's take a moment to remember those who can't be with their families and friends this holiday season because they are in jail. My friend and companera Julienne Oldfield was among many who crossed the line at Fort Benning this year. Keep her and all those in prison in your thoughts. And consider an end of the year donation to SOA Watch. 2007 will bring us a real opportunity to  <a href=\"http://soaw.org\">close the School of the Americas!</a><br>********************************************<br>JACKIE BROWN FOR JACKSONVILLE<br><br>Got a few extra dollars in your sock after finishing your holiday shopping? Send it on to:<br><br>Jackie Brown for Mayor<br>PO BOX 62309<br>Jacksonville FL 32208<br><br>She's a bright, hardworking and charismatic woman looking to shake things up a little in Jacksonville. <br><a href=\"http://www.metrojacksonville.com/content/view/210/67/\">Listen to this interview with her</a><br><br>********************************************<br><br>ROUGH MIX OF NEW SONG ON MYSPACE<br><br>Enjoy a holiday special rough mix of my cut of &quot;Brave New Christmas&quot; by the wonderful John William Davis. It will be on &quot;Dump the Bosses Off Your Back&quot; when it's finished... Still a few thousand dollars away from completion... The song will only be up on Myspace for another couple days,  <a href=\"http://myspace.com/annefeeneyreally\">so listen in now!</a><br><br>********************************************<br>GOT CDs FOR KPFK LABOR SHOW???<br><br>Henry Walton has a Labor Show airing on Thursdays on KPFK in Los Angeles. If you're interested in having him play your music on his show, send CDs to Sandy Goldfarb, 12741 Pacific Ave #8, Los Angeles, CA 90066.<br><br>********************************************<br>DUMP THE BOSSES OFF YOUR BACK UPDATE<br><br>I hope to get the second CD ready for Mayday 2007. If you are a sponsor of the second CD, could you remind of that now? My record keeping is a little off here... I know the following for sure, but if I missed you, let me know: Amy Newell, Kay Magill, Jeanine Malito, Jack O' Malley, Rosemary Trump, Rosanna Lane, Candice Carter, Stan Swart, Joel Henderson, Rich Shriver, Shelley Kessler, Tom Herman and Jo Miller, Rose Feurer, Pat Bennett, Berk Snow, Jeanne Clark &amp; Tim Sullivan, Michele Samuels. Courtney Derwinski, Dexter Arnold and Corliss Olson<br><br>(That's about 62 folks short of what I need to finish the CD... It's not too late to become a sponsor! Send $100 to me at 7206 Michigan Ave, Pittsburgh, PA 15218)<br><br>********************************************<br><br>THE YEAR IN REVIEW IN A MINUTE<br><br>Some high points of 2006:<br><br>So long Rick Santorum! I still laugh when I see the DumpRick bumper stickers on cars around town.<br><br>Good riddance John Bolton! Hasta la vista Tom Delay! Bye Bye Mark Foley! Adios Donald Rumsfeld!<br><br>Getting to meet and hang out with Colonel Ann Wright and Cindy Sheehan.<br><br><a href=\"http://video.google.com/videoplay?docid=-869183917758574879\">Watching Stephen Colbert skewering W at the National Press Club Dinner</a><br><br>Working with Doug Wilkin and all the talented musicians and vocalists who helped out on <a href=\"http://cdbaby.com/cd/annefeeney6\">my new CD &quot;If I Can't Dance.&quot;<br></a><br>Jumping out of an airplane at 14,000 feet on my 55th birthday!<br><br>Having so many of you step forward to sponsor the recording of &quot;If I Can't Dance,&quot; and &quot;Dump the Bosses Off Your Back.&quot;<br><br>&quot;the bells are ringing...&quot;<br><br>My son Dan getting engaged to Monique Murad<br><br>My friends Rosanna Lane and Bill Deegan tying the knot after 30+ years of unwedded bliss!<br><br>My friend Jan Boyd getting married to the charming and wonderful Bill Erickson<br><br><a href=\"http://stetsonkennedy.com/\">Stetson Kennedy</a> marrying Sandra Parks on November 24th!<br><br><br>Some low points of 2006:<br><br>The wonderful Main Street Cafe closes its doors in Homestead, FL<br><br>The valiant Boilermakers of Local 484 in Meredosia end their lockout with a lousy settlement<br><br>Lebanon is attacked by Israel<br><br>Sweden puts the center-right Moderaterna party in charge of their government ...<br><br>Mike Veon loses his house seat in Pennsylvania<br><br>The Iraq war drags on and Bush sure doesn't get it.<br><br><br>+++++++++++++++++++++++++++++++++++++++<br><br>2006 REST IN PEACE<br><br><a href=\"http://www.bobblue.org/\">Bob Blue</a><br><a href=\"http://wfma.net/glazer.htm\">Joe Glazer</a><br><a href=\"http://www.fitzgeraldandbeach.com/\">DC Fitzgerald</a><br><a href=\"http://www.timothydmason.com/walkinghawk.shtml\">Blair Powell</a><br>Danny Conn, Walt Harper<br>and my Swedish parents-in-law,<br>Sonja and Nisse Johannson.....<br><br>+++++++++++++++++++++++++++++++++++++++<br><br><br>FAVORITE MOVIES OF 2006<br><br>There are still so many films that I haven't seen ... I'll be on a campaign to catch as many as I can before the Oscars. If I'm in your neighborhood and you want to see a film.... let's!!<br><br><br>The Departed - plenty violent, but the performances by Nicholson, DeCaprio and Damon are fabulous - it's a real edge-of-the seat thriller ... Scorcese's finest, in my opinion. Definitely in my top 100 of all time... maybe even in my top 50.<br><br>The Queen - I'll confess I'm a huge Helen Mirren fan, but she should win an Oscar for this fabulous performance as Queen Elizabeth in the aftermath of Diana Spencer's death.<br><br>Little Miss Sunshine - not a perfect movie for sure, but I still laughed out loud several times and thought it was a charming film.<br><br>Thank You for Smoking - a surprisingly hilarious film... one would think that a film starring a tobacco industry lobbyist would use up its best material in the first five minutes ... not so... it was quite ingenious.<br><br>Borat - despite a lot of wince-inducing moments in this film, I was overall quite entertained.<br><br>2006 Losers<br><br>I wouldn't expect a film about Idi Amin to be uplifting, but Last King of Scotland was simply harrowing. I couldn't look at the screen for five full minutes toward the end.<br><br>The people in front of me who were clearly enjoying &quot;Dream Girls,&quot; didn't appreciate my groans. Over-the-top sentimentality may work better in live theater performance, but it was painful on the silver screen. This film was more fun with your eyes closed.<br><br>I wish I could have edited &quot;The Good Shepherd.&quot; It might have been a good film if it had been an hour shorter. It was often dazzling to look at ... beautiful cinematography... but it would be more rewarding (and faster) to watch an amaryllis bloom.<br><br>Pursuit of Happyness belongs on Lifetime TV, or perhaps as an interlude at the Republican National Convention. According to this so-called &quot;based on a true story&quot; film, there is certainly no excuse for poverty. .. all you have to do is follow your dream. This strikes me as the kind of fantasy that rich people have when they think about what they would do if they were poor. I have no doubt that there is a *lot* more to the true story than what we see in this film. That being said, the performances in this unbelievable film are all terrific.... especially Will Smith's charming son Jaden.<br><br>********************************************<br>GIGS PAST AND FUTURE, &amp; MANY MANY THANKS!<br><br>When the year started with magically lovely performance opportunities at the Danish and Swedish Social Forums, I knew the year was off to a good start. The TX tour that Teresa Allen put together for me right after that was fantastic. I met so many wonderful people on that trip! And the visit to Tucson in February was beautifully arranged by Myra and Guido... and allowed me a great visit with my Arizona cousins.<br><br>It was totally a lifelong dream come true to get to play the UMWA Convention!!! To know that I was performing for the union that my grandfather helped to build, and to be treated so well and so well received, and to share that with my beloved friends Rosanna and Bill - I'll cherish that memory for the rest of my life.<br><br>It was such a thrill to perform at the Mariposa Folk Festival and the Bread and Roses Festival this year. Both were terrific opportunities to hear fabulous music. I loved Stonefox and Lennie Gallant at Mariposa ... and Corey Dolgon and The Mammals were fabulous at B&amp;R.<br><br>The tour of Ireland in September was a highlight of 2006. It was especially joyous to be reuinited with my dear Dublin friends, Danny and Caitriona Donnelly. If you haven't checked out my photo essay from that tour, please do... My daughter Amy took fabulous pictures of that most memorable adventure!<br><br>And countless kudos to all the organizers and volunteers at the University of Rhode Island Honors Colloquium on Songs of Social Change. The series was extraordinary and it was a real honor to be part of it.<br><br>I'm so blessed to have all of you in my life, and extremely grateful to have such satisfying work. If you haven't heard my new CD yet, please check out <a href=\"http://cdbaby.com/cd/annefeeney6\">CDBaby</a> and get a copy. You'll love it!<br><br>Special thanks to Gerd Berlev, Stuart Acuff, Teresa Allen, Myra and Guido, Stan Swart, Ken &amp; Cee Cee, Joel &amp; Carolyn Henderson, Maureen Wood, Jack McKivigan, Helena Worthen, Gary Cristall, Emma Nation, Shelley Kessler, Robert Jones, Berk Snow, Danny and Caitriona Donnelly, Niall and Jenny Farrell, Jeanne Clark and Tim Sullivan, Joe Mulheron, Mixie McCafferty, Dave Lippman, Pol McAdaim, Charlie McCollester, Charles Darling, Gary O'Dwyer, Margie Rosencranz, Evan Greer, Greg Di Giorgio, Paul Kamm and Eleanore MacDonald, Utah Phillips, Janet and Ken Bates, Paul Bueno de Mesquita, David Rovics, Gail Skidmore, Stephen Wood, Sue Powers, Jerry Starr, Jack Erdie, Marci Woodruff, Amy Newell, Vern and Lenore, Turner Wright, Jim Gorman and Joey Hartman, Jan Hammarlund, Susan Rimby, Jim Watta, Dana Lyons, Betsy Pernotto &amp; Bob Marshall, Al &amp; Dotty Dale, Daniel Sjestraijic, Gene &amp; Natasha, Walt &amp; Rose Brasch, Julie, Dan &amp; Amy -- and of course, you!!<br><br>May 2007 bring us all peace and joy!<br><br>********************************************<br><br>COMING UP ....<br><br>Thursday, January 4th, 2007 8:00 PM<br>IWW presents a CD Release party for &quot;If I Can't Dance&quot;<br>Thunderbird Cafe<br>Butler &amp; Fisk<br>Pittsburgh, PA<br>Price: suggested $10<br>no one will be turned away for lack of funds ... come early to get a seat ... Get a free CD with a donation of $50 to the Mon Valley Unemployed Committee... (all donations of any size to the Mon Valley Unemployed Committee are welcome).<br><br>Thursday, January 11th, 2007 6:30 PM<br>Soup 'n Songs at Sarah's<br>Sarah and Tarmo's house<br>Santa Cruz, CA<br>831-420-0450<br>Price: $10-20 sliding<br>call or email Sarah sring@cruzio.com to reserve seats for this show and get directions to her house. Show will start promptly at 7 and end at 9 - Sarah is making soup!! mmmmmmmmmmm<br><br>Friday, January 12th, 2007 3:00 PM<br>Live on Dave Stafford's Show<br>KKUP - 91.5 FM<br>1241 Franklin Square<br>Santa Clara, CA<br>(408) 260-2999<br>http://www.kkup.org/index.html<br>this station may not stream live on the inernet... i couldn't find the link...<br><br>Friday, January 12th, 2007 5:15 PM<br>Live on Flashpoints w Dennis Bernstein<br>KPFA - 91.4FM<br>708 Valencia<br>San Francisco, CA<br>http://kpfa.org<br>this show will stream live!<br>Friday, January 12th, 2007 6:30 PM<br>Western Workers Labor Heritage Festival<br>Plumbers and Steamfitters Local 467<br>1519 Rollins Road<br>Burlingame, CA<br>http://www.lib.berkeley.edu/~lcushing/WWLHF/WWLHF07.html<br>Coming by BART? Go to the Millbrae stop, last on the peninsula route (station map) and call for shuttle pickup (650) 796-7648 -- For more information,<br>(including hotels and transportation)<br>contact David Winters, (831) 426-4940<br><br>Saturday, January 13th, 2007 9:00 AM<br>Western Workers Labor Heritage Festival<br>Plumbers and Steamfitters Local 467<br>1519 Rollins Road<br>Burlingame, CA<br>http://www.lib.berkeley.edu/~lcushing/WWLHF/WWLHF07.html<br>events go on all day and into the evening!<br><br><br>Sunday, January 14th, 2007 10:00 AM<br>Western Workers Labor Heritage Festival<br>Plumbers and Steamfitters Local 467<br>1519 Rollins Road<br>Burlingame, CA<br>http://www.lib.berkeley.edu/~lcushing/WWLHF/WWLHF07.html<br>Events start at 10 AM and go on all day. Evening Concert at 7PM in Machinists Local 1781, 1511 Rollins Road, Burlingame, CA - in same building complex and featuring Dave Lippman, Lyn Marie Smith and more<br><br><br>Monday, January 15th, 2007 7:00 PM<br>Anne Feeney with Special Guest Mrs. T Bill Banks<br>Redwood Garden<br>2159 Derby St. (@ Claremont Blvd.)<br>Berkeley, CA<br>510-848-6397<br>Price: $10/20 sliding<br>Eleanor Walden ewalden3(@)comcast.net is the contact. . #7 bus stops at front, #51 stops 1 block west at Collage Ave), parking is pretty good on the street.<br><br><br>Thursday, January 18th, 2007 8:30 PM<br>Opening for Paul Kamm &amp; Eleanore MacDonald and the Little Band<br>Cooper's Saloon<br>235 Commercial St<br>Nevada City, CA 95959<br>530.265.0116<br>http://www.coopersnevadacity.com/<br><br>Friday, January 19th, 2007 8:00 PM<br>Jobs with Justice and KSKQ radio present Anne Feeney in concert<br>Unitarian Church<br>Ashland, OR<br>contact brain@mind.net for more info<br><br>Saturday, January 20th, 2007 7:00 PM<br>WILPF presents Anne Feeney in Concert<br>St Andrew's Community Center<br>9th St &amp; NE Alberta<br>Portland, OR<br>Price: $10 sliding<br>gpinkel(@)pacifier.com - Georgia Pinkel is the contact.. The &quot;sliding&quot; admission means pay more if you can, less if you can't...<br><br>Sunday, January 21st, 2007 10:00 AM<br>How about a UU service in PDX, Salem or Eugene or in between?<br><br>Sunday, January 21st, 2007 8:00 PM<br>Anne Feeney in Concert<br>Sam Bond's Garage<br>407 BLAIR BLVD<br>Eugene, OR<br>http://www.sambonds.com/<br><br>Thursday, January 25th, 2007 9:30 PM<br>Anne Feeney and Joey Only<br>Cafe Rime<br>1130 Commercial Drive<br>Vancouver, BC V5L-3X2<br>Canada<br>604-215-1130<br>http://www.rime.ca/event.html<br>Price: $7-10<br>I'll be doing two sets and the fabulous Joey Only will do one set.<br><br>Friday, January 26th, 2007 8:00 PM<br>Sounds &amp; Furies presents (www.soundsandfuries.com)<br>Rhizome Cafe<br>317 E. Broadway (across from Kingsgate Mall)<br>Vancouver, BC<br>A new - and licensed - venue - a happening place!<br>Doors open 7 PM for dinner. Come early for delicious, inexpensive food. Chec out Rhizome's menu at www.rhizomecafe.ca<br>Opening Act: Kate Reid www.katereid.net<br>&quot;One woman, one guitar, lots of attitude&quot;<br>tickets $10 - $15 sliding scale (pay what you can afford on this scale) available early January at<br>Urban Empire (early January) 1108 Commercial Drive<br>Rhizome Cafe, 317 E. Broadway<br><br>Sunday, January 28th, 2007 7:30 PM<br>Victoria Folk Song Society presents Anne Feeney<br>Norway House<br>1110 Hillside (between Quadra and Cook)<br>Victoria, BC<br>(250) 413-3213 or email info at victoriafolkmusic.ca<br>http://www.victoriafolkmusic.ca/index.html<br><br><br>Monday, January 29th, 2007 7:30PM<br>Salt Spring Island Folk Club - BC - Canada<br>Doors open at 6:30 for season ticket holders, 6:45 for general admission. Concerts begin at 7:30.<br>Good Food at affordable prices available from 6:30 pm on<br>Individual Concert Tickets: $15<br>Tickets for individual concerts go on sale 2 weeks before the concert date at the following locations:<br>Ganges -Acoustic Planet (537-9668) Salt Spring Books (537-2812) Fulford -Stuff &amp; Nonsense (653-4620)<br>http://www.saltspringfolkclub.ca/<br><br><br>Wednesday, January 31st, 2007 8:00 PM<br>Anne Feeney in Concert<br>LIUNA Hall<br>1700 N State Street<br>Bellingham, WA 98225<br>Price: $10 suggested<br>Betsy Pernotto is the contact<br><br><br>Friday, February 2nd, 2007 7:00 PM<br>Jobs with Justice presents Groundhog Day with Anne Feeney<br>Community Church of Christ<br>West Seattle, WA<br>http://wsjwj.org<br>Price: $10-20 sliding<br>more details soon!<br><br>Saturday, February 3rd, 2007 7:30 PM<br>Southsound Jobs with Justice presents Anne Feeney<br>tba<br>Tacoma or Gig Harbor, WA<br>more details soon<br><br>Sunday, February 4th, 2007 8:00 PM<br>Looking for a gig<br>Seattle, Tacoma<br>how about a UU service???<br><br>ALWAYS contact the venue before heading out... I do my best to keep things current and accurate at http://annefeeney.com/calendar.html ... but as you all know all too well, I'm not perfect and changes happen.<br><br>That's it for now. HAPPY NEW YEAR!\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
