{
	"date": "Friday, October 06, 2006",
	"title": "Fellow Travelers' Advisory from Anne Feeney - OCTOBER 2006, VOLUME TWO, #7",
	"body": "IMMEDIATE DESTINATIONS:<br><br>Terre Haute, IN<br>San Diego, CA<br>Detroit, MI<br>Lansdowne, PA (near Phila)<br>Youngstown, OH<br>Cobourg, ON<br>Kingston, RI<br>Berlin, MA<br>Cambridge, MA<br>Albany, NY<br>then on to the School of the Americas and northern FL<br><br>MY NEW ENGLAND DATES HAVE FILLED IN ... CHECK THE TWO NEW ADDS FOR NOVEMBER 10th and 12th at <a href=\"http://annefeeney.com/calendar.html\">my tourdates page.</a><br><br>******************************************<br><br>Thank you for signing up for my monthly email news - The Fellow Travelers' Advisory. If this was forwarded to you, you can <a href=\"http://annefeeney.com/newsletter.html \">subscribe</a> and have it delivered to your inbox once a month.<br><br><br>To order CDs please click <a href=\"http://cdbaby.com/all/unionmaid\">here.</a><br><br>********************************************<br><br>IN THIS ISSUE:<br><br>IRISH TOUR<br><br>SHANNON 5 - RAYTHEON 9<br><br>NEW CD - IF I CAN'T DANCE<br><br>JOE GLAZER - LABOR'S TROUBADOUR - (1918-2006)<br><br>FAMILY NEWS ..  <br><br>DUMP THE BOSSES OFF YOUR BACK LATER<br><br>SWEDISH ELECTIONS<br><br>RADICAL UNIONISM IN THE MIDWEST<br><br>********************************************<br><br>Even with the jet lag I feel much better right now than I did 27 years ago today. My son Daniel was born at 2:30PM on the 6th after 52 hours of labor...but more about that in family news.<br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/blogger/5548/167/1600/malinsunset.0.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/blogger/5548/167/320/malinsunset.0.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a>My daughter Amy and my sister Kate joined me for the Irish tour.  Our travels took us almost 2000 miles throughout the Republic and Northern Ireland in the course of three weeks.  I've put a terrific two part photo essay just below this - Amy took this photo of sunset at Malin Head - the northernmost point of the Emerald Isle.<br><br>-- I really hope you'll take a minute to check it out.<br><br>********************************************<br><br>SHANNON 5, RAYTHEON 9<br><br>It's not a football score -<br><br>Check out these five Catholic-worker <a href=\"http://warontrial.com/\">Pit Stop Ploughshares</a> activists and the amazing outcome of their trial for doing $2.5 million of damage to US weaponry en route to Iraq at Shannon Airport. &quot;The jury is the conscience of the community chosen randomly from Irish society. The conscience of<br>the community has spoken. The government has no popular mandate in providing the civilian Shannon airport to service the US war machine in its illegal invasion and occupation of Iraq. ... &quot;The decision of this jury should be a message to London, Washington DC and the Dail that Ireland wants no part in waging war on the people of Iraq. Refuelling of US warplanes at Shannon Airport should cease immediately. &quot; - Ciaron, Damien, Karen, Deirdre and Nuin... The Shannon 5<br><br>And on August 9, 2006 nine Derry activists exposed Raytheon/Derry's involvement in US/Iraq war activities by occupying the Derry offices and seizing files implicating Raytheon. <a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/blogger/5548/167/1600/killing.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/blogger/5548/167/320/killing.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a> The nine face major criminal charges. You can support them by going to <a href=\"http://www.petitiononline.com/dawc/petition.html\">Petition Online</a><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/blogger/5548/167/1600/300_0___20_0_0_0_0_0_mccann.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/blogger/5548/167/320/300_0___20_0_0_0_0_0_mccann.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/blogger/5548/167/1600/300_0___20_0_0_0_0_0_plaquard.0.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/blogger/5548/167/320/300_0___20_0_0_0_0_0_plaquard.0.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><br><br>********************************************<br><br>IF I CAN'T DANCE<br><br>My new CD, &quot;If I Can't Dance&quot; is getting rave reviews.  Our local entertainment weekly - Pittsburgh City Paper - says it's &quot;sure to amuse lefties with a sense of humor -- and history... The spirit of protest is often leavened with a brash, humorous outlook on the world's problems, accompanied by an eclectic collection of instruments spanning boogie-woogie piano, electric guitar, simple acoustic strums and uillean bagpipes... Ultimately, what unites and enlivens all the songs is Feeney's clear voice, often reminiscent of Amy Rigby's.&quot;<br><br>Get one today! -- Visit <a href=\"http://cdbaby.com/cd/annefeeney6\">CDBaby</a> or call 1.800.BUY.MY.CD<br><br>********************************************<br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/blogger/5548/167/1600/glazerimage.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/blogger/5548/167/320/glazerimage.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a>JOE GLAZER - LABOR'S TROUBADOUR - (1918-2006)<br><br>It's with great sadness that I share the news that Joe Glazer died on September 19th.  He was a good friend and mentor and a wonderful agitator and performer.  I had never written a labor song and only knew a handful of classic labor songs when I met Joe in 1988 at the Great Labor Arts Exchange.  He and the Labor Heritage Foundation were instrumental in showing me how to make my life and career part of the labor movement.<br><br>There is a well-written obituary documenting Joe's long and remarkable life at the <a href=\"http://blog.aflcio.org/2006/09/21/union-movement-mourns-death-of-labor%e2%80%99s-troubadour-joe-glazer/\">AFL-CIO Website</a> and his family requests donations be made to the:<br><br>Labor Heritage Foundation<br>815 16th St. NW<br>Washington, DC 20006<br><br>********************************************<br><br>FAMILY NEWS<br><br>My nephew Casey Horne is 12!<br><br>Happy October 6 birthdays to Jennifer Erin McCahill (26), Maureen Metcalfe (39+) and Daniel Berlin (27)!<br><br>Father Bill Feeney will be 60 (!) this month<br><br>Happy Birthdays too to Jill Weldon Merrill and Steve Merrill!<br><br>Aunt Claire is a great grandma again --Charlie Warren arrived on Wednesday, September 27 at 7 lbs. 8 oz - Proud parents Kelly Grefenstette Warren and Charles Warren... (I guess that explains why Charles wasn't in Ireland for the Ryder cup!)<br><br>Erin Brown and Paul Blake welcomed their second son - James Paul Blake on August 10, 2006 - weighing in at 7lb. 6 oz. Here are some photos:<a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/blogger/5548/167/1600/JPBfamily.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/blogger/5548/167/320/JPBfamily.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/blogger/5548/167/1600/bambino.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/blogger/5548/167/320/bambino.jpg\" style=\"float:right; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><br><br><br><br><br><br><br><br><br><br><br><br>********************************************<br>DUMP THE BOSSES OFF YOUR BACK LATER<br><br>Actually, please go ahead and dump the bosses off your back right now if you can. But my upcoming CD, &quot;Dump the Bosses Off Your Back,&quot; is on hold  -- the Irish tour was fantastic, but it didn't begin to include enough gigs to cover expenses ... so, I'm licking my financial wounds for a little while... I expect to regroup and get the early finished CD out soon... just not in time for Christmas shopping as I had hoped. That could change in a heartbeat if everyone who read this newsletter bought any cd of mine today... how about it?<br><br><a href=\"http://cdbaby.com/all/unionmaid\">http://cdbaby.com/all/unionmaid</a><br><br>********************************************<br>SWEDISH ELECTIONS<br><br>It was sickening to see the Social Democrats lose power to the conservative Center Party.  (On the other hand, the Left Party, that I worked for in Sweden in August, did okay in the elections ... outperforming the pollsters' estimates...)  This always seems to happen when so-called progressives try to move to the right to be popular.  If the only choice people have is between a right winger and an imitation right-winger they'll pick the real right winger most of the time... except for the horde that just stays home.  That being said, I still hope that all  Pennsylvanians understand how important it is to punish Rick Santorum and get him out of the Senate.<br><br>********************************************<br><br>RADICALISM IN THE MIDWEST<br><br>As I head off to the midwest for the Debs dinner, I should tell you about Rose Feurer's new book. For $25 paperback you can learn from Rose about midwest radical unionism.  I'll bet it's an exciting and informative read. To buy it, <a href=\"http://www.press.uillinois.edu/s06/feurer.html\">click here.<br></a><br><br>The most current information on my upcoming dates is <a href=\"http://annefeeney.com/calendar.html\">posted on my website.</a>  Hope to see you at a show!  Until next month... raise hell!\n<div style=\"clear: both;\"></div>"
}
