{
	"date": "Friday, April 01, 2005",
	"title": "Fellow Travelers' Advisory: Volume One, Number One!",
	"body": "<em>IMMEDIATE DESTINATIONS </em>- Philadelphia, PA - Detroit, MI - LAS VEGAS, NV - Bloomsburg, PA - Haledon, NJ -  New Brunswick, NJ - Milwaukee and Madison, WI - Chicago, IL - and then on to Sweden and Denmark with David Rovics!! Get all the details at <a href=\"http://annefeeney.com/calendar.html\">my website</a>.<br><br>NOW BOOKING: <em>The great northwest... Northern CA, Oregon, Washington</em> <br><br><strong>Fellow Travelers' Advisory: April, 2005 - Volume 1, Number One</strong> <br><br>Welcome to the very first of what I promised would be a monthly newsletter. We'll see. After four years of watching <a href=\"http://chrischandler.org\">Chandler,</a> I am somewhat intimidated by the high standard he set, but here goes:<br> <br>On St Patrick's Day I was singing at the US Botanical Gardens (a gorgeous public space which is part of the Capitol grounds) for the United American Nurses -- the union component of the American Nurses' Association.  It was a glamorous event.  Fantastic food, Teresa Heinz Kerry as the keynote speaker, a room full of interested and interesting people.  <br><br>It's the first St Patrick's Day in forever that I wasn't singing to a bunch of Irish and wanna-be Irish in a pub full of green beer. Even so, I was able to tell the nurses &quot;Why Paddy's Not at Work Today,&quot; since I perform it as a cautionary tale about safety on the job, but that was it for the Irish music -- until the encore. <br><br>There, in the shadow of the Capitol, I got 200 nurses and their allies to sing and sway to the traditional Irish tune (well ...... it was written by an Irish workers' collective):<br><br><em><strong>&quot;Hey Ronnie Reagan, I'm black and I'm pagan, I'm gay and I'm left and I'm free -- I'm a non-fundamentalist environmentalist -- Please don't bother me.&quot; </strong></em><br><br>I looked out at a crowd that was barely old enough to remember the Reagan years and felt I ought to provide a little background:<br> <br>&quot;Back then, the world was a much different and really scary place.  America was embroiled in an international battle with a dangerous and devious enemy, bent on the destruction of our way of life. This 'Evil Empire' pretended to be a 'legitimate' government, but red-blooded Americans knew better than to be fooled -- <br> <br>For example, the Evil Empire had elections, but their elections were frauds --  The Empire was run by incumbents, and when there was a &quot;race&quot; there was very little difference between the candidates, who were hand-picked by powerful groups who didn't care at all about ordinary working folks. As a result, ordinary folks were very cynical about electoral politics.<br> <br>Mothers in the Evil Empire were forced to go to work and put their children in overcrowded, understaffed child care centers.<br> <br>And while the Evil Empire sported multiple newspapers and television channels, the media was completely in the hands of those same powerful interests and served as little more than a propaganda arm of the state. It was even rumored that the government produced 'news stories' for broadcast and paid so-called journalists to advance the government's agenda. (Dmitri &quot;Jeff&quot; Gannonovich comes to mind...)<br> <br>Although dissent was widespread, popular anti-government movements were invisible in the news. Dissent was silenced and punished. Millions of people were imprisoned in the Evil Empire, and others who could not adapt to the regime were given drugs and brainwashed.  People were asked to spy on their neighbors and report anything suspicious to the government.<br> <br>And it wasn't all perfect here, either. Then-President Reagan's tax breaks for the wealthy had created the biggest deficit in our nation's history. There was complete apathy in Washington about our deteriorating environment. Our returning veterans received little assistance from the government, even though our military budget was so bloated that it threatened all of our social programs.&quot;<br> <br>Thank goodness times have changed!<br>  <br>Well, that's all for this month. Forward it on to your friends and relations. Let me know what you think - Write me at unionmaid@earthlink.net -- I'd love to find some other things to do on the Madison/Milwaukee/Chicago corridor in May ... if you've got any ideas, let me know! And there's the great northwest this summer!<br><br>***************************************************************<br><br>I was tempted to try an April Fool's Day approach with this first issue - but in this Orwellian era, how do you come up with 'far fetched stories'? I mean, ten years ago, who would have even dreamed we'd be talking about scrapping Social Security?* that someone who hates the UN would be our ambassador to the UN?  that John Negroponte**, who ran his own little &quot;war on terror&quot; in Central America in the early 80s, would be our Director of National Intelligence? <br> <br>***************************************************************<br> <br>*Social Security is currently being auctioned off to the highest bidder on <a href=\"http://billionairesforbush.com/ebay.php\">E-Bay</a>.  I actually heard a stockbroker guest on FOX News say: &quot;Keep in mind that Social Security is a relatively new concept.  We got along fine without it for 160 years.&quot;  Unless you are nostalgic for a return to the days of poorhouses and old folks on the street selling pencils and apples, best get your <a href=\"http://www.unionvoice.org/campaign/sspledge\">butt in motion.</a>  <br><br> <br>***************************************************************<br><br>** In 1995 Gary Cohn and Ginger Thompson of <a href=\"http://64.233.167.104/search?q=cache:mbtvpGh2MrYJ:counterpunch.org/hassan06042004.html+%22John+Negroponte%22&amp;hl=en\">The Baltimore Sun</a> unearthed massive and substantiated evidence from various sources pointing the finger at Mr. Negroponte's knowledge of the crimes. The reporters also found that hundreds of Hondurans &quot;were kidnapped, tortured and killed in the 1980s by a secret army unit trained and supported by the CIA&quot;(2). Reliable evidence from the Inter-American Commission on Human Rights in Honduras alleged that Negroponte oversaw the expansion of U.S training camp and military base on Honduran territory, where US-trained Contras terrorists, and where the military secretly detained, tortured and executed Honduran suspected dissidents. <br><br>*****************************************************************<br>My CDs are available at <a href=\"http://cdbaby.com/all/unionmaid\">CDBaby</a> and you can also do individual digital downloads at a lot of sites, like <a href=\"http://launch.yahoo.com/ar-9029007---Anne-Feeney\">Yahoo</a> these days. <br><br>******************************************************************<br> <br>It's really ironic that Terry Schiavo's health care costs are being provided by the proceeds from a medical malpractice suit and Medicaid -- two things W would get rid of if he could...<br> <br><br>******************************************************************<br> <br>Many of you are still reeling from the untimely death of <a href=\"http://rachelbissex.com\">Rachel Bissex.</a> A scholarship fund has been established for her children Emma and Matt. This would be a great way to honor the memory of our dear departed ally and supporter Bruce Rouse.  Checks should be mailed to Merchants Bank, 164 College Street, Burlington VT 05401. Make checks payable to Bissex College Fund, Account #01827674.  Plans are in the works for a tribute CD too.<br> <br>******************************************************************<br> <br>Congratulations to Greg and Erin McCahill on the birth of Griffin Lane McCahill and to Scott Reed and Andrea Davis on the arrival of Katelyn Amaya Davis Reed!<br> <br>******************************************************************<br> <br>The Kids are All Right - check out the <a href=\"http://riotfolk.org\">Riotfolk</a> website for some exciting music from young activists.<br> <br>******************************************************************<br> <br>HUNDREDTH MONKEY -- Thanks to everyone who signed the Boycott Taco Bell Pledge postcards.  Thanks to our efforts (and Jimmy Carter's), a settlement has been reached. The boycott is over.  Go celebrate with a seven layer burrito, and keep monitoring the <a href=\"http://ciw-online.org\">website</a> of the Coalition of Immokalee Workers for the latest developments in their quest for justice!<br> <br>***********************************************************************<br> <br>If you haven't seen &quot;Born Into Brothels,&quot; rent it! It's terrific.<br> <br>***********************************************************************<br> <br><br>Here's the <a href=\"http://annefeeney.com\">tour schedule!</a> Hope to see you on the road!\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
