{
	"date": "Monday, September 06, 2004",
	"title": "The Toronto International Film Festival",
	"body": "<a href=\"http://www.e.bell.ca/filmfest/2004/filmsschedules/description.asp?pageID=filmlist&amp;id=152\">Bell - The Toronto International Film Festival</a>\n<br>\n<br>Production Company: Ginger Group Productions/L.K. Cohl\n<br>Executive Producer: Harold Leventhal, Arlo Guthrie\n<br>Producer: Jim Brown, Michael Cohl, William Eigen\n<br>Editor: Adam Browne, Paul Petrissans, Sam Pollard\n<br>Sound: Alan Silverman\n<br>Principal Cast: Featuring: Harold Leventhal, The Weavers, Arlo Guthrie, Pete Seeger, Leon Bibb, Theodore Bikel, Peter, Paul and Mary\n<br>\n<br>Isn't This a Time! A Tribute Concert for Harold Leventhal features the most influential talents in folk music &#x2013; The Weavers (Pete Seeger, Fred Hellerman, Ronnie Gilbert and Erik Darling, who perform together here for the first time in twenty-eight years); Arlo Guthrie; Peter, Paul and Mary; Theodore Bikel; and Leon Bibb &#x2013; as they honour Harold Leventhal, an active supporter of folk music for fifty years and the beloved promoter who made their careers possible. Jim Brown's documentary of their Thanksgiving 2003 Carnegie Hall reunion concert is a heartening, intoxicating brew of music history, political activism and glorious song. \n<br>\n<br>Many of the performers &#x2013; including those who experienced the Depression and the rise of fascism &#x2013; state that our current era is the most unjust they have witnessed and The Weavers lay blame squarely on George W. Bush with their scathing &#x201C;tribute&#x201D; song, &#x201C;Sinner Man.&#x201D; The highlight of the film is these dazzling, life-sustaining and empowering songs: Seeger's heartbreaking rendition of &#x201C;Guantanamera,&#x201D; Bikel's entrancing Russian folk number, Peter, Paul and Mary's rousing &#x201C;Have You Been to Jail for Justice?&#x201D; and Guthrie's anthem &#x201C;Patriot's Dream&#x201D; and his vigorous &#x201C;City of New Orleans.&#x201D; \n<br>\n<br>While the performances are extraordinary, this concert film is also a testament to the struggle against oppression through music: everyone is as politically radical as ever. Folk music preaches continuity, community and tradition, bringing people of all ages and identities together to inspire them to get out in the streets and fight. The vivacious Gilbert emphasizes how music will always be fuelled by politics when she says, &#x201C;There will never be a time where there isn't something to yell about, speak about, teach about, hope about.&#x201D; \n<br>\n<br>The Weavers were the only musical act to be blacklisted during the McCarthy era, but Leventhal, who shared their left-leaning politics, stood by them and resurrected their career. Their reunion concert was a historical event, a touchstone that showed that the people could not be defeated, that resistance was possible. In these angry times, they are an inspiration to us all. To honour Leventhal, their history and the world premiere of this film, The Weavers will reunite with Pete Seeger for a live performance directly following the first public screening. \n<br>\n<br>- Noah Cowan \n<br>\n<br>Jim Brown has directed and produced many acclaimed documentaries, including The Weavers: Wasn't That a Time! (82), Woody Guthrie: Hard Travelin' (84), Musical Passage (84), A Vision Shared: A Tribute to Woody Guthrie and Lead Belly (88), We Shall Overcome (89), American Roots Music (01) and Isn't This a Time! A Tribute Concert for Harold Leventhal (04).\n<br>\n<br>\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
