{
	"date": "Monday, September 03, 2007",
	"title": "Anne Feeney's Fellow Travelers' Advisory - SEPTEMBER 2007, VOLUME THREE, #6",
	"body": "Thanks for checking out my blog, coming to my shows &amp; buying my recordings (and in many cases, hosting me at your home, forwarding this email to your friends, telling me about upcoming conferences, conventions and riots in your area)!!! I could not do this without you. You can have the Fellow Travelers' Advisory delivered to your inbox each month by visiting <a href=\"http://annefeeney.com/newsletter.html\">signing up!</a><br><br>If you're looking for my CDs, I recommend <a href=\"http://cdbaby.com/all/unionmaid\">CDBABY</a><br><br>Love and Solidarity Forever this Labor Day 2007,<br><br>Anne<br>********************************************<br>IN THIS ISSUE:<br><br>LABOR DAY<br>I'M GETTING THE &quot;MOTHER JONES&quot; AWARD!<br>BURIED<br>IRELAND<br>JOEL WALKER'S GUEST BOOK<br>FAMILY NEWS<br>RADIO FOLKS - CHECK OUT THE SATURDAY LIGHT BRIGADE<br>BELLY LAUGH OF THE MONTH<br><br>********************************************<br>IMMEDIATE DESTINATIONS: (details continually updating at <a href=\"http://annefeeney.com/calendar.html \">my website </a>)<br><br>SWEDEN - Smedjebacken, Orebro, Stockholm, Brunsviik, Gothenburg<br><br>PITTSBURGH<br>CINCINNATI<br>LEXINGTON<br>LOUISVILLE<br>TERRE HAUTE<br>MT CARROLL, IL<br>DE KALB, IL<br>CHAMPAIGN, IL<br>MILWAUKEE, WI<br>LUCK, WI<br>MINNEAPOLIS, MN<br>WINONA, MN<br>LAKE CITY, MN<br>IOWA CITY, IA<br>MOHICAN STATE PARK, OH<br>NEW YORK CITY, NY<br>ERIE, PA<br>LAKE HARMONY, PA<br>CHARLESTON, WV<br>PORTLAND, OR<br>FT BENNING, GA<br><br>********************************************<br><br>LABOR DAY 2007<br><br>This morning I will join thousands of Pittsburgh labor folks and march in the Labor Day Parade. We frequently hear people say things like, &quot;There was a time when unions were relevant and important, but now they are no longer needed.&quot;<br><br>I guess they say that because we all make a comfortable wage, work in safe workplaces, have generous vacation and family leave benefits, secure generous pension packages, real job security and comprehensive, quality health insurance benefits for ourselves and our families ... Oh, wait!! Most of us don't have ANY of those things!!!! Maybe we still need unions....<br><br>Consider the following...<br><br>Every 23 minutes a worker in the US is fired for engaging in union activity. Are the firings legal? NO. Do bosses continue to get away with it? YES Why? Because there are no real penalties for illegal firing of workers.<br><br>Every year approximately 6000 workers are killed outright on their jobs... like the Sago Miners, the Crandall Canyon Miners ... or like Eleazar Torres Gomez...<br><br><br>Eleazar Torres Gomez, a CINTAS employee, was working in the Tulsa laundry's automated washroom. He was caught on a conveyor and dragged into an industrial dryer&#x2014;where he was trapped in temperatures up to 300 degrees for at least 20 minutes. He died on the scene of trauma and thermal injuries. Cintas CEO Scott Farmer issued a press release blaming Mr. Torres Gomez for his own death soon after the fatality.<br><br>You can read the full story at:<br><a href=\"http://www.unitehere.org/frontpagedetail.php?ID=3044\"><br>http://www.unitehere.org/frontpagedetail.php?ID=3044</a><br><br>Although OSHA is currently proposing a record fine of $2.78 Million against CINTAS, it is unlikely that CINTAS will ever pay even a fraction of that figure.<br><br>And every year the Department of Labor acknowledges that approximately 60,000 (SIXTY THOUSAND) American workers die from going to work... In addition to the 6000 killed outright, another 54,000 die from work related cancers, from asbestosis, silicosis, black lung, brown lung ...<br><br>Organized labor is leading the fight for safe workplaces, protecting social security, family and medical leave, medicare, immigrants' rights ... for an end to child labor, prison labor, sexual harassment, discrimination ...<br><br>And as the corporate WAR ON THE WORKERS progresses, we see our standard of living decline. Now, more than ever...<br><br>HONOR LABOR<br><br><br>********************************************<br><br>THE 2007 MOTHER JONES AWARD<br><br>This year the PA Labor History Society is hosting its annual gathering in Pittsburgh. On September 28th my colleague and union brother MIKE STOUT and I will be presented with the MOTHER JONES award from the society.<br><br>I'm thrilled to be recognized by PALHS, which does such terrific work in keeping labor history alive and visible in Pennsylvania. Please support their work by sending a $25 contribution to:<br><br>PALHS c/o Cindy Spielman<br>IUP Labor Center<br>9 Keith Hall, 390 Pratt Dr<br>Indiana, PA 15705<br><br>Your name will be included in this year's commemorative program, and you'll receive a copy of the program. Please send your contribution before September 15th to insure inclusion in the program.<br><br>*********************************************<br><br>BURIED: The Story of the Sago Mine Disaster<br><br>Jerry Starr's wonderful play has really taken shape. Dale Morris directed a wonderful reading of the play featuring a terrific cast. The four shows in San Diego were well received and we're looking forward to productions in Boston, Detroit, Chicago and San Francisco in 2008. If you'd like to see the play, drop me a line and Jerry and I will help you to organize a production in your town.<br><br><a href=\"http://www.pww.org/article/articleview/11597/1/387\">Here's a link to a review of the show..</a><br><br>And I want to add what a thrill it was to perform and co-present a workshop at the USW Health, Safety and Environment Conference in Dearborn last month. I learned so much. This weeklong educational event also included a truly inspiring speech from USW President Leo Girard calling for clean technologies and our right to a job that leaves the environment better for our children and grandchildren.<br><br>Former USW Director Dave Foster's BLUE/GREEN alliance with the Sierra Club represents a promising development ... Labor partnering with environmentalists is the way to a more secure future for us all.<br><br>*********************************************<br><br>IRELAND 2008<br><br>The tourdates are set...<br><br>Tour Number 1 *** June 10 - 19<br><br>Tour Number 2 *** Aug 15 - 24<br><br>Tour Number 3 *** Sept 30 - October 9<br><br>and the seats are filling fast! I'd love to show you the wonderful west coast of Ireland in 2008. My partner, Tom Piggott and I promise you the best scenery, the best music ... a chance to see the very best of Ireland. Tom has been conducting these fabulous tours of Ireland for many years, and together we'll give you the experience of a lifetime!<br><br>These will be tours focusing on Irish music, poetry, politics and history. We'll have a ball. I can only take 20 people on each tour. If you'd like more information, reply to this newsletter and request all the details.<br><br>*********************************************<br><br>JOEL DANIELS WALKER (1979-2007)<br><br>Joel Walker was one of the smartest and dearest little boys I ever new. He and my son, Daniel, were inseparable for many years. Joel's sister, Rebecca, and my daughter, Amy, are very close friends. I hadn't seen Joel for a few years, but I heard he had graduated from the Pittsburgh Culinary Institute and was a great chef. I was stunned and saddened to learn that Joel was found dead in his home on August 20th.<br><br>Joel's mom, Phoebe, and step-dad Hank, his brother Ben, and sisters Rebecca and Allegra, and Joel's father, Mark could all use your prayers, good wishes and words of consolation. The family is particularly hoping for reminiscences of time spent with Joel.<br><br>If you knew Joel, or if you've experienced this kind of senseless and devastating loss, perhaps you can take a minute to extend your sympathy here:<br><a href=\"http://www.legacy.com/postgazette/GB/GuestbookEntry.aspx?&amp;PersonID=93139017\"><br>http://www.legacy.com/postgazette/GB/GuestbookEntry.aspx?&amp;PersonID=93139017</a><br><br>********************************************<br><br>FAMILY NEWS<br><br>Happy Birthdays August 31- my stepson Jonas Engstrom (26) and September 1st to my beautiful daughter Amy! Amy celebrated her 26th birthday at the Kerrville Folk Festival's &quot;Little Folk&quot; Wine and Music Festival.<br><br>Happy September 11th birthday to Mary O'Connor Grefenstette.<br><br>Happy September 25th birthday to my friend Mary Kerchner<br><br>Congratulations to cousin Erin Grefenstette Henninger and proud papa Mark Henninger on the arrival of daughter Marlo Mary ... a real beauty!<br><br>Cousins Mary and Tom Weldon are taking the inland passage cruise to Alaska ... what fun!<br><br>I spent 10 days at the end of last month in Guatemala with my son, Daniel. He and a group of law students from Georgetown went there to investigate the impact on Guatemalan society from our massive deportations of Guatemalan youth.<br><br>Many of these young deportees are gang members, some are just suspected gang members -- some have lived in the US for most of their lives and are returned with no money, no family and no fluency in Spanish.<br><br>Dan's group interviewed many gang members, many inmates at a maximum security prison, officials from the Department of Homeland security, Guatemalan police, and representatives of groups trying to ameliorate their transition back into Guatemalan society. Their findings will be very important, and I think, newsworthy.<br><br>I'm filled with admiration for Dan and all the dedicated young people who accompanied him on this fact-finding mission.<br><br>At the conclusion of their work, Dan and I returned to his Peace Corps site in Tejutla, which is in the high mountains of western Guatemala. It was a joy to see how happy the folks Dan worked with there were to see him return to Tejutla. The generosity of the Guatemalan people is touching.<br><br>I'm hoping my cousins send me some photos of ...<br>the triplets' second birthday, our vacation adventures in the Outer Banks, and lovely Ms. Marlo ... whaddya say, cousins??<br><br>********************************************<br>SATURDAY LIGHT BRIGADE - Award Winning Public Radio for Kids &amp; Adults<br><br>On Saturday I did a Labor Day themed performance in the beautiful new broadcast studios of the Saturday Light Brigade. I've been a fan of this show since it went on the air in 1978, and have guested many times over the years. The show has at least five station affiliates and streams live. Their shows are archived online, too.<br><br>Broadcasting from Children's Museum of Pittsburgh, The Saturday Light Brigade is a radio program featuring acoustic music and family fun. Broadcast since 1978, it is one of the longest-running public radio programs in the United. States. Quality music, on-air telephone calls from kids and adults, innovative participatory puzzles and games, and interesting guests have made The Saturday Light Brigade a family radio tradition for tens of thousands of people. Kids listen with adults, adults listen with kids, and everyone has fun listening to the radio together!<br><br>check out <a href=\"http://slbradio.org\">http://slbradio.org</a> -- maybe you can bring this high quality family programming to your town, too!<br><br>********************************************<br><a href=\"http://feministing.com/archives/007581.html\">BELLY LAUGH OF THE MONTH: A B.A. IN LADYLIKE SUBMISSION....</a><br><br><br>The Southwestern Baptist Theological Seminary is offering a new and exciting academic program: homemaking!<br><br>Southwestern Baptist, one of the nation's largest Southern Baptist seminaries, is introducing a new academic program in homemaking as part of an effort to establish what its president calls biblical family and gender roles.<br><br>It will offer a bachelor of arts in humanities degree with a 23-hour concentration in homemaking. The program is only open to women.<br><br>Of course it is. Coursework for the program includes nutrition and meal preparation, textile design and classes on &quot;the value of a child&quot; and the &quot;biblical model for the home and family.&quot;<br><br>Seminary President Paige Patterson says &quot;We are moving against the tide in order to establish family and gender roles as described in God's word for the home and the family...If we do not do something to salvage the future of the home, both our denomination and our nation will be destroyed.&quot;<br><br>I always thought nations were destroyed by war, famine or disease. Little did I know it was actually women taking classes in anything other than ironing that determines the demise of a country.<br><br>By the way, Patterson is known in Southern Baptist circles for issuing a statement saying that women shouldn't be pastors and that they should &quot;graciously submit&quot; to their husbands. (How one &quot;graciously submits&quot; is another question. Would I smile and thank him for the great honor of doing his laundry?)<br><br>Earlier this year, a former professor filed a federal discrimination lawsuit against the school and Patterson--she says she was fired from her tenure-track position because she was a woman. Perhaps she didn't graciously submit. Silly girl. In fact, Patterson's wife is the only woman faculty member in Southwestern's theology school. Shocking.<br><br>Though, of course, this isn't just about Patterson. Plenty of folks at the school are behind the move to instill traditional gender roles in their students. Terri Stovall, dean of women's programs at Southwestern, said &quot;Whether a woman works outside or strictly in the home, her first priority is her family and home...We just really want to step up and provide some of these skills.&quot; Yeah, way to step up. I'm sure women graduates will look back on their years at the Southwestern Baptist Theological Seminary and be ever-so-grateful that they spent half of their college education learning how to knit booties.<br><br>*********************************************\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
