{
	"date": "Monday, May 30, 2005",
	"title": "Fellow Travelers' Advisory from Anne Feeney - JUNE 2005: VOLUME ONE, Number Three",
	"body": "JUNE DESTINATIONS: Toronto, Hamilton &amp; Peterborough, Ontario; Pittsburgh, PA; Madison, WI; Quad Cities (Rock Island, IL); Winona, MN; Washington, DC; St. Louis, MO; Mt. Olive, IL and Chicago, IL<br><br>CDS available at http://cdbaby.com/all/unionmaid - great Father's Day gifts!<br><br><br>Copenhagen<br>30 May 2005<br><br>Yes, folks ... I'm in Hans Christian Andersen land where spring is still springing and the days are already 18 hours long.  I'll never figure out why flights to Europe leave in the evening from the US. <br><br>Arriving at the crack of dawn on no sleep is a prescription for a few miserable days at the start of any European visit.  I got over it though, and it's a good thing, because David Rovics and Jan Hammarlund are great hellraising companeros and we were really busy here in Scandinavia.<br><br>Touring with David Rovics is a blast.  I'm sure we'll be doing it again.  I love singing on his songs and he does a great job on mine, and our repertoires are very different so the variety is great.  Gerd Berlev in Copenhagen organized the most wonderful gigs for us while we were in Denmark... a terrific peace festival where we got to hear Per Warming, a fine Danish folksinger, and Savage Rose, an amazing Danish band....<br><br>and....... our wonderful new friend Jan Hammarlund who did a great job of organizing gigs for us in Sweden.  We put thousands of miles by car, plane, train and taxi during this trip, but it was fantastic.  I've put a link to his website below, but nothing does him justice like hearing him live.  He's a terrific performer, great sense of humor, thoughtful, great player... I can't say enough.  I hope to bring him to the US to tour soon.<br><br>Most of the folks we met in Sweden and Denmark are bitterly opposed to most of the workings of the European Union and rejoiced when France voted down the proposed &quot;European Constitution&quot; that would override the constitutions of the European social democracies and escalate this race to the bottom.<br><br>I'll have photos up on the blog soon, and you'll be able to see the Coca-Cola Boycott concert, the End the Embargo show, the fantastic Danish labor school in Helsingor and much much more.. http://whirled_retort.blogspot.com/<br><br>I'm looking forward to my upcoming visits to Canada, the midwest and of course CA, OR, WA and BC!  I'm booking Florida dates in January 2006... email me with any ideas.<br><br>Kerrhugs to all my camping buddies at the Kerrville Folk Festival.<br><br>Love and Solidarity <br>Anne<br><br><br>&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;<br>some performer links...<br><br>Jan Hammarlund - http://janhammarlund.se/ <br>He's fluent in Swedish, English, Spanish, Danish and several other languages.  Jan has translated Violeta Para songs into Swedish and introduced her music to Sweden.  He's traveled in Chile and he's a fabulous performer. He's a terrific guitar player with a clear and true voice and a great sense of humor.  <br><br>Per Warming http://sogneaften.com/per_warming.htm<br>A very thoughtful man, and a skilled player... although I don't understand a word of Danish, it was easy to see that the audience adored him.<br><br>Savage Rose - Thomas and Annissette <br>http://www.thesavagerose.com/srindex.html<br>stage magic... Thomas on accordion and Annissette... well, seeing is believing... they've got a great website.<br><br><br>&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;<br><br>Check this out...<br><br>shop till you drop in Mexico...<br>You probably know that workers are generally paid much less in Mexico than they'd earn doing the same job in the U.S. But do you know how much less?  And what difference does that make?<br> <br>Many people imagine that those lower wages go farther, because of lower prices in Mexico.<br>Using this new interactive feature on the UE International web site, check out that assumption.  The site invites you to pick a worker &#x2013; whether it's a teacher or factory worker, nurse or plumber, social worker or bank employee.<br><br>http://www.ueinternational.org/shop/index.php<br><br>My pal Nancy Brigham has done a fabulous job of researching and demonstrating how the exporting of jobs is working out for workers in Mexico... This is a terrific piece of work Nancy has done... check it out!<br><br><br>&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;<br><br>Several folks have written to congratulate me on the Joe Hill Award and inquire as to how they can share in the celebration.  If you can't join me at the Great Labor Arts Exchange in Washington, DC, visit http://laborheritage.org/lhwho.htm - your tax deductible contribution to:<br><br>The Labor Heritage Foundation<br>888 16th St. NW Suite 680<br>Washington, DC 20006<br><br>will go a long way toward helping cultural workers in the labor movement.<br><br>&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;<br><br>I'm not sure that we can click our way to a better world, but there are some really good sites that monitor breaking news and allow us to respond quickly to legislative and other shenanigans...<br><br>http://ProgressiveSecretary.org<br>http://truthout.org<br>http://www.fair.org<br>http://www.pfaw.org/pfaw/general/<br><br>############################<br><br>COMING UP---<br><br>Friday, June 3rd, 2005 8:00 PM<br>Toronto Concert with George Hewison Trio and Fellow Worker<br>USWA Hall<br>25 Cecil Street<br>Toronto, ON<br>CANADA<br>george hewison is putting this together - (705) 657-2351<br>e-mail ghewison@sympatico.ca<br>tickets for sale at the door and<br>@ Toronto Women's Bookstore<br>73 Harbord Street (Toronto)<br><br><br>Saturday, June 4th, 2005 8:00 PM<br>Hamilton Concert with George Hewison Trio and Fellow Worker<br>Skydragon Centre<br>24 King St. East, 3rd Floor<br>Hamilton, ON L8N 1A3<br>CANADA<br>george hewison is organizing this one<br>(905) 777-8102<br>contact: Kevin MacKay<br>kevin@skydragon.org<br><br><br>Sunday, June 5th, 2005 8:00 PM<br>Anne Feeney in Peterborough Concert<br>with George Hewison Trio and Fellow Worker<br>395 Aylmer Street North<br>Peterborough, ON CANADA<br>705-876-6530 is the club phone.<br>contact Fellow Worker at:<br>laboursinger@yahoo.ca<br><br>Wednesday, June 8th, 2005 8:00 PM<br>Mountain Justice Benefit<br>Quiet Storm<br>Penn Avenue<br>Pittsburgh, PA 15224<br>http://thomasmertoncenter.org<br>Join me and a lot of special guests as we raise some money and some awareness. Mountain top mining is destroying West Virginia and this summer many activists will join hands with WV communities to halt this repulsive process.<br><br>Saturday, June 11th, 2005 1:00 PM<br>Folk at One<br>Peace Park<br>400 block of State Street<br>Madison, WI<br>http:// www.madfolk.org<br>Price: free<br>Rain Location: Memorial Union - Lakefront Room<br><br>Saturday, June 11th, 2005 6:00 PM<br>University of Wisconsin Extension<br>80th Anniversary of the School for Workers<br>Madison, WI<br>http://schoolforworkers.uwex.edu/<br>Contact John Lund: 608-262-9847 or john.lund@uwex.edu<br><br>Sunday, June 12th, 2005 7:00 PM<br>Anne Feeney in Concert<br>Laborers' Local 309<br>Rock Island, IL<br>Chris Dunn is organizing this -<br>crisplydone@hotmail.com<br><br>Friday, June 17th, 2005 7:30 PM<br>Minnesota Greens State Convention Kickoff Concert<br>Blue Heron Coffee House<br>Winona, MN<br>http://mngreens.org/<br>pollygower@hotmail.com is the contact for this show.... with special guests!<br><br>Sunday, June 19, 20 and 21, 2005 <br>Great Labor Arts Exchange<br>George Meany Institute for Labor Studies<br>Takoma Park, MD<br>http://laborheritage.org/glae04p1.html<br>This fabulous conference ends with a terrific public concert on<br><br>Tuesday, June 21st, 2005 8:00 PM<br>Great Labor Arts Exchange<br>George Meany Institute for Labor Studies<br>Takoma Park, MD<br>http://laborheritage.org/glae04p1.html<br><br><br>Thursday, June 23rd, 2005 8:00 PM<br>Midwest Labor Press Association Banquet<br>Holiday Inn Riverport<br>St Louis, MO<br>Gary Brown gbrown@ualocal157.org has more information<br><br>Friday, June 24th, 2005 6:00 PM<br>Mother Jones Festival<br>Banquet at The Crystal Ballroom<br>Mount Olive, IL<br>http://mtoliveil.com<br>Exit #41 on I 55 Go West towards Staunton, pass the Super 8 Motel &amp; over a hill. The CRYSTAL BALLROOM will be on the left side, less than a mile from the I 55 exit<br><br><br>Saturday, June 25th, 2005 8:00 PM<br>IWW Centenary Concert<br>People's Church<br>Lawrence St<br>Chicago, IL<br>with Citizens' Band, Larry Long, Mark Ross, Charlie King &amp; Karen Brandow, Utah Phillips and &quot;Rebel Voices&quot;- Janet Stecher and Susan Lewis, from Seattle, WA and other very special guests.<br>contact John Berquist at abjb123@earthlink.net or 773.752.2248<br><br><br>Sunday, June 26th, 2005 10:30 AM<br>U U Service<br>Chicago, IL<br>more details soon.<br>all welcome<br><br>More and updated information at http://www.annefeeney.com/calendar.html<br>**ALWAYS** check with the venue to make sure that the time of the performance and other details are correct.  I try really hard to keep this current, but if you think about this itinerary, you'll see my life is a little hectic and it's hard to stay on top of everything all the time..\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
