{
	"date": "Monday, September 28, 2009",
	"title": "OCTOBER 2009 - Anne Feeney's Fellow Travelers' Advisory - VOLUME FIVE, #7",
	"body": "<p><b></b></p><b><p>OCTOBER 2009 - Anne Feeney's Fellow Travelers' Advisory - VOLUME FIVE, #7</p><p></p><p> </p><p></p><p></p><p>IMMEDIATE DESTINATIONS:</p><p></p><p><span class=\"Apple-style-span\" style=\"  font-weight: normal; font-family:Verdana, 'Trebuchet MS', Geneva, Arial, Helvetica, sans-serif;font-size:12px;\"></span></p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Cleveland, OH</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Chicago, IL</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Terre Haute, IN</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Champaign, IL</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Springfield, IL</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Macomb, IL</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Dubuque, IA</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Des Moines, IA</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Winona, MN</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">St Paul, MN</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Madison, WI</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Rockford, IL</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">DeKalb, IL</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">New York, NY</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Indianapolis, IN</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Lafayette, IN</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Columbus, OH</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Cincinnati, OH</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Lexington, KY</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Louisville, KY</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Charleston, WV</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Pittsburgh, PA</p><p style=\"margin-top: 0px; margin-right: 0px; margin-bottom: 0px; margin-left: 0px; padding-top: 0px; padding-right: 0px; padding-bottom: 0px; padding-left: 0px; \">Copenhagen, Denmark</p><p></p><p></p><p>see details at the end of this newsletter and constantly updating at <a href=\"http://annefeeney.com/calendar.html\">http://annefeeney.com/calendar.html</a></p><p></p><p></p><p> </p><p></p><p><br></p><p></p><p> </p><p></p><p></p><p>Thanks so much for your interest in my music and my work.  I'm very excited about the <strong>nine state midwest tour</strong> that I begin today.  I've got 25+ shows with the wonderfully talented David Rovics (<a href=\"http://davidrovics.com/\">http://davidrovics.com</a>).  We're calling it the <strong>&quot;Union Makes Us Strong&quot;</strong> tour.  Amy Goodman calls David Rovics &quot;the musical version of Democracy Now!&quot;  I hope you'll spread the word about this tour to all your friends in Illinois, Iowa, Indiana, Wisconsin, Minnesota, Ohio, Kentucky, Pennsylvania and West Virginia.</p><p></p><p></p><p> </p><p></p><p></p><p>In this issue you can read my take on the <strong>G20 and AFL-CIO </strong>conventions in Pittsburgh. </p><p></p><p></p><p> </p><p></p><p></p><p>You can find out about the fabulous <strong>2010 tours of Ireland</strong> that I'm organizing and leading.</p><p></p><p></p><p> </p><p></p><p></p><p>You can check out Dennis Roddy's thoughtful article about my friend and mentor, <strong>Mary Travers,</strong> who died on September 16th.  <strong></strong></p><p></p><p></p><p> </p><p></p><p></p><p><strong>Did you see the</strong> <strong>Sing Out for Single Payer Road Show??</strong> I hope you'll do me a small favor (that doesn't involve your wallet!). </p><p></p><p></p><p> </p><p></p><p></p><p> </p><p></p><p></p><p>And the next time you fly, you can <strong>help the American Federation of Government Employees</strong> to build a union! I'll tell you how.. </p><p></p><p></p><p> </p><p></p><p></p><p>Of course there's some<strong> family news, upcoming birthdays </strong>...</p><p></p><p></p><p> </p><p></p><p></p><p>and if you can be in Pittsburgh on November 1st, I'd like to invite you to join me at the Churchill Valley Country Club when the <strong>Thomas Merton Center presents its annual award to Dennis Kucinich</strong>!</p><p></p><p></p><p> </p><p></p><p></p><p>You can <strong>buy my cds at <a href=\"http://cdbaby.com/all/unionmaid\">http://cdbaby.com/all/unionmaid</a></strong> - and I hope you will! You can also digitally download single songs or complete recordings.</p><p></p><p></p><p> </p><p></p><p></p><p>I hope to see you somewhere this month, or soon!</p><p></p><p></p><p> </p><p></p><p></p><p>In solidarity</p><p></p><p></p><p> </p><p></p><p></p><p>Anne</p><p></p><p></p><p> </p><p></p><p></p><p>################################################</p><p></p><p></p><p> </p><p></p><p></p><p><strong>The AFL-CIO and the G20 come to Pittsburgh</strong></p><p></p><p></p><p> </p><p></p><p></p><p>It was great to have the AFL-CIO meet in Pittsburgh.  I got a chance to show off my hometown at its best to so many of my labor activist friends from around the country.</p><p></p><p></p><p> </p><p></p><p></p><p>The convention was highly choreographed... not much excitement.  And I didn't hear a single union song played on the convention floor. But it was great to see a strong anti-war resolution passed and even greater to see a single-payer health care resolution pass unanimously right after President Obama came to the convention touting his public option.  Rich Trumka is certainly more than capable of leading working people into a much more militant stance than we've seen in my lifetime.  I'm sure ready for that kind of leadership!  I was glad to see Unite/HERE come back to the AFL-CIO.  I've admired John Wilhelm since I began working with HERE on the Frontier Casino strike many years ago.</p><p></p><p></p><p> </p><p></p><p></p><p>It was devastating not to be invited to sing a single song at the convention itself...  but apparently it was a crazy oversight.. on the last day of the convention John Sweeney and I were talking about health care when he said to me - &quot;I wish I had remembered to invite you to sing at this convention.&quot;  I quickly replied &quot;<em>not nearly as much as I wish you had remembered!!&quot;</em></p><p></p><p></p><p> </p><p></p><p></p><p>Unquestionably the most exciting moment of the convention was Michael Moore's appearance at a reception hosted by the Labor Campaign for Single Payer and the California Nurses Association. (and they <em>DID</em> invite me to perform at their reception!) After rousing speeches from Leo Gerard, Cecil Roberts, Roseann DeMoro and Michael Moore we marched down to the Byham Theater for the US premiere of Michael's wonderful new film - Capitalism: A Love Story.  Be sure to see it!</p><p></p><p></p><p> </p><p></p><p></p><p>                                  ***********************</p><p></p><p></p><p> </p><p></p><p></p><p>I got to sing myself hoarse at the G20 (the tear gas didn't help, either!).  Thanks to a small grant from the HEN Foundation, I was able to produce two concerts and perform at several G20 related events, including the People's Summit featuring the amazing Jeremy Scahill, a soggy health care rally organized by ACORN, and the big marches on the 24th and 25th.  I can't say I'm shocked any more to see a city put under martial law, but it was particularly depressing and distressing to see my hometown so dishonored.  Over 4000 cops from around the country occupied my hometown and they brought a lot of expensive and dangerous coptoys ($20 million worth!) with them.  I knew they'd find some excuse to use them all, and they did.  Curious students and aimless bystanders alike in the university district were caught up in the hail of rubber bullets, pepper spray, OC spray, tear gas and batons wielded by marauding macho police.</p><p></p><p></p><p> </p><p></p><p></p><p>The city of Pittsburgh refused permits to assemble at every opportunity. On September 24th 1000 folks gathered in Arsenal Park and asserted their First Amendment permit and began marching out of the park toward town.<img alt=\"Cops\" height=\"453\" id=\"anne\" src=\"https://lh5.googleusercontent.com/proxy/63KQ-L1mUy_SI5Bjsg-k2QS8Zt39m8Yeot13ClyBRb13zAPtcJOnAkrYqIhdjNfTylE8ujLBynY36Zi5pb6zv0GoGwd7KRBSmk2DZPQQqdfvj0KXaLdD21zDQViM17BuDtknTC_pzb4j8P0VBD8rhtWmKOGEcC12vfH8xXc=s0-d\" title=\"Surrounded\" width=\"604\"></p><p></p><p></p><p> </p><p></p><p></p><p>The park was completely surrounded by cops from all over the country in full riot gear.  They outnumbered the protestors.  The cops gave up on what they were calling &quot;kettling&quot; us and let us leave the park.  Moments later they began playing a tape recorded message ordering us to disperse.  A helicopter overhead directed the cops to small groups of kids who were then peppersprayed and teargassed.  It was repulsive.</p><p></p><p></p><p> </p><p></p><p></p><p>The cops had been given the green light to behave this way by our complicit local leaders (Senator Jim Ferlo and City Council President Doug Shields were great, though) and courts who okayed their harassment in the days prior to this march.  The police lawlessness just intensified over the next 48 hours.  No group of kids was safe from their brutality.</p><p></p><p></p><p> </p><p></p><p></p><p>In 1919 when my grandfather was organizing the &quot;Great Steel Strike,&quot; historian William Z Foster observed - &quot;The Constitution of the United States provides that not even Congress may abridge the rights of free speech and free assembly... however, in Pennsylvania the Constitution is considered as some sort of humorous essay.&quot;  Some things don't change much!</p><p></p><p></p><p> </p><p></p><p></p><p>There were a lot of creative responses to the Pittsburgh Police State.  Here's a link to a brilliant video that features among other things, my favorites - the Hula Hoopers for Hope..</p><p></p><p></p><p> </p><p></p><p></p><p><a href=\"//www.youtube.com/watch?v=r4bleBGOGy4&amp;feature=player_embedded\">http://www.youtube.com/watch?v=r4bleBGOGy4&amp;feature=player_embedded</a></p><p></p><p></p><p> </p><p></p><p></p><p>All told we spent in excess of $20,000,000 on security. The approximately 10,000 people who showed up to protest the G20 did a combined $20 - 50,000 of damage (according to the Police).  We coulda bought a LOT of windows with the remaining $19,950,000 ...  Meanwhile, the G20 will implement policies that will cause massive environmental degradation, starvation, shortages, riots, unemployment, fiscal instability and the elimination of essential social services around the world... and no cop will be on hand to stop that pillaging.</p><p></p><p></p><p> </p><p></p><p></p><p>I sure hope that another world is possible.</p><p></p><p></p><p> </p><p></p><p></p><p> </p><p></p><p></p><p>%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%</p><p></p><p></p><p> </p><p></p><p></p><p><strong>IRELAND 2010!!</strong></p><p></p><p></p><p> </p><p></p><p></p><p>The 2009 trip to Galway, Dublin and Clare was absolutely fantastic in every way.  We had the most wonderful and exciting group of fellow travelers... I've posted a few of my photos at <a href=\"http://www.flickr.com/photos/annefeeney/sets/72157622344873043/\">http://www.flickr.com/photos/annefeeney/sets/72157622344873043/</a></p><p></p><p></p><p> </p><p></p><p></p><p>My Irish partner Tom Pigott and I have set the dates for the 2010 tours of Ireland.  And what fabulous tours we have planned!  You're invited and I want to know as soon as possible if you are interested.  If I can't sell both of these tours by the end of November, I may have to cancel one or the other...</p><p></p><p></p><p> </p><p></p><p></p><p><span style=\"text-decoration: underline;\"><em>August 10-19th - The Best of the West - Kerry, Clare and Galway</em></span></p><p></p><p></p><p> </p><p></p><p></p><p>Fly into Shannon airport and we'll show you nine unforgettable days in the musical heart of Ireland - the West.   Check out <a href=\"http://www.enchantedwaytours.ie/tours/kerry-clare-galway/\">http://www.enchantedwaytours.ie/tours/kerry-clare-galway/</a></p><p></p><p></p><p>for a detailed description of our upcoming adventures on the Dingle peninsula, Doolin, the fantastic Cliffs of Moher, the gorgeous Slea Head drive, the exotic Burren, the Aran Islands ... and wonderful live music every night.  And of course we'll meet some local activists.</p><p></p><p></p><p> </p><p></p><p></p><p><span style=\"text-decoration: underline;\"><em>August 22nd-31st - Urban Ireland - Dublin, Derry and Belfast</em></span></p><p></p><p></p><p> </p><p></p><p></p><p>You'll fly into Dublin for this trip.</p><p></p><p></p><p> </p><p></p><p></p><p>We'll focus a lot on history ... starting with the ancient - Glendalough, Clontarf, the Battle of the Boyne -  then on to the Easter Uprising - Kilmainham, Arbor Hill, the General Post Office ... a dramatic look at the war for Irish independence - and a full day on your own to explore the wonders of historic Dublin.   Days filled with history, nights filled with music, and perhaps a visit to the Abbey Theater. Then on to the great walled city of Derry, the Bloody Sunday Museum, a walking tour of the Derry Murals, and an unforgettable night of music at Sandino's pub in Derry.  A day trip into Belfast with a tour of the murals and meetings with local activists.  Possibly a trip to the Giants' Causeway and the rope bridge of Carrick-a-Reed...<img alt=\"The Rope Bridge\" height=\"313\" id=\"anne\" src=\"https://lh4.googleusercontent.com/proxy/Ag2-eTKNBshLoRg1e-Rvi2nNFAixeCARn8N0JhjM3ZNhpjpfyq3SXy9J_Dh7ywUqSx4I9IQ0m50OHUTX5QzALjfq08sbaKE=s0-d\" width=\"328\"></p><p></p><p></p><p> </p><p></p><p></p><p>In my opinion, the best part of the tours is the wonderful folks who come on them.  You'll have perfect travelling companions, and a most congenial Irish host in my friend Tom Pigott - a fine singer, great storyteller and extremely thoughtful tour leader.</p><p></p><p></p><p> </p><p></p><p></p><p>On either tour you'll see Ireland at Ireland's pace.  The tours are very different.  Each tour is $2050 + your transportation.  We provide nine nights accommodations, all ground transportation, all breakfasts, three sumptuous dinners, and admission to many many special events.  We travel in a luxurious coach just the right size for our group - small enough to navigate the wee byways of Ireland - expertly driven by our charming driver (and great dancer!) Paddy Downes.</p><p></p><p></p><p> </p><p></p><p></p><p>Single supplement is $350.</p><p></p><p></p><p> </p><p></p><p></p><p>If you decide to do both tours with us, the cost is $3700 (a $400 discount!).</p><p></p><p></p><p> </p><p></p><p></p><p>If you'd like more information, or have any questions, email me directly at anne@annefeeney.com</p><p></p><p></p><p> </p><p></p><p></p><p>&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;</p><p></p><p></p><p> </p><p></p><p></p><p><strong>MARY TRAVERS, Rest in Peace</strong></p><p></p><p></p><p> </p><p></p><p></p><p>My sister Kathleen was in the audience at the State Theater in New Jersey on May 20th for what turned out to be Peter Paul and Mary's final concert.  She said Mary was in great voice and great spirits, despite obvious signs of declining health.  I was terribly saddened to hear of her death on September 16th at the age of 72.  She will be missed.</p><p></p><p></p><p> </p><p></p><p></p><p>I loved Dennis Roddy's story about this remarkable woman - (apparently I wasn't alone there... this front page Pittsburgh Post Gazette obit ran in dozens of papers around the country) -</p><p></p><p></p><p> </p><p></p><p></p><p><a href=\"http://www.post-gazette.com/pg/09261/998954-122.stm\">http://www.post-gazette.com/pg/09261/998954-122.stm</a></p><p></p><p></p><p> </p><p></p><p></p><p> </p><p></p><p></p><p>***********************************************************</p><p></p><p></p><p> </p><p></p><p></p><p><strong>HELP the AFGE to ORGANIZE TRANSPORTATION SAFETY OFFICERS!!</strong></p><p></p><p></p><p> </p><p></p><p></p><p>At the AFL-CIO convention I learned about the campaign to unionize the Transportation Safety Officers at our airports.  When their jobs were created during the previous administration, the Act of Congress that created their jobs specifically prohibited them from having a union. </p><p></p><p></p><p> </p><p></p><p></p><p>That policy has been overturned, and a vigorous organizing drive is in progress.  So the next time you fly, put a nice note to your TSO inspector in your check on baggage... something like:</p><p></p><p></p><p> </p><p></p><p></p><p style=\"text-align: center;\"><span style=\"font-size:large;\"><span style=\"color:#ff0000;\">UNION YES!</span></span></p><p></p><p></p><p>I support your right to organize and believe that union representation will bring dignity, respect and security to you in your work.</p><p></p><p></p><p> </p><p></p><p></p><p>As the only union to represent and stand behind Transportation Security Officers since the beginning, AFGE is at the forefront of the struggle to secure rights and improve working conditions at TSA.</p><p></p><p></p><p> </p><p></p><p></p><p style=\"text-align: center;\"><span style=\"color:#ff0000;\">For more information contact AFGE today</span></p><p></p><p></p><p style=\"text-align: center;\"><span style=\"color:#ff0000;\"><span id=\"__skype_highlight_id\" class=\"skype_tb_injection\" onmousedown=\"SkypeSetCallButtonPressed(this, 1,0,0)\" onmouseup=\"SkypeSetCallButtonPressed(this, 0,0,0)\" onmouseover=\"SkypeSetCallButton(this, 1,0,0);skype_active=SkypeCheckCallButton(this);\" onmouseout=\"SkypeSetCallButton(this, 0,0,0);HideSkypeMenu();\"></span>1-866-392-6832<br>tsahotline@afge.org</span></p><p></p><p></p><p> </p><p></p><p></p><p>If it's not in your suitcase when you get to your destination, you know your Transportation Safety Officer has gotten the union message.</p><p></p><p></p><p> </p><p></p><p></p><p>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^</p><p></p><p></p><p>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^</p><p></p><p></p><p><strong>DID YOU SEE THE SING OUT FOR SINGLE PAYER ROAD SHOW??</strong></p><p></p><p></p><p><strong>DID YOU SING IN THE SING OUT FOR SINGLE PAYER ROAD SHOW??</strong></p><p></p><p></p><p> </p><p></p><p></p><p>Please take a second to write a brief comment about your experience at <a href=\"http://annefeeney.com/guestbook.html\">http://annefeeney.com/guestbook.html</a> or, if you're reading this on my blog, post it right here!  The many people who ponied up some dough to fund this show would love to hear from you... was it inspiring? informative? what happened in your community as a result?  you get the idea.  Say something!</p><p></p><p></p><p> </p><p></p><p></p><p>@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</p><p></p><p></p><p> </p><p></p><p></p><p><strong>DENNIS KUCINICH GETS THE THOMAS MERTON AWARD!</strong></p><p></p><p></p><p> </p><p></p><p></p><p>November 1st Dennis Kucinich will receive the Thomas Merton Award.  I'm overjoyed.  I've reserved a table for ten. Tickets are $45 - The dinner will be at the Churchill Valley Country Club, 800 Beulah Rd.  If you'd like to sit at my table, let me know (412-877-6480 or email to anne@annefeeney.com) and I'll save you a ticket!</p><p></p><p></p><p> </p><p></p><p></p><p>%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%</p><p></p><p></p><p> </p><p></p><p></p><p><strong>BIRTHDAYS</strong></p><p></p><p></p><p> </p><p></p><p></p><p>October 5th - Casey Horne, October 6th -  Daniel Berlin (30!), Maureen Metcalfe and Jennifer Erin McCahill, October 9th - my sister by another mother - Jan Boyd (60!), October 16th - Jill Merrill and Bill Feeney, October 20th - Steve Merrill, Oct 21st - Della Belmont McCahill (1 year old!), October 22nd - Mason Avery Gailiunas, October 28th -    <br>Carolyn Weldon and October 29th, my friend Annie Dinerman!</p><p></p><p></p><p> </p><p></p><p></p><p><strong>FAMILY NEWS</strong></p><p></p><p></p><p> </p><p></p><p></p><p>I'm celebrating 40 years of agitating on October 15th.. the picture below was taken at my first public performance.  It was the 1969 Pittsburgh Moratorium Against the (Vietnam) War on the lawn by the Cathedral of Learning in Pittsburgh.</p><p></p><p></p><p> </p><p></p><p></p><p> </p><p></p><p></p><p><img alt=\"40yearsago\" height=\"604\" id=\"anne\" src=\"https://lh5.googleusercontent.com/proxy/ox0sgfahOs6NRLaBIzYNf17UzkaCqnXCRrDlSQHo3L6-hD7IuLJfKiDlw5X8807PG8En2RSjDFxZJDza0wdBwDn3HSDbILjn6DcH87Pwx4CqvSj83NZERQ52bs1i9Rmb91r5YXAhJe6vXrJO4cX2YxmIxXfcn3hkU5Siqg=s0-d\" title=\"1969 Moratorium Against the War\" width=\"458\"></p><p></p><p></p><p> </p><p></p><p></p><p> </p><p></p><p></p><p>My son Dan still doesn't know if he passed the bar exam, but he did get promoted to legal director of Asylum Access in Quito.  His wife Monique Murad just returned to Ecuador after two weeks training in Washington, DC. </p><p></p><p></p><p> </p><p></p><p></p><p>My daughter Amy is back in San Marcos after working on an extended tour with a fabulous young bang -  The Blue Hit. (<a href=\"http://thebluehit.com/\">http://thebluehit.com</a>)</p><p></p><p></p><p> </p><p></p><p></p><p>My sister Kathleen and my niece Kimberly and my grand-nephew Casey will come to Sweden for Christmas with me and Julie.</p><p></p><p></p><p> </p><p></p><p></p><p>*************************************************************</p><p></p><p></p><p> </p><p></p><p></p><p style=\"text-align: center;\"><span style=\"font-size:large;\">THE TOUR!!</span></p><p></p><p></p><p style=\"text-align: center;\"> </p><p></p><p></p><p>Monday, September 28th, 2009 7:00 PM<br>Mad as Hell Doctors Road Show<br>Mad as Hell in Cleveland!<br>Laborers' Local 310 Hall<br>3250 Euclid Ave., Clevelan OH<br><a href=\"http://www.madashelldoctors.com/\">http://www.madashelldoctors.com</a>/<br>Entrance &amp; FREE parking accessible from Prospect Avenue<br>Contact: Elizabeth Parsons<br>Email: elizabeth@clevelandjwj.org<br><br><br>Wednesday, September 30th, 2009<br>IBEW conference<br>Adams Mark Holiday Inn<br>Chicago, IL<br>Price: members only<br>darlene johnson is the contact... 630-434-1683<br><br><br>Friday, October 2nd, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>Decima Musa<br>1901 S Loomis<br>Chicago (Pilsen), IL<br>773-935-5255<br><a href=\"http://www.decimamusa.com/\">http://www.decimamusa.com/</a><br>Price: $20<br>sponsored by numerous local activist groups, including CORE.<br><br><br>Saturday, October 3rd, 2009 6:00 PM<br>Eugene Debs Annual Award Dinner<br>Indiana State University<br>Hulman Center<br>Terre Haute, IN<br><a href=\"http://eugenevdebs.com/media/Deb_fall_09.pdf\">http://eugenevdebs.com/media/Deb_fall_09.pdf</a><br>Price: $35</p><p></p><p></p><p> </p><p></p><p></p><p>Sunday, October 4th, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert<br>Gregory Hall Room 213<br>U/I Campus<br>Champaign, IL<br>jrbarret@uiuc.edu is the contact. Presented by ISO and Jobs with Justice.</p><p></p><p></p><p> </p><p></p><p></p><p>Monday, October 5th, 2009 6:00 PM<br>Anne Feeney and David Rovics in Concert<br>Brookens Auditorium<br>University of Illinois<br>Springfield, IL<br>217.206.8328<br>For more information: E-mail Richard Gilman-Opalsky - rgilm3@uis.edu</p><p></p><p></p><p> </p><p></p><p></p><p> </p><p></p><p></p><p>Tuesday, October 6th, 2009 7:30 PM<br>Anne Feeney and David Rovics on Campus and in Concert<br>Western Illinois University<br>COFAC Auditorium<br>Macomb, IL<br>In addition to this show, David and I will be doing multiple classroom appearances. Contact Lisa Barr at lj-barr(@)wiu.edu if you'd like more information about the classromm work. Stay tuned for a possible after-concert party on the 6th to benefit the local low-power FM station.<br><br></p><p><br></p><p>Wednesday, October 7th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>Open Date!!!<br>Quad Cities area, Iowa City???<br>If you have any suggestions for this date or know of something going on that we could join, let us know...</p><p></p><p></p><p> </p><p></p><p></p><p>Thursday, October 8th, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert<br>St Mark's<br>1201 Locust<br>Dubuque, IA<br>(563) 584-9300<br>Price: $10-15 suggested<br>for more information contact Art Roche rocheart3@msn.com or phone Mary Moody at the number above. As with all of our shows, no one is turned away for inability to pay.</p><p></p><p></p><p> </p><p></p><p></p><p>Friday, October 9th, 2009 7:30 PM<br>Anne Feeney and David Rovics in Concert<br>Des Moines Social Club<br>1408 Locust St<br>Des Moines, IA<br>(515) 240-5788<br>Price: donations<br>The contact is Robin Arnold at arnoldre@mchsi.com</p><p></p><p></p><p> </p><p></p><p></p><p>Saturday, October 10th, 2009 7:30 PM<br>Anne Feeney and David Rovics<br>The Art Center<br>228 East Fifth Street<br>Winona, MN 55987<br>507-453-9959<br>Price: $15 suggested<br>Polly Gower is the contact pollygower(@)hotmail.com</p><p></p><p></p><p> </p><p></p><p></p><p>Sunday, October 11th, 2009 5:00 PM<br>Anne Feeney and David Rovics with special guests in Concert<br>Minnesota Music Cafe<br>499 Payne Ave<br>St Paul, MN<br>Colleen Rowley<br>rowleyclan(@)earthlink.net and Larry<br>Olds 612-722-3442, lolds(@)popednews.org are the contacts...</p><p></p><p></p><p><br>Monday, October 12th, 2009 12:00 PM<br>&#x201C;The crisis in health care: What's at stake for working women?&#x201D; with Anne Feeney and health care advocate Connie Perpich<br>Operating Engineers Local 49 hall<br>2829 Anthony Lane S.<br>Minneapolis, MN<br>612-624-5020<br><a href=\"http://www.carlsonschool.umn.edu/Page5946.aspx\">http://www.carlsonschool.umn.edu/Page5946.aspx</a><br>Price: $35<br><em>&quot;The crisis in health care: What&#xB4;s at stake for working women?&quot; will be the topic of a union women&#xB4;s luncheon Monday, Oct. 12, sponsored by the University of Minnesota Labor Education Service.<br><br>In her role as senior director of legislative affairs at Planned Parenthood Minnesota, North Dakota, South Dakota, Connie Perpich has spent years advocating on women&#xB4;s health issues at the Capitol and across the state. She will provide an overview of the disparities experienced by women under the current system and the need for reform.<br><br>To register, download a registration form at the LES website or call 612-624-5020. Deadline to register is Oct. 2.</em></p><p></p><p></p><p> </p><p></p><p></p><p>Tuesday, October 13th, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert<br>Goodman Center<br>149 Waubesa<br>Madison , WI<br>Price: $15 advance<br>matt and john peck are working on this show. Advance tickets available at Madison Infoshop, Lakeside Press and the Rainbow Bookstore. Presented by the Madison IWW.</p><p></p><p></p><p> </p><p></p><p></p><p>Wednesday, October 14th, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert with special guest David Stocker<br>Just Goods Listening Room<br>201 Seventh Street<br>Rockford, IL 61104<br>815-964-7111<br>Price: $10 adv/$15 door<br>Advance tickets available at the venue.<br>David Stocker is the contact - originsofmusic@gmail.com</p><p></p><p></p><p> </p><p></p><p></p><p>Thursday, October 15th, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert<br>Room 173 - NIU Music Building<br>just off Lucinda Avenue<br>DeKalb , IL<br>td0raf1(@)wpo.cso.niu.edu Rose Feurer is the contact</p><p></p><p></p><p> </p><p></p><p></p><p>Friday, October 16th, 2009 8:00 PM<br>Celebration of the Extraordinary Life of Julius Margolin: with George Mann, Chris Chandler, Elise Bryant, Chris Bricker, Francisco Herrera, Anne Feeney and the New York City Labor Chorus<br>Local 1199's Martin Luther King, Jr. Auditorium<br>310 W. 43rd Street<br>New York, NY<br>One block from Port Authority/42nd Street subway station. Proceeds benefit the Julius Margolin Scholarship Fund for Youth in Labor.</p><p></p><p></p><p> </p><p></p><p></p><p>Saturday, October 17th, 2009 7:30 PM<br>Anne Feeney and David Rovics in Concert with special guest Jim Pennell<br>Wheeler Art Center<br>1035 Sanders St<br>Indianapolis, IN<br>Price: $10-20 suggested<br>gpennell@uindy.edu Greta Pennell is the contact...</p><p></p><p></p><p> </p><p></p><p></p><p>Sunday, October 18th, 2009 10:30 AM<br>Anne Feeney and David Rovics at Unitarian Service<br>All Souls UU Church<br>5805 E 56th<br>Indianapolis, IN 46226</p><p></p><p></p><p> </p><p></p><p></p><p>Sunday, October 18th, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert<br>Unitarian Universalist Church<br>333 Meridian Street<br>Lafayette, IN<br>Price: FREE!<br><em>Harry Targ targ@purdue.edu is the contact<br>The concert is free and open to all.<br>Sponsors of the concert include the Northwest Central Labor Council AFL-CIO;United Auto Workers CAP Council; the Social Justice Committee of the Unitarian Universalist Church; the Women&#xB4;s Studies Program, Purdue University; and members of Yes We Can Tippecanoe (YWCT) and the Lafayette Area Peace Coalition (LAPC).<br></em><br>Tuesday, October 20th, 2009 7:00 PM<br>David Rovics and Anne Feeney in Concert<br>Columbus, OH<br>bruce bostick - bbostick@columbus.rr.com and victoria parks queenvictrola@gmail.com are looking into this date for us!</p><p></p><p></p><p><br>Wednesday, October 21st, 2009 6:30 PM<br>Anne Feeney and David Rovics in Concert<br>The Barn<br>1225 North Bend Road<br>Cincinnati, OH 45224<br>513-542-0007<br>Price: Your generous donations<br><em>Potluck supper followed by 7:30PM concert. No heat in the barn folks. Dress for the weather &amp; bring a blanket for your lap for later --- it's a great venue - thanks to Diana and Len for putting this together!!!</em></p><p></p><p></p><p><br>Thursday, October 22nd, 2009 5:00 PM<br>KFTC presents Anne Feeney and David Rovics in Concert<br>Happy Hour at Natasha's Cafe<br>112 Esplanade<br>Lexington, KY<br>(859)259-2754<br><a href=\"http://www.natashascafe.com/\">http://www.natashascafe.com/</a><br>Janet Tucker of Kentuckians for the Commonwealth is the contact...</p><p></p><p></p><p><br>Friday, October 23rd, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert with special guests Paul Whitely and Kate Sanders!<br>St John's Day Center<br>700 E Muhammad Ali Blvd<br>Louisville, KY 40202<br>dos4@insightbb.com - for more information</p><p></p><p></p><p><br>Saturday, October 24th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>Unitarian Universalist Congregation<br>520 Kanawha Blvd W<br>Charleston, WV<br>304-345-5042<br><a href=\"http://www.uucharlestonwv.org/\">http://www.uucharlestonwv.org</a><br>Price: $15 suggested-none turned away<br>plantandgnome(@)verizon.net - Chris Higgins is the contact</p><p></p><p></p><p> </p><p></p><p></p><p>Sunday, October 25th, 2009 10:00 AM<br>Anne Feeney and David Rovics Lead UU Service<br>Unitarian Universalist Congregation<br>520 Kanawha Blvd W<br>Charleston, WV<br>304-345-5042<br>Price: all welcome<br>plant and gnome@ verizon.net is the contact... Rose Edington and Mel Hoover are the ministers, and our hosts...</p><p></p><p></p><p> </p><p></p><p></p><p>Sunday, October 25th, 2009 7:30 PM<br>Anne Feeney and David Rovics in Concert<br>Bulgarian/Macedonian Center<br>449-451 W 8th Avenue<br>West Homestead, PA 15120<br>412-461-6188<br><a href=\"http://www.evite.com/app/publicUrl/ARPVKBAQZXOBBWNROIVE/concert\">http://www.evite.com/app/publicUrl/ARPVKBAQZXOBBWNROIVE/concert</a><br>Price: $10-20 suggested<br>Please check out this wonderful venue! A great place to hear music!<br><br>Thursday, November 19th, 2009<br>Close the SOA<br>School of the Americas Watch Vigil at Fort Benning<br>Columbus, GA<br><a href=\"http://soaw.org/\">http://soaw.org</a><br>This event runs through November 22nd. SOA grads right now are killing Hondurans who support democratically elected President Zelaya, ousted recently in a military coup.</p><p></p><p></p><p> </p><p></p><p></p><p>Then on to Sweden and Denmark!!</p><p></p></b><p></p>\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
