{
	"date": "Monday, December 19, 2005",
	"title": "Fellow Travelers' Advisory from Anne Feeney - JANUARY 2006: VOLUME ONE, #10",
	"body": "IMMEDIATE DESTINATIONS AT MY <a href=\"http://annefeeney.com/calendar.html\">WEBSITE</a><br><br>Please forward it widely.  Better yet... <a href=\"http://annefeeney.com/newsletter.html\">Subscribe directly</a><br><br>As always, CDs are available at <a href=\"http://cdbaby.com/all/unionmaid\">CDBaby</a><br><br>Smedjebacken, Sweden<br>19 December 2005<br><br>Hi there Fellow Travelers,<br><br>Tomorrow at 5AM I'm leaving Sweden to go meet my kids in Oaxaca, Mexico to spend the<br>holidays, so I'm sending my January newsletter a little early.<br><br>During my 3-hour layover at O'Hare I may end up being a witness in a grievance procedure filed by 3 United Airlines workers who were actually 'separated from service without pay' (I think that means &quot;fired&quot;) for watching me sing nasty songs about their greedy CEO while I was waiting for a plane at O'Hare last May.  The workers are charged with refusing a direct order from a supervisor... and the Supervisor's  order was -- get this (drum roll, please, maestro) -- &quot;Make her stop singing.&quot; Please.  Who is going to *make* me quit singing?  But they were fired by  these humorless incompetent bastards.  As my wonderful friend John Handcox used to sing - &quot;There is mean things happening in this land.&quot;<br><br>As 2005 draws to a close my heart is so filled with gratitude to all of you ... I couldn't do my work without all of you and I appreciate your support and loyalty and generosity more than I can say... but I also want to thank you for the many wonderful things you do for family and friends, for your community, for your union,  for the world.  I hope that 2006 brings us together frequently and that the year is filled with victories, great and small.<br><br>*************************************<br><br>I'm going to try to do &quot;The Year in a Minute,&quot; so if I miss your favorite moment, I apologize.  My last gig of 2005 was in Stockholm at a place that used to be a stable. It gave me a chance to sing the line &quot;For far too long we've allowed these corporate hogs to belly up to the public trough....&quot; with a feeding trough in the same room!<br><br>2005 was filled with special events  - In March I performed at the gorgeous US Botanical Gardens (inside the Capitol... there's a scene from 'The Manchurian Candidate' filmed in these gardens) for the ANA/UAN (Nurses' Union) 5th Anniversary Celebration ...  and I was thrilled be invited to perform at  the 2nd Annual Sisters in the Brotherhood Conference in Las Vegas, NV - which had the most outrageous food I've ever seen ...  But certainly the highlight of 2005 was performing at the many  exciting events commemorating the 100th anniversary of the <a href=\"http://iww.org\"> IWW</a> ... the most amazing ones being in Ann Arbor, MI; Chicago, IL; at the Oregon Country Fair; Madison, WI; Milwaukee, WI; and Philadelphia, PA<br><br>As far as annual events are concerned, I got to perform again at the Mayday Celebration at Botto House near Paterson, NJ; the Mother Jones Dinner (October) in Mt. Olive, IL; the Eugene Debs Annual Dinner in Terre Haute, IN; the Bernie Firestone Tribute at the Scarab Club in Detroit;Labor Fest in San Francisco and the fabulous Oregon Country Fair!!!  I hope to see you at one of these events next year. Let me know if you'd like more information about any of them.<br><br>*************************************<br><br>Most fun: Touring with my daughter, Amy in July (followed closely by touring with <a href=\"http://davidrovics.com\">David Rovics</a> &amp; <a href=\"http://janhammarlund.com\">Jan Hammarlund</a> -- and touring with <a href=\"http://evangreer.com\">Evan Greer</a>)<br><br>Two Most Bittersweet Events of 2005:  The Chandler-Feeney era comes to a close -- (but I'm having a ball and Chris has a great new show... check out his <a href=\"http://chrischandler.org\">website</a>)AND  .... no Kerrville!!!... This would have been my 17th consecutive Kerrville Folk Festival, but instead this year I did a fabulous tour of Sweden and Denmark with David Rovics &amp; Jan Hammarlund.<br><br>Three Favorite things about 2006:  The <a href=\"http:ciw-online.org\">Immokalee Workers'</a> Victory - Ahhhhhnold Governator getting his ass whupped - Lewis Libby's indictment...<br><br>Four Best suprises of the year: getting the Joe Hill Award, the huge crowds at Magdalena's and at Fogartyville... and my kids surprising me by having fresh flowers delivered to me onstage at the UW Madison Memorial Union Terrace on Mother's Day during the IWW Concert.<br><br>Five UU congregations hosted me in: Reading, PA;  Indianapolis, IN; Pittsburgh, PA;<br>Chicago, IL; Jacksonville, FL<br><br>SIX great new venues: Magdalena's Tea House in Lansing, MI; Cafe Mundo in Newport, OR; Carnegie Centre in Vancouver, BC; LO Skolan in Helsingor, Denmark; Stallet in Stockholm, Sweden; Don Quixote's International Music Hall in Felton, CA<br><br>Seven amazing links ...<br><br> 1) <a href=\"http://www.worksmart.org.uk/downloads/comfortbreakdown.php\">Hilarious!</a><br><br> 2) <a href=\"http://www.witnesstorture.org/\">Important</a><br><br> 3) <a href=\"http://atuuschaaw.blogspot.com/2005/12/you-may-be-anarchistif.html\">thought-provoking</a><br><br> 4)  <a href=\"http://nobelprize.org/literature/laureates/2005/pinter-lecture.html\"> Harold Pinter's extraordinary Nobel Lecture</a><br><br> 5)  <a href=\"http://www.earthday.org/Footprint/index.asp\">... how big are your feet?</a><br><br> 6)  <a href=\"http://www.laneta.apc.org/noimpunidad\">... sign this petition!</a><br><br> 7)  <a href=\"http://www.projectparca.org/\">this is the NGO</a> that my son Daniel has helped to set up to provide emergency relief to the Guatemalan people in grave danger due to the recent mudslides caused by Hurricane Stan.  PS... Daniel just got accepted to Georgetown University Law School.  Hoya Saxa indeed!<br><br>Eight Outstanding Presenters of 2005 (well, actually 15):  Gerd Berlev; Jan Hammarlund; Julie Herrada; Ann Miller; Jenny Brown and Joe Courter; David and Arlene at Fogartyville; Bob Pollack and Joy Bell; Ken and Cheryl Kern; Maureen Wood; Jim and LLouise Altes; Amy Newell; Jim and Sue Burton; Polly Gower; Helena Worthen; Daniel Suhonen<br><br>Nine - (well, actually 40) Great Folks I played with in 2005: Chris Chandler, Larry Long, Utah Phillips, Faith Petric, Charlie King, Len Wallace, Mark Ross, Rebel Voices, Citizens' Band, RiotFolk, Harry Stamper, Evan Greer, Pat Humphries &amp; Sandy O, Gina Forsythe, David Rovics, Jan Hammarlund, Patrick Dodd, Savage Rose, Per Warming, Eve Goodman, Jon Berquist, Brian QTN; Jon Fromer; David LaMotte; Chris Dunn; the Dreamsicles; George Hewison &amp; Fellow Worker; Touch of Class; La Libertad; Dave Lippman, Ken Gaines, Paul Kamm &amp; Eleanore MacDonald, Amy Carol Webb, Joe Glazer, Nick Annis, John Hayes, David Roe, Joey Only and Jack Erdie (hope I didn't miss anyone!)<br><br>Ten things I want in 2006:<br><br>an end to the war<br>bush in jail<br>cheney in jail<br>national health care (See HR 676)<br>close the School of the Americas (See HR 1217)<br>time to record a new CD<br>money to record a new CD<br><br>ok... i guess i only want seven things<br><br>11 Great Radio Stations visited: KKFI, KUNI, WRCT, WDBX, KPIG, WLRN, KMUD, WFMT, KBOO, WORT,  Free Radio Santa Cruz --- If you don't see your favorite radio station here, let me know where it is, and I'll send them some music and drop by the next time I'm passing through.<br><br>12 Great House concerts:  Lisa's in Leeds, MA; Sara &amp; Nan's in Hollywood, FL; Jim &amp; Llouise's in Pittsburgh,  Anne, Paul &amp; Melissa's place in Olympia, WA; Ken &amp; Sharon's in Victoria, BC; Joe Szwaja's  in Seattle; Gretchen and Cris' in Watsonville; La Fortunes' in Santa Cruz; Fendels' in Oakland, CA; Tom Cronin and Sandy Dunn's in Philadelphia, Ken Connors and Cee Cee Severin's in Jacksonville, FL<br><br>and a partridge in a pear tree.... all in all, I played more than 200 engagments in<br>20 states, three Canadian provinces, Sweden and Denmark ... and collected an infinite supply of beautiful memories of great times with great friends.<br><br>HAPPY NEW YEAR, and a joyous, merry, relaxing holiday season to all of you!<br><br>Love &amp; solidarity<br>Anne Feeney\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
