{
	"date": "Monday, October 03, 2005",
	"title": "Fellow Travelers' Advisory from Anne Feeney - OCT. 2005: VOLUME ONE, #7",
	"body": "Thanks for being on my mailing list! It's the best way I've found to stay in <br>regular contact with my friends and family and activist heroes. Let me know <br>what you're up to... I love it when you write back! Please feel free to forward this to your friends and relations! You can subscribe by clicking <a href=\"http://www.annefeeney.com/newsletter.html\">here</a>.<br><br>IMMEDIATE DESTINATIONS:<br><br>The Great Midwest - Indianapolis; Richmond, IN; Kansas City; Grinnell, IA; <br>Cedar Falls, IA; Winona, MN; Minneapolis, MN; Beloit, WI; Chicago, IL; <br>Springfield, IL; Meredosia, IL<br><br>and then... Detroit, Ann Arbor &amp; Lansing MI<br><br>and then ... Lexington, Louisville, Terre Haute &amp; Cincinnati<br><br>and THEN ... Florida, Georgia, Sweden &amp; Mexico<br><br>all the details at <a href=\"http://annefeeney.com/calendar.html\">my tourdates page</a> <br><br>Please check out my CDs at <a href=\"http://cdbaby.com/all/unionmaid\">CDBaby</a><br>Proceeds from the sale of Heartland, Vote in November and the Great Peace March are all benefiting the Red Cross this month.<br><br>Fellow Travelers' Advisory from Anne Feeney - OCT. 2005: VOLUME ONE, #7<br><br>Greetings from the &quot;Show Me&quot; state... that's a moniker that has always <br>puzzled me -- (and, while I'm on the subject, what's a 'Sooner?' -- and a <br>'Hoya&quot;?) -- So tonight my tourmate Evan Greer asked our fabulous Cape <br>Girardeau, Missouri hosts what the heck &quot;Show-Me&quot; means... As some of you <br>have probably guessed, it means Missourians are skeptics and don't accept <br>anything as true until it is proven to them.<br><br>Well, I don't know how much more proof we can possibly endure before we <br>concede that this President doesn't have a clue how to run this country. Now <br>we know that FEMA was being run by his incompetent fratboy buddies... who's <br>running the rest of the country, and at what risk to all of us???? (I saw a <br>handpainted sign in someone's yard that said, &quot;Homeland Security My Ass.&quot;)<br><br>As the inept series of spokespersons for the White House were offering up <br>ridiculous excuse #771 - &quot;Uh, we think it was a state problem... or a local <br>problem... we didn't think it was a federal problem... uh, we couldn't act <br>until the state asked us, or the local authorities asked us ... or <br>whatever...&quot; I did laugh out loud at Jon Stewart's observation on the Daily <br>Show -- &quot;Yes, far be it from our federal government to interfere with state <br>and local affairs... why, the federal government would NEVER usurp the powers <br>reserved to the state and local government... *unless* ... *unless* New <br>Orleans were to drift into a persistent vegetative state.&quot;<br><br>But laughs are hard to come by these days. My anger and my sadness battle <br>each other daily as the agonizing details of this hopelessly bungled fiasco <br>unfold.<br><br>Today I saw a mural in Cape Girardeau, MO - another river town named by the <br>early French explorers - and while many aspects of this town's history are <br>depicted, slavery is not even mentioned!!!<br><br>And it's not just because this is Rush Limbaugh's hometown ... our entire <br>American identity is based on crazy mythology. We are *not* and never were <br>an all-white nation. We do *not* and never did all speak English. And most <br>of us are really *not* doing well in this free market economy.<br><br>American history is bloody and murderous ... our nation's wealth is built <br>upon the genocide of the indigenous people of this continent, and the chattel <br>slavery of the people of another continent, and the ongoing brutal <br>exploitation of immigrants.<br><br>But our mythology denies and denies and denies our history. Well, it's this <br>same mythology that has allowed the vacuous puppet in the White House to <br>mumble things about &quot;staying the course,&quot; and &quot;noble cause&quot; and the rest of <br>the country to mumble assent.<br><br>But then Cindy Sheehan says &quot;What noble cause?????&quot; ... slowly more people <br>begin to ask the same question... and on Saturday more than 100,000 people - <br>(check out the <a href=\"http://dc.indymedia.org/newswire/display/130362/index.php\">photos</a>) - <br>come to the nation's capital to ask the same question.<br><br>Mr. President, please don't show me any more. I've seen enough. If it were <br>up to me, you wouldn't get to make one more decision that would put one more <br>person in harm's way. It's time we had some &quot;Truth and Reconciliation&quot; here.<br><br>*************************************<br>EVAN GREER!<br><br>Last night was the first night of my midwest tour with <a href=\"http://evangreer.com\">Evan Greer</a>.<br> - It's a joy and a privilege to work with such a <br>talented and bright young performer, and I look forward to introducing him to <br>all my midwest friends. Don't miss these shows! Evan will be performing <br>with me through October 22nd.<br><br>*************************************<br>THANKS!<br><br>Many thanks to Jerry Tucker and the St Louis Health Care Education Fund for <br>making my trip to the inspiring Jobs with Justice national conference <br>possible. It was great to see so many friends there, and also to meet so <br>many great folks. Thanks to the Missouri Rural Crisis Coalition for hosting <br>such a wonderful dinner.<br><br>*************************************<br><br>CIW TAKES ON BURGER KING<br><br>I'm traveling with postcards you can sign to help the <a href=\"http://ciw-online.org\">Coalition of Immokalee Workers</a> bring its campaign for justice to Burger King. <br>This is a logical step following the terrific <a href=\"http://whirled_retort.blogspot.com/2005/03/coalition-of-immokalee-workers-we-won.html\">victory with Taco Bell</a>.<br><br><br>*************************************<br><br>FAMILY NEWS<br><br>My New Orleans cousins were still living somewhere near Austin the last that <br>I heard. I hope they are safe at home soon!<br><br>My daughter Amy is finally back from Mexico and back in school at Portland <br>Community College.<br><br>My son Dan will run a marathon in Washington, DC this month.<br><br>My cousins Mary and Paul Grefenstette are in Ireland right now with daughter <br>Erin &amp; husband Mark.<br><br>*************************************<br><br>HELP!!!<br><br>The lockout of the 156 families employed by Celanese in Meredosia, IL <br>continues - please read up on this <a href=\"http://www.lockout484.org\">struggle</a> and <a href=\"https://secure.unasecure.net/activedonation/index.cfm?siteID=boilermakers484\">donate online</a> <br>or by mail to:<br><br>Boilermakers Local 484 Solidarity/Defense Fund<br><br>P.O. Box258<br>300 Main Street<br>Meredosia, IL 62665<br><br>Remember how very difficult it is for other hardhit people to raise money <br>right now and please be generous. I'll be doing another show for them on <br>October 9th.... <br><br>Hope to see you somewhere soon!\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
