{
	"date": "Monday, October 04, 2010",
	"title": "OCTOBER 2010 - Anne Feeney's Fellow Travelers' Advisory - VOLUME SIX #7",
	"body": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"//2.bp.blogspot.com/_yPZWeXAMdds/TKnr-9c_YaI/AAAAAAAAAn4/TdlG4MXXbYU/s1600/weasel.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"//2.bp.blogspot.com/_yPZWeXAMdds/TKnr-9c_YaI/AAAAAAAAAn4/TdlG4MXXbYU/s400/weasel.jpg\" width=\"299\"></a></div><br>\nThis little stuffed weasel showed up on my porch last week.&#xA0; Here I am, preparing to give him hell. <br>\n<br>\n<br>\n<br>\nI'm feeling really droopy today, and have been pretty low for a week or so.  There is so much more I wanted to say this month.  I love you and I'm holding you in my heart.  I'll try to make sure the caring bridge page is current with health news.<br>\n<br>\n<a href=\"http://www.caringbridge.org/visit/annefeeney/journal\">http://www.caringbridge.org/visit/annefeeney/journal</a><br>\n<br>\nAt least I didn't get raided by the FBI this month ......<br>\n<br>\n**********************************************************************************<br>\n<br>\nUNION SONG CONTEST - PLEASE VOTE FOR ME!!!<br>\n<br>\nThe folks who offer the &quot;Union Privilege&quot; Credit Card are sponsoring a Union Song Contest.  Forty five union members have entered songs in the contest.  The winner will receive $2000.  <br>\n<br>\nSo far, I'm in the lead by 24 votes.  My entry is &quot;War on the Workers.&quot;  There are only a couple days left to vote, so please vote now!  It only takes a couple minutes.<br>\n<br>\n<a href=\"http://members.unionsongcontest.org/entries#47275\">http://members.unionsongcontest.org/entries#47275<br>\n</a><br>\nIn order to vote you have to register your name and email (to prevent multiple votes), and click on the link in the confirmation email that they send to you.  (Some folks reported that the confirmation email went to their 'spam' filters... so don't forget to check there!) There are songs there by lots of great folks - Bev Grant, John McCutcheon, Andy Antipin, Evan Greer, Peter Alsop and many many more.  <br>\n<a href=\"//www.blogger.com/%20http://members.unionsongcontest.org/entries#47275\"><br>\nhttp://members.unionsongcontest.org/entries#47275</a><br>\n<br>\nThe link above will take you to my song.  Click on it and it will begin to play.  If you think it's the best song, I hope you'll vote for it.  I'd appreciate it!<br>\n<br>\nThanks so much!<br>\n<br>\n<br>\n<br>\nHEALTH NEWS <br>\n<br>\n<br>\nIt's almost two months since I found out about the tumor in my lungs ... Since then it's been a maze of doctors' offices, hospital rooms, IVs, medications etc etc.  There are many aspects of this process that are dehumanizing... lots and lots of hours waiting waiting waiting.<br>\n<br>\nHow incredibly uplifting your cards and letters have been.  You've reminded me again and again that you remember me, that you're thinking of me, that I mean something to you, and that I am loved.  All of those things are hard to keep in focus when you're wearing a hospital gown on a gurney sitting in some hallway and everyone seems to find a new way to mispronounce your name.  So many thoughtful, loving and generous gestures from all of you!  I cannot thank you enough or ever express my gratitude sufficiently. I'm overwhelmed.<br>\n<br>\nThe latest medical setback is a rampant infection of MAC bacteria in my upper right lung. One of the three antibiotics, Rifampin, is being administered intravenously, at a cost of $186.30/day. Another prescription had a $300 co-pay for a month's supply...  And I may be on these three antibiotics for 18 months!  If I were one of the 40+ million uninsured, I would certainly be denied this treatment.<br>\n<br>\nThis current half-assed health care bill does nothing to address the soaring costs of health care.... in fact, it guarantees insurance companies and pharmaceutical companies huge profits.  As I sang all last summer - WE NEED NATIONAL HEALTH CARE NOW!!!<br>\n<br>\n<br>\n<br>\nSOME CANCER &quot;DO'S &amp; DON'T'S&quot;<br>\n<br>\n(These are just my personal observations, so take 'em with a grain of salt..)<br>\n<br>\nDO's<br>\n<br>\nHow I've loved the teas, cookies, scarves, hats, miso soup mix, books and cds that y'all sent me.  The hilarious cards and heartfelt notes have been fantastic!  The money has been most appreciated, and has relieved me of the grinding anxiety of living on the financial edge. (If you'd still like to help me out there's a paypal &quot;donate&quot; box about four inches down from the top on the right hand side of this page -  Or you can send a check to Anne Feeney, 2240 Milligan Avenue, Pittsburgh,  PA  15218.)  It's hard to imagine anyone who wouldn't appreciate some cash in the face of such a sudden escalation of expenses AND simultaneous loss of income.  Any heartfelt expression of affection in a card is so appreciated by anyone!  I've been particularly touched by folks who reminded me of fun things we did together - picket lines, rallies, riots, etc.<br>\n<br>\nOne of my favorite cards was from Molly Rush:<br>\n<br>\nGreat reasons to love being bald:<br>\n<br>\n1) No more expensive hair products.<br>\n2) No more bed head.<br>\n3) Gray?  What gray?<br>\n4) Look more like your adorable baby pictures.<br>\n5) More places to kiss!<br>\n<br>\n<br>\nDON'Ts<br>\n<br>\nDon't bother sending the recipe for the flaxseed enema that supposedly saved someone's life.<br>\n<br>\nDon't bother sending the novena, scapular, relic or special prayer that cures cancer unless you're sure that the person shares your spirituality.<br>\n<br>\nDon't send the &quot;75 affirmations that must be said daily in order to effect a cure, and then ONLY if you send the affirmations to 20 people within 24 hours -- or something awful will happen to you!&quot;<br>\n<br>\nDon't assume that the only thing your friend with cancer wants to talk about is cancer.  It's actually my least favorite thing to talk about.<br>\n<br>\nDon't tell your friend that &quot;attitude is everything.&quot;  Of course a hopeful and positive outlook is helpful, but it doesn't cure cancer any more than a moment of sadness, frustration or doubt kills you. Give your friend room to express his/her feelings.<br>\n<br>\n<br>\nDon't stay away.  A quart of homemade soup makes up for almost any other oversight.<br>\n<br>\n*******************************************************************************<br>\n<br>\nYou can still buy my cds at CDBaby - <a href=\"http://cdbaby.com/all/unionmaid\">http://cdbaby.com/all/unionmaid</a><br>\n<br>\n**********************************************************************************<br>\n<br>\nSome benefit shows for me coming up in Pittsburgh, Chicago, Miami and the Bay Area.  Thanks to the Eugene folks who put together a show on October 2nd... and the Johnstown folks who did a Labor Day show.  You're all wonderful.&#xA0; I'll try to get all the details for these benefit shows onto <a href=\"http://annefeeney.com/calendar.html\">http://annefeeney.com/calendar.html</a> soon.\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
