{
	"date": "Monday, July 26, 2004",
	"title": "WILD WIMMIN FOR PEACE: The Great Peace March",
	"body": "<img src=\"https://lh5.googleusercontent.com/proxy/ZOPUZXQWMq33e42vO-Koajkzp7WPMnvapRPUH_m3nzBoAQV_zHyaPwAXjf2tSn4DoQXUwzmcvhUqR98Q4JL8bbvz=s0-d\">\n<br><a href=\"http://cdbaby.com/cd/wildwimmin\">WILD WIMMIN FOR PEACE: The Great Peace March - hear and buy it at CD BABY</a>\n<br>\n<br>Getting involved in the Great Peace March for Global Nuclear Disarmament in 1986 was one of the best things that ever happened to me. I had two young children, and I was very concerned about the arms race. During the Reagan years it was pretty easy to drift into cynicism and helplessness. Enter Wild Wimmin for Peace. It was late September of 1986, and they were nearing the end of a 3700 mile journey that had begun almost six months before. I didn't have much in the way of expectations when I was asked to present this 20 womon ensemble of peace marchers. I figured they were activists, not artists, and that the show would be boring and preachy. NOT! I was so wrong! Their energy and optimism and tribalism and spiritualism and humor and talent just blew me away. I couldn't get their music out of my head. \n<br>\n<br>By October 2, I had gotten our local peace and justice center, the Thomas Merton Center, and East Hills NOW to co-sponsor the project. I raised enough money from individual donors to the Merton Center and NOW to finance the project. I convinced Don Bell, one of the very few professional sound engineers in Pittsburgh, to dismantle his studio and take it to the Great Peace March campsite, which by then was 80 miles out of town in Bedford, PA. The marchers, facilitated by Liz Marek and others, consensed and consensed about the details of how this recording would be used. In the end, everyone waived all rights to any of the proceeds from the sale of the recording as long as no one was going to benefit except for peace and feminist groups worldwide. The Merton Center and NOW were to make copies available at cost to any non-profit peace or feminist organization. Wild Wimmin for Peace wanted any marcher who agreed to the concept to be able to participate, so there are several additional songs on the recording.\n<br>\n<br>Since its hasty production on October 2, 1986 this recording has made its way all over the world, raising tens of thousands of dollars for peace and feminist groups from the Nevada Test Site to Greenham Common. The marchers touched the lives of many people in profound ways that we may never completely document or understand. I cherish the great times I had with Liz Marek, one of the moving forces in Wild Wimmin for Peace (as well as in the production of this recording). Liz perished on Pan Am 103 over Lockerbie, Scotland. And it's with sadness that I report the passing of Ginny Dean, whose sweet voice is heard on most of these tracks. When this recording was first released the US and Soviet Union were poised in a nuclear standoff. Global thermonuclear destruction seemed almost inevitable. The dangers are different today, but our work is more necessary than ever. The original cassette liner notes said &quot;Take the positive energy from this recording and use it to teach peace.&quot; Still good advice. \n<br>\n<br>and now, at long last, it's available on CD.  All proceeds from the sale of this CD go to the <a href=\"http://thomasmertoncenter.org\">Thomas Merton Center.</a> It's also available at cost through the Merton Center to other groups working for peace and feminism.\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
