{
	"date": "Saturday, November 06, 2010",
	"title": "NOVEMBER 2010 - Anne Feeney's Fellow Travelers' Advisory - VOLUME SIX #8",
	"body": "NOVEMBER 2010 - Anne Feeney's Fellow Travelers' Advisory - VOLUME SIX #8<br>\n<br>\n<br>\n<br>\n<br>\nThat election.&#xA0; Yuck.&#xA0; Stop banging your head against the wall.&#xA0; Leave the punching&#xA0; bag alone. <br>\n<br>\nI can think of no possible better way to cope with the last election than for you to join me next Saturday - November 13th -&#xA0;at Allegheny Unitarian Church when my fabulous friends, Lou and Peter Berryman will put on a concert you'll be chuckling about for the rest of the month.&#xA0; If you've seen them before, I know you're marking your calendars now.&#xA0; If you haven't seen them before - TRUST ME.&#xA0; They are national treasures making a rare Pittsburgh appearance.&#xA0; And I couldn't talk them into taking all the concert proceeds.&#xA0; They are insisting on contributing to my &quot;paid sick days&quot; fund.&#xA0;&#xA0;&#xA0;&#xA0; I've been out of work now since August 5th with no relief in sight. Just getting to hear&#xA0;Lou and Peter&#xA0;will probably be a great boost to my immune system, though!&#xA0; I'm&#xA0;so looking forward to an evening out on the town. &#xA0;(My immune system is still waaay compromised, so I hope you'll refrain from hugs/handshakes etc unless you've been boiled recently.)<br>\n<br>\nHere's the release that Lou and Peter sent out for the show....&#xA0; Hope to see you there!!!<br>\n<br>\n<br>\nFOR IMMEDIATE RELEASE<br>\n<br>\n<br>\nAn evening of intelligent musical comedy with Wisconsin singers and songwriters Lou &amp; Peter Berryman. A benefit, in part, for Anne Feeney<br>\n<br>\nNov 13, 2010 8:00 PM<br>\n<br>\nAllegheny Unitarian Universalist Church<br>\n416 W. North Ave.<br>\nPittsburgh, PA&#xA0; 15212<br>\n<br>\nTickets: http://www.brownpapertickets.com/event/135648 $15 adv. (+$1.99 surchage for internet orders) or $20 at the door<br>\n<br>\nInformation: 412-877-6480 or 608-257-7750<br>\n<br>\n<br>\n<br>\nTake the elegant wit of Cole Porter, the topical satire of Tom Lehrer and the absurdity of Flanders and Swann; blend with down-home Wisconsin cheese, wacky harmonies, accordion and 12-string guitar, and -- voila! the wickedly funny, uniquely entertaining team of Lou &amp; Peter Berryman. From cleaning the fridge (&quot;When Did We Have Sauerkraut&quot;) to impending environmental catastrophe (&quot;Why Am I Painting the Livingroom?&quot;) to the eternal folly of youth (&quot;A Chat with Your Mother&quot; aka &quot;The F-Word&quot;), no subject escapes their keen and quirky observation. <br>\n<br>\n<br>\n<br>\nIn almost 30 years together, Lou &amp; Peter have recorded 16 albums of their original songs, and produced 2 songbooks. Such venerable and prestigious venues as Berkeley's Freight &amp; Salvage, The Old Town School of Music in Chicago, The Ark in Ann Arbor, New York's Caffe Lena and Passim in Cambridge have hosted them regularly. They have performed frequently on national public radio including Minnesota's A Prairie Home Companion, and they have played at most major folk festivals across North America. They tour throughout the year, and make their homes in Madison, Wisconsin.<br>\n<br>\n<br>\n<br>\n&quot;Rhymes that rhyme! I love your stuff, and if I were still performing, I'd steal it!&quot; Tom Lehrer<br>\n<br>\n<br>\n<br>\n&quot;When it comes to being funny, I think I've spent the first thirty years trying to be as funny as Tom Lehrer and the last part will be trying to be as funny as the Berrymans. They don't come any funnier than that.&quot; Tom Paxton<br>\n<br>\n<br>\n<br>\n&quot;Lou &amp; Peter Berryman! Long may they wave! Their song, &quot;A Chat with your Mother&quot; is one of the great American folksongs of the 20th century.&quot; Pete Seeger<br>\n<br>\n<br>\n<br>\nMore about Lou &amp; Peter Berryman at LOUANDPETER.COM<br>\n<br>\n<br>\n<br>\nLou &amp; Peter are dedicating this concert to their dear friend Anne Feeney. Anne is a beloved Pittburgh singer and songwriter who has been travelling the world for decades. Her music has inspired and comforted working people everywhere, but her work has been interrupted by a bout with cancer. A portion of the evening's proceeds will go to Anne, for her recovery fund. More about Anne and her music at www.annefeeney.com<br>\n<br>\n***********************************************************************************<br>\n<br>\nIF YOU'RE IN CLEVELAND -&#xA0; LOU and PETER WILL DO A SHOW FOR ME THERE THE NIGHT BEFORE!!<br>\n<br>\nFriday, November 12th, 2010 8:00 PM<br>\n<br>\nPeter and Lou Berryman in Concert with special guest Deborah Van Kleef<br>\n<br>\nUU Society of Cleveland<br>\n2728 Lancashire Road<br>\nCleveland Heights, OH<br>\n<br>\nhttp://uusocietyofcleveland.tripod.com/index.html<br>\nPrice: $15 suggested<br>\n<br>\nThis concert is, in part, a benefit for Anne Feeney's&#xA0;&quot;paid sick days&#xA0;fund.&quot; <br>\n<br>\n**********************************************************************************<br>\n<br>\nTHANK YOU, THANK YOU, THANK YOU!<br>\n<br>\nThanks to Kristin Lems for organizing a star-studded fundraiser for me in Chicago!&#xA0; Thanks to Mark Ross for organizing a wonderful fundraiser for me in Eugene.&#xA0;&#xA0; Thanks to Gene and Natasha for sending me one night's proceeeds from their Lexington, KY production of &quot;Marx in Soho.&quot;&#xA0; I understand there are still some upcoming shows in Florida and a huge one here in Pittsburgh on December 12th.&#xA0; Your generosity has been overwhelming... and taken all the financial anxiety out of this devastating illness.&#xA0; Your cards and letters lift me.&#xA0; I cannot imagine that this story does not have a happy ending.&#xA0; Your love and support is such a constant presence in my life.<br>\n<br>\n**********************************************************************************<br>\n<br>\nHAPPY NOVEMBER 6th 40th BIRTHDAY to MY NIECE, KIMBERLY ANNE SEVER!<br>\n<br>\nHappy Nov 11th birthday to Mary Lane McCahill, Nov 12th birthday to Julie Leonardsson, Nov 18th birthday to John Morber, and Nov 25th birthday to Kathleen Mumphrey Chapman (who just celebrated her 10th wedding anniversary to Ross Chapman..... mazel tov, you two!)<br>\n<br>\nThe highlight of last month was the visit from my grandson Sebastian all the way from Ecuador.&#xA0; He brought his parents along, too, which was wonderful.&#xA0; And Amy arrived the same day.&#xA0; It's such an incredible&#xA0;joy to have my kids under one roof - and Sebastian added a most wonderful dimension!&#xA0; I think I'm going to like&#xA0;this grandma gig a LOT.&#xA0; Amy is still here, and Dan and Monique and Sebastian will be back here on December 18th.&#xA0; YAY!<br>\n<br>\n*******************************************************************************<br>\nYou can buy my cds at <a href=\"http://cdbaby.com/all/unionmaid\">http://cdbaby.com/all/unionmaid</a><br>\nYou can stay on top of my health news at <a href=\"http://www.caringbridge.org/visit/annefeeney\">http://www.caringbridge.org/visit/annefeeney</a><br>\nYou can donate to my recovery by clicking on the &quot;Donate&quot; button about 4 inches down the page on the right, or send&#xA0;a check (or a letter, or a card... to anne feeney, 2240 Milligan Ave, pittsburgh, pa&#xA0; 15218<br>\n<br>\n*******************************************************************************<br>\n<br>\nSaturday, November 13th, 2010 8:00 PM<br>\nPeter and Lou Berryman in Concert<br>\nAllegheny Unitarian Universalist Church<br>\n416 W North Ave<br>\nPittsburgh, PA 15212<br>\n412.877-6480<br>\nPrice: $15 advance, $20 at the door<br>\nTickets: http://www.brownpapertickets.com/event/135648 $15 adv. (+$1.99 surchage for internet orders) or $20 at the door<br>\n<div class=\"separator\" style=\"clear: both; text-align: center;\"></div>This concert is, in part, a benefit for my &quot;recovery fund.&quot;\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
