{
	"date": "Saturday, November 03, 2007",
	"title": "Anne Feeney's Fellow Travelers' Advisory - NOVEMBER 2007, VOLUME THREE, #8",
	"body": "Anne Feeney's Fellow Travelers' Advisory - NOVEMBER 2007, VOLUME THREE, #8<br><br>IMMEDIATE DESTINATIONS:<br><br>Charleston, WV<br>Portland, OR<br>Atlanta, GA<br>Fort Benning, GA<br>Schenectady, NY<br><br>details at the end of this newsletter<br><br>to unsubscribe, scroll to the end of this newsletter and click on the link.<br><br>to buy CDs, visit <a href=\"http://cdbaby.com/all/unionmaid\">http://cdbaby.com/all/unionmaid</a><br><br>*********************************************<br><br>This is a great time of year to take stock of all the things we have to be grateful for... I'm so grateful to have you in my life... your interest, your activism and your support of my music mean so very much to me. I'm grateful for the work that I have... I hope you'll get some time with friends and family over the Thanksgiving weekend.<br><br>Love,<br>Anne<br><br>********************************************<br><br>IN THIS ISSUE:<br><br>FABULOUS DECEMBER 2nd SONG FOR JACKIE CONCERT w BERNICE JOHNSON REAGON, RONNIE GILBERT and me!!!<br><br>PLEASE HELP ME WITH MY NEW CD!!<br><br>DISCOUNTS IN NOVEMBER on my CDs at CDBABY<br><br>DVDs and MUSIC BOXES<br><br>IRELAND IN 2008<br><br>A HALLOWE'EN STORY:<br>THE REVOLT OF THE SKELETON CREW<br><br>JULIUS MARGOLIN TRIBUTE<br><br>NORTHWEST 2008<br><br>FAMILY NEWS<br><br>TOUR DATES<br><br><br>*********************************************<br><br><br>I'M IN CONCERT DEC 2nd with RONNIE GILBERT, BERNICE JOHNSON REAGON, and MANY MANY MORE WONDERFUL MUSICAL GUESTS...<br><br>My September newsletter noted with sorrow the death of my longtime Albany/Schenectady area host Jackie Alper. Jackie's &quot;Mostly Folk&quot; aired on WRPI for many many years and she was an extraordinary person... which is why so many luminaries will come to be part of this concert to honor her: SONG FOR JACKIE<br><br>The Eighth Step at Proctors will host a tribute concert for Jackie Alper - featuring yours truly AND Ronnie Gilbert, Bernice Johnson Reagon, Steve Gillette and Cindy Mangsen and many many more special and wonderful musical guests! If you're within 200 miles of Schenectady you'll want to get tickets immediately for this concert... scheduled for Sunday, December 2nd at 7PM<br><br>Proceeds benefit the Eighth Step.<br><br>********************************************<br>MY NEW CD:<br>Dump the Bosses Off Your Back -- You Can Help!<br><br><br>Part of the reason that Dump the Bosses Off Your Back has been so long in coming is because so far I only have 30 sponsors for this recording, instead of my usual 200... Check to see if your name is on the donors' list below. If not, please, please, consider being an 'executive producer/angel/enabler' of this new CD - $100 gets your name (or the name of someone else of your choice... now there's an unusual holiday gift...) into the liner notes of my CD.<br><br>If you can, please send $100 to:<br><br>Anne Feeney<br>2240 Milligan Avenue<br>Pittsburgh, PA 15218<br><br>If you can't, don't sweat it. Consider buying one of my CDs for a friend... that'll help too. Still, there must be 170 people left on this list who can spare $100 to help me out here.....<br><br>(If you sent me $100 for &quot;If I Can't Dance,&quot; thank you thank you &amp; please disregard this message.)<br><br>Here is the list of my angels-to-date - If I forgot anyone, please let me know, ASAP!!!<br><br><br>Amy Newell, Kay Magill, Jeanine Malito, Jack O' Malley, Rosemary Trump, Rosanna Lane, Candice Carter, Stan Swart, Joel Henderson, Rich Shriver, Shelley Kessler, Tom Herman and Jo Miller, Rose Feurer, Pat Bennett, Berk Snow, Jeanne Clark &amp; Tim Sullivan, Michele Samuels. Courtney Derwinski, Dexter Arnold, Corliss Olson, Charlene Torok Cannon, Martha Shunn, Michael Ruscigno, David Newby, Jan Boyd, Jim Tremmel, Millie B, Sue Vilbrandt, Noel Beasley, Ron Berlin<br><br><br>The new CD will include:<br><br>Preacher and the Slave (Pie in the Sky)<br>Dump the Bosses Off Your Back<br>Hallelujah, I'm a Bum<br>Brave New Christmas<br>Ya Basta!<br><br>plus my three new ones:<br>You Will Answer<br>How Much for the Life of a Miner?<br>How Long?<br><br>plus these favorites from my cassettes:<br><br>No Man's Land<br>Here's to You Rounders<br>Whatever Ya Say, Say Nothing<br><br>********************************************<br><br>Special Discounts at CDBaby, this month only!<br><br>For November only I have discounted all my CDs at CDBaby for gift-givers... (if you buy more than one)... Please visit http://cdbaby.com/all/unionmaid ....<br><br>********************************************<br><br>Music Boxes &amp; DVDs<br><br>While supplies last, I have a small quantity of those darling hand-cranked Swedish music boxes that play &quot;The Internationale.&quot; Too cool. The perfect holiday gift for the leftie who abhors commercialism. $40 while supplies last. Send check to Anne Feeney, 2240 Milligan Avenue, Pittsburgh, PA 15218<br><br>And, I have a small quantity of the &quot;This is What Democracy Looks Like&quot; DVD in stock. This latest edition includes recent interview with Noam Chomsky and Vandana Shiva. $20 by check to Anne Feeney, 2240 Milligan Avenue, Pittsburgh, PA 15218<br><br>If you want to pay by credit card or Paypal, email me... anne@annefeeney.com<br><br>********************************************<br><br>Ireland 2008<br><br><br>The Ireland trips for 2008 are going to be fantastic. I can only take 20 people at a time. I've got 13 signed up for June, 11 signed up for August and 5 signed up for September/October ... If you're interested in touring the west of Ireland with me in 2008, drop me a line - anne@annefeeney.com - and I'll send you all the details. This is a wonderful opportunity to see the &quot;real Ireland.&quot; Music, politics, poetry, history, scenery ... and, of course, Guinness...<br><br>You're all welcome!<br><br>*********************************************<br>A HALLOWE'EN STORY<br>The Revolt of the Skeleton Crew<br><br>After months of dwindling staff due to attrition and layoffs, Heartland Human Services in Effingham, IL was finally down to a real skeleton crew.<br><br>Thirty five workers were doing the work of 70 by the time they finally said, &quot;Enough is enough,&quot; and went on strike.<br><br>These thirty five AFSCME members (Local 3494) have been on strike since July 2nd - almost four months without a paycheck ... The board at Heart(less) (In)human Services is ignoring the recommendations of its own chief negotiator and its attorney ... cruelly prolonging the strike. These workers deliver mental health services to inpatients and outpatients in Illinois.<br><br>Evan Greer and I helped to raise $800 for the strikers while we were in the midwest. The 100 delegates at the AFSCME education conference I played at last weekend donated $125 to the strike fund. Can't you help by sending a donation - how about $35??? - to:<br><br>AFSCME COUNCIL 31 SOLIDARITY FUND<br>615 S. Second St.<br>P.O. Box 2328<br>Springfield, IL 62705<br><br>heartland@heartlandhs.org is the email address of the employer...<br>The Board Members are:<br><br>Roger Marshall President<br>Jeff Bloemker Vice President<br>Pat Green Secretary/Treasurer<br>Deborah Mahon Director<br>Debra Owen Director<br>John Perry Director<br>George Westjohn Director<br>Terri Phillips Director<br><br>Email them all at heartland@heartlandhs.org and tell them &quot;Enough is Enough!&quot; Time to return to the bargaining table with promises of adequate staffing, livable wages and security and dignity on the job!<br><br>Thanks!<br><br><br>***********************************************<br><br>Julius Margolin Tribute Concert<br><br>The Julius Margolin Tribute show was a smashing success... The lovely auditorium at 1199 - the Health and Hospital Workers' Union of New York was a perfect setting for an inspiring show. Julius was in great form and sang a couple songs with George Mann. He was very touched by the turnout and the music. We raised about $1800 for a scholarship fund to help young trade union activists attend the Great Labor Arts Exchange and the Western Workers' Labor Heritage Festival.<br><br><br>***********************************************<br><br>Northwest 2008<br><br>I'm trying to decide whether or not to tour the Northwest in Jan/Feb of 2008. My new CD should be ready by then, and there's a good chance that my summer tour to the Northwest will be very very short this year. Does anyone know of anything going on in the NW (or the great Canadian SW) in Jan/Feb 2008?<br><br>********************************************<br><br>Family News<br><br>November 6 - Kimberly Sever's birthday phatchick(@)gmail.com<br><br>November 12 - Julie Leonardsson picasso77750(@)yahoo.se<br><br>Turkey Day plans...<br><br>Julie and I will host Amy Berlin and Jesse Dalton, Dan Berlin &amp; Monique Murad, Ron Berlin, Kate Feeney, Kimberly Anne Sever, Bill Feeney and Tod Faller for Thanksgiving dinner.<br><br>And in Aiken, Aunt Claire will get to enjoy all seven of her grandchildren and all three great-grandchildren ... Olivia Grefenstette from Chicago, Charlie Warren from Greenville, SC, and newest great-grandchild Marlo Mary of Denver.<br><br>San Diego Cousins Dodge the Wildfires<br><br>My cousins Jim &amp; Mardy McCahill and Peggy and John Duncan (parents of Connor &amp; triplets Emma, Colin and Tara) live in the &quot;voluntary&quot; evacuation area of the San Diego wildfires. You can imagine the bedlam which ensued when Peggy and John had to uproot the two year old triplets and big brother Connor to new surroundings. At last report, alll are safely back at home.<br><br>Hole in One for Birdman<br><br>On Wednesday, October 17, my Maryland cousins Kevin (Birdman) McCahill his brother Denny (Yo Daddy) were playing an afternoon round at The Timbers at Troy golf course, in Elkridge, MD. This is an outstanding course, and a very difficult challenge, as witnessed by the Slope Index of 134 from the blue tees, which they were playing that day. The fifth hole is a par three requiring the tee shot to carry over an expanse of open natural wetlands, which extend right up to the heavily trapped green. The course considers this to be their signature hole, and has a picture of it on the front of the scorecard. <br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://bp1.blogger.com/_yPZWeXAMdds/RywYcDPfNvI/AAAAAAAAAFY/CAl3H_fAUjU/s1600-h/Birdman+HIOC084.jpg\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5128500945853822706\" src=\"https://lh5.googleusercontent.com/proxy/kTm1CZzcyAsdSLPyIgtp1rewll0vEtMVCjhhY2fPyhjPpUfDoURGT0T56qqMD6lnd2VE74n_AMutuZfWT3Oh0Q2vCo6hptmHrsel8_R-Tn0KrZe2vuBWL4YX7ie9Cn7jtjuRYn8RB_H-ROSBlspcWtsJqco=s0-d\" style=\"float:center; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><br><br> It is an exceptionally beautiful and demanding par three.<br><br>Denny hit first, and produced a pretty good shot, that hit on the left side of the green, and then bounced into one of the many sand-traps surrounding the hole. Kevin then stepped up, and with a classically smooth swing, launched a high flying seven iron that, after a sweet and delicate draw, landed three feet in front of the pin, took one bounce, and rolled smoothly into the center of the cup! Yeaaaaaay! Hooray for Kevin! A lifetime goal achieved, in the most elegant fashion. Kevin turned after watching the shot go in, and with an incredulous look on his face, rushed across the tee to embrace his cheering brother in exultation.<br><br>As if by magic, the beer cart girl showed up as they reached the green, and Kevin immediately bought his first (of many, I expect) round of drinks in celebration of his exploit. The young lady was astounded to receive a five dollar tip just for handing out three beers, but she soon discovered why, and ended up helping with the celebration.<br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://bp1.blogger.com/_yPZWeXAMdds/RywYQDPfNuI/AAAAAAAAAFQ/CE4FPAL9B7c/s1600-h/Birdman+HIO083.jpg\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5128500739695392482\" src=\"https://lh6.googleusercontent.com/proxy/6LjAwsOoI9xhjAQvpgUWW-hfCnUX2pG1-ehl2XGa0dHA34PWvlssSpnnEpAuy6yX3ZlOtJ8YTmze7Q_n7lKBteQXpFExqn42sPksK3MErAma1t85hJ5cyv34c960DXwZRN4QcBoFZmN0yLis6bAgWloD-g=s0-d\" style=\"float:center; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><br><br>Thanks to Yo Daddy for the exciting account, which I adapted for this month's Family News.<br><br>********************************************<br><br><br>TOUR DATES<br><br>Saturday, November 3rd, 2007 8:00 PM<br>Anne Feeney in Concert<br>Unitarian Universalist Congregation<br>520 Kanawha Blvd W<br>Charleston, WV<br>304-345-5042<br>Price: $7-12 suggested<br><br>Friday, November 9th, 2007 1:00 PM<br>Pacific Northwest Labor Arts Festival Retreat<br>Bonneville Hot Springs<br>Portland, OR<br>503-703-1693<br>This festival is sponsored by the NW Oregon Labor Council and others.<br><br>Saturday, November 10th, 2007 1:00 PM-9PM<br>Pacific Northwest Labor Arts Festival<br>with Dick Weissman, Rebel Voices, Citizens' Band, George Mann &amp; Julius Margolin, Mic Krenshaw, Robert Johnson &amp; a dramatic reading of Studs Terkel's work by AFTRA Members. Plus Art/Murals/Oral Histories &amp; More!<br>for more information: 503-703-1693<br>Portland State University<br>Portland, OR<br><br><br>Thursday, November 15th, 2007 7:00 PM<br>Benefit Concert for SOAW<br>Eyedrum Gallery<br>290 MLK Drive, SE<br>Atlanta, GA 30312<br><a href=\"http://www.eyedrum.org\">http://www.eyedrum.org</a><br>Price: $5-25 sliding<br>with a very distinguished cast ... don't miss it!<br><br>Friday, November 16th, 2007 12:00 PM<br>SOAWatch Vigil<br>School of the Americas<br>Fort Benning, GA<br><a href=\"http://soaw.org\">http://soaw.org</a><br><br>Saturday, November 17th, 2007 8:00 PM<br>SOAWatch Vigil<br>School of the Americas<br>Fort Benning, GA<br><a href=\"http://soaw.org\">http://soaw.org</a><br><br>Sunday, November 18th, 2007 12:00 PM<br>SOAWatch Vigil<br>School of the Americas<br>Fort Benning, GA<br><a href=\"http://soaw.org\">http://soaw.org</a><br><br>Sunday, December 2nd, 2007 7:00 PM<br>Song for Jackie:<br>A Fabulous Tribute Concert for Jackie Alper!<br>Eighth Step at Proctors<br>432 State Street<br>Schenectady, NY 12305<br>(518) 434-1703<br><a href=\"http://eighthstep.org\">http://eighthstep.org</a><br>Price: $tba<br>This concert will benefit the Eighth Step and features Ronnie Gilbert, Bernice Johnson Reagon, Steve and Cindy Gillette and many more special guests. I'm ecstatic to have this opportunity to honor the memory of my friend, Jackie Alper, and to benefit the Eighth Step.<br><br>Please check with the venue to confirm times, etc. Information is continuously updated at <a href=\"http://annefeeney.com/calendar.html\">http://annefeeney.com/calendar.html</a><br><br>If this was forwarded to you, you can subscribe at <a href=\"http://annefeeney.com/newsletter.html\">http://annefeeney.com/newsletter.html</a><br><br>Thanks!\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
