{
	"date": "Saturday, August 13, 2005",
	"title": "Shut  'Cha Down! - Labor Notes - Song Of The Month",
	"body": "<a href=\"http://labornotes.org/archives/2005/06/articles/a.shtml\">This ought to be against the law!</a><br><br>I'm thrilled to report that my little parody slamming Glen Tilton is now the <a href=\"http://labornotes.org/songs/songOfMonth.html\">Labor Notes - Song Of The Month</a><br><br><a href=\"http://labornotes.org/songs/music/shutchaDown.ram\">Shut 'Cha Down</a><br><br><br>Anne Feeney, on receipt of Labor Heritage Foundation's 2005 Joe Hill award, introduced the song this way:<br><br>I was just at the Regina Polk union women's leadership conference in Chicago where fully a third of the women attending worked for United Airlines.<br><br>  <br>I don't how many of you followed what went on, but most of them had put $60,000 to $100,000 of their salary into the employee stock option plan, and when United's stock became worthless they said &quot;Well at least we have the wonderful pension that the union has negotiated for us.&quot;<br><br>And while we were at this conference the federal bankruptcy court set aside United's pension obligations and funneled it all over to the PBGC [Pension Benefit Guaranty Corporation].<br><br>And at the same time Glenn Tilton the obnoxious CEO -- there are no words to describe this man -- well maybe there's one -- anyway he was awarded a $450 million guaranteed pension in rocognition of his resolute handling of this crisis.<br><br>So this was the biggest hit on Concourse C at O'Hare after the conference. We went from counter to counter singing this.<br><br>Actually, Anne was off by a couple of decimal points. Tilton's guaranteed pension is only $4.5 million. Still, when compared to the average United employee's guaranteed pension through PBGC, he is flying high. <br><br>Personnel: Anne Feeney, lead vocal, guitar; Steve Jones, piano; Rafael Herrera, Pam Parker, Janet Stecher, harmony vocals\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
