{
	"date": "Saturday, December 04, 2010",
	"title": "DECEMBER 2010 - Anne Feeney's Fellow Travelers' Advisory - VOLUME SIX #9",
	"body": "Hi All<br>\n<br>\nYou can buy my CDs at <a href=\"http://cdbaby.com/all/unionmaid\">http://cdbaby.com/all/unionmaid</a> or by calling 1-800-BUY-MY-CD.&#xA0; They make great grab-bag gifts!<br>\n<br>\n<br>\nUPCOMING BENEFIT SHOWS - FT. LAUDERDALE&#xA0; and&#xA0;PITTSBURGH<br>\n<br>\nTomorrow&#xA0;afternoon (well, today if you're reading this on Sunday...) some of the finest of Florida's musicians as well as some superb touring musicians will join forces in Ft. Lauderdale&#xA0;at the legendary Labyrinth Cafe in a benefit for my &quot;paid sick days&quot; fund.&#xA0; It's so overwhelming and very touching to see musicians coming together for me.<br>\n<br>\n<br>\n<br>\nSunday, December 5, 2010<br>\n<br>\n2:00 p.m.<br>\nAnne Feeney Benefit Concert<br>\nLabyrinth Caf&#xE9;<br>\nUU Church of Ft. Lauderdale, 3970 NW 21st Avenue, Ft. Lauderdale, FL 33309<br>\n<br>\nhttp://www.labyrinthcafe.com/Cosponsored.html<br>\nAnne Feeney has been a force to be reckoned with for many years. She has sung out and stood up for political and social injustice in every area of her life. She has helped many people in need. Now she is fighting cancer, and we want to help her in her struggle. <br>\n<br>\nPerformers include: Ellen Bukstel, Coalition of Immokalee Workers, Ray Del Papa, Jennings &amp; Keller, Rod MacDonald, Marie Nofsinger, The Raging Grannies, Joan Rose, Vicki Ryder, The Solidarity Singers, Amy Speace, Amy Carol Webb, Doug &amp; Telisha Williams, Valerie C. Wisecracker...<br>\n<br>\nFor more info about Anne, you can check out her website (<a href=\"http://www.annefeeney.com/\">http://www.annefeeney.com/</a>) or go to <a href=\"http://www.caringbridge.org/visit/annefeeney\">http://www.caringbridge.org/visit/annefeeney</a> &#xA0;, where you can read the journal updates and/or write in her guest book - Ms. Feeney's Wild Ride indeed!<br>\n<br>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br>\n<br>\nThere is also a raffle planned. You could win a $2000.00 handmade guitar. This guitar, handmade by S. L. Smith, with a hard case is being raffled off for Anne's benefit. There will be only 250 total tickets sold at $10.00 each. For more info about who made the guitar: <a href=\"http://guitars.slsmith.info/\">http://guitars.slsmith.info/</a><br>\n<br>\n<br>\nWe expect to hold the drawing during the concert on December 5. If all 250 tickets are not sold by that time, an equitable time for the drawing will be determined and the winner will be posted. Michael Stock, of WLRN's Folk and Acoustic Music Show, on Sundays from 2 - 5 PM, has kindly agreed to assist with the drawing and announcement of the winner if it does not take place at the fundraiser. <br>\n<br>\n(Let me know if you're interrested in a raffle ticket.&#xA0; If they don't sell all the tickets by tomorrow, I'm sure they'll be happy to sell one to you!&#xA0; email me @ <a href=\"mailto:anne@annefeeney.com\">anne@annefeeney.com</a>)<br>\n<br>\n<br>\nPITTSBURGH, PA -&#xA0; SUNDAY, DECEMBER 12th - MR. SMALL'S - 7PM<br>\n<br>\nYou'd have to be a student of Pittsburgh musical legends to understand how completely amazing the lineup is for the December 12th show at Mr. Small's.&#xA0; RUSTED ROOT will be turning in a short set.&#xA0; Blues giant BILLY PRICE will sing.&#xA0; THE GRANATI BROTHERS&#xA0;will rock out.&#xA0; Justin Sane from ANTI-FLAG&#xA0;will add some hard edged punk to the show.&#xA0; Fresh from his night of performing with Bruce Springsteen, JOE GRUSHECKY AND THE HOUSE ROCKERS will dazzle us.&#xA0; My dear friends&#xA0;THE NEWLANDERS will perform, as will JACK ERDIE, BRAD YODER, TRES LADS, JOE MUNROE, SUE POWERS AND JEFF BERMAN.&#xA0; This concert was the brainchild of MIKE STOUT and the HUMAN&#xA0;UNION&#xA0;who will perform songs from their fabulous new CD.&#xA0; &#xA0;Many of Pittsburgh's finest side musicians (ROBBIE KLEIN, NELSON HARRISON and so many more!)&#xA0;will be filling out the lineup, and (I hope) joining me on stage if I feel up to it.&#xA0; Many many thanks to Senator Jim Ferlo for his generosity, support and guidance in the planning of this event.<br>\n<br>\nThere's going to be an incredible silent auction during the show with some impossible-to-find-anywhere-else items donated by local musicians and artists.&#xA0; All the musicians will have CDs on sale, so please come to buy some recordings too - support all our fabulous live local&#xA0;musicians!<br>\n<br>\nAdvance tickets available at <a href=\"http://ticketweb.com/mrsmalls\">http://ticketweb.com/mrsmalls</a> or charge by phone @ 866-468-3401 and various locations around Pittsburgh.<br>\n<br>\nI hope to have some photos from this for the January Fellow Travelers' Advisory.<br>\n<br>\n*******************************************************************************<br>\n<br>\nMany many thanks to the Mother Jones Committee in Springfield, IL who dedicated their 2010 annual banquet to me.&#xA0; They had a silent auction before dinner and a hat pass afterward, and folks were exceedingly generous.<br>\n<br>\n************************************************************************<br>\nSTRANGELY ABSENT FROM THE ELECTORAL DEBATE<br>\n<br>\nYou would have never guess we're still in the middle of two wars.&#xA0; All during the recent election campaigns there was hardly any mention of the high cost of the 2 invasions and occupations of Iraq and Afghanistan. Besides the deaths often estimated over 1 million people, over $1.1 trillion or more has already been spent with no end in sight. It is estimated that it has cost the U.S. $50 million to kill each Taliban. The proposed U.S. embassy to be built in Kabul will cost $500 million. A new audit shows that the U.S. cannot account for nearly $18 billion earmarked for the Afghan occupation. (Democracy Now, 10/29/10). U.S. soldiers sent to Iraq and injured will need $600 billion for their healthcare. However, there is hardly a peep from the Tea Party, which usually vehemently complains about the overspending of tax payer money. Over 55% of federal taxes are spent by military bureaucrats and lobbyists at the Pentagon. If we cut military spending by only 1% we could completely eliminate poverty in the U.S. (Online Journal Sentinel, 11/19/10). If we used the tax money for basic human needs instead of invading and occupying countries for economic reasons we could guarantee all our citizens, not just some, education and healthcare. In other words, we could have what most Europeans already have. All we have to do is follow their example and drastically cut military spending. It would be a step in the right direction towards a more peaceful and just world. We get what we pay for. -------Don Timmerman <br>\n<br>\nThis piece appeared in &quot;The Sparrow Sings&quot; - the wonderful monthly newsletter from my friends Don Timmerman&#xA0;and Roberta Thurstin.&#xA0; If you'd like to subscribe, send an email to: <a href=\"mailto:don2roberta@yahoo.com\">don2roberta@yahoo.com</a> and tell them so.<br>\n<br>\n************************************************************************<br>\n<br>\nSOAW UPDATE<br>\n<br>\nThis just in from Don and Roberta:&#xA0; Some of the 29 people taken into custody outside Ft. Benning during the rally at the annual School of the Americas Watch Vigil on Nov. 20 in Columbus GA were undercover agents, one of whom was arrested with the others. Fr. Bill Brennan, S.J., a former Casa Maria community member, at 90 years old, was one of those arrested and later released. Good going, Bill! Fr. Louis Vilale and Davvid Omondi, both Catholic Workers, were arrested for civil disobedience or divine obedience and sentenced to 6 months in prison. -----SOA Watch Enjoying your freedom? Thank a protester! <br>\n<br>\n<br>\nI was so sorry to miss the gathering at the gates of SOA this year.&#xA0; The musical collective was in grand form, with the lovely new addition of our pal Roy Zimmerman.&#xA0; It's hard to say how long it will take to close this evil place, but I believe that we will.&#xA0; I was very pleased to hear that the musical collective sang &quot;Have You Been to Jail for Justice?&quot; on Saturday, and dedicated it to me.<br>\n<br>\n***************************************************************************<br>\n<br>\nI LOVE HEARING FROM YOU!<br>\n<br>\nPlease keep the cards and letters coming.&#xA0; I get so stir-crazy sitting at home day after day after week after month (although it sure beats being in the hospital...).&#xA0; I wish I felt up&#xA0;to more phone calls, but my energy level is VERY low.&#xA0; That's why I love reading your comments at <a href=\"http://www.caringbridge.org/visit/annefeeney\">http://www.caringbridge.org/visit/annefeeney</a>&#xA0;and getting mail from you.&#xA0; As soon as I feel up to it, I'm hitting the road to come and thank you all in person.&#xA0; That could be a while though.&#xA0; In the meantime, know how very much I cherish our connection and look forward to our next meeting.<br>\n<br>\nAnne Feeney<br>\n2240 Milligan Avenue<br>\nPittsburgh,&#xA0; PA&#xA0; 15218<br>\n<br>\n*******************************************************************************<br>\n<br>\nSEBASTIAN<br>\n<br>\nI don't know if&#xA0; you all will be able to see this 54 second video of my grandson, Sebastian, at home in Ecuador.&#xA0;(If not, trust me, he's cute.&#xA0; Very cute.) &#xA0;I'm so looking forward to having him and&#xA0;the rest of my family here from December 18-26th.&#xA0; It will be wonderful!&#xA0; <a href=\"http://sharing.theflip.com/session/b65c0d92ccb4955b65d476a038bf2729/video/31896261\">http://sharing.theflip.com/session/b65c0d92ccb4955b65d476a038bf2729/video/31896261</a><br>\n<br>\n*********************************************************************************<br>\n<br>\nWHATEVER YOU'RE CELEBRATING<br>\n<br>\nI&#xA0; hope the coming weeks bring you plenty of days off, the light and love of family and friends, good health and that 2011 will be a wonderful healthy year for us all.\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
