{
	"date": "Saturday, September 27, 2008",
	"title": "OCTOBER 2008 - Anne Feeney's Fellow Travelers' Advisory - VOLUME FOUR, #7",
	"body": "<a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//1.bp.blogspot.com/_yPZWeXAMdds/SN7JQ_A583I/AAAAAAAAANI/HW77xP_qaPI/s1600-h/demo+esf+055.JPG\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5250855509190898546\" src=\"//1.bp.blogspot.com/_yPZWeXAMdds/SN7JQ_A583I/AAAAAAAAANI/HW77xP_qaPI/s400/demo+esf+055.JPG\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;\"></a><br><br><br><br>Jan Hammarlund and I at the European Social Forum<br><br><br><br><br>Thanks so much for signing up for my once-a-month email news - THE<br>FELLOW TRAVELERS' ADVISORY<br><br>It means so much to me that you want to stay in touch. Please let me<br>know what you're up to - this newsletter goes out monthly to 7000<br>activists.<br><br>You've seen my show... you know I don't have (and won't have) any<br>corporate sponsors to promote my music - I count on you! If none of<br>the upcoming shows are near you, maybe you know someone who lives<br>where I'm playing... tell them!<br><br>THANK YOU!<br><br>(If you don't want to hear from me any more, you can unsubscribe by<br>clicking the link at the bottom)<br><br>%%%%%%%%%%%%%%%%%%%%%%%%%%%<br><br>BUY MY CDS at:<br><br>http://cdbaby.com/all/annefeeney<br><br>IN THE EU:<br><br>http://www.fourdogsmusic.co.uk/<br><br>%%%%%%%%%%%%%%%%%%%%%%%%%%%<br><br>UPCOMING SHOWS!!<br><br>(The details for all these shows are at the end of the newsletter,<br>and continuously updating at http://annefeeney.com/calendar.html(<br><br>IRELAND<br>WASHINGTON, DC - October 10<br>NEW YORK CITY - October 11<br>SPRINGFIELD, IL - October 12<br>MEMPHIS, TN - October 17 &amp; 18<br>PITTSBURGH, PA - October 24<br>SCHENECTADY, NY - October 25<br>WORCESTER, MA - November 5<br>BOSTON, MA - November 6<br>*ESSEX, MA* - November 8<br>*CAMBRIDGE, MA* - November 9<br>*WASHINGTON, DC* - November 15<br>*NORFOLK, VA* - November 16<br>ATLANTA, GA - November 20<br>FORT BENNING, GA - November 21-23<br>and then.... TEXAS!!<br><br>*these shows are with the fabulous CHARLIE KING!!<br>http://www.charlieking.org/ - I am so honored, thrilled and happy to<br>get a chance to tour with this great songwriter, performer and<br>friend!<br><br>%%%%%%%%%%%%%%%%%%%%%%%%%%<br><br>SEPTEMBER!!<br><br><br>I've got to run for the airport to get the flight from Copenhagen to<br>Ireland, so this will have to be short. If you'd like to see this<br>with photos, it will be up on my blog soon at<br>http://fellow-travelers-advisory.blogspot.com/2008/09/october-2008-anne-feeneys-fellow.html<br><br>The month started off great at the Kerrville Wine and Music Festival,<br>where GREEN MOUNTAIN GRASS headlined this year. My daughter Amy's<br>significant other... Jesse Dalton... plays bass in the band. They<br>turned in a terrific set, and it was a joy to see them on the main<br>stage. Dalis Allen, director of the festival, invited me on stage to<br>say a few words about the meaning of Labor Day. I was delighted, and<br>honored.<br><br>We celebrated Amy's 27th birthday at the festival, and my son Dan and<br>his wife, Monique, were on hand to help with the celebrations.<br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//2.bp.blogspot.com/_yPZWeXAMdds/SN7Ll0aG61I/AAAAAAAAANY/3G6l77fJhpg/s1600-h/DSC00804.jpg\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5250858066144324434\" src=\"//2.bp.blogspot.com/_yPZWeXAMdds/SN7Ll0aG61I/AAAAAAAAANY/3G6l77fJhpg/s400/DSC00804.jpg\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;\"></a><br><br><br><br>Amy's 27th birthday party sushi boat!<br><br><br><br>After that, my friend Karen Newman came along with me for a great<br>whirlwind tour of the beautiful Oregon coast. Got in visits with<br>lots of wonderful friends and had a great time... then on the the<br>PEACE AND JUSTICE STUDIES ASSOCIATION national conference in<br>Portland. It was a fantastic experience. As soon as I have a few<br>minutes, I'll put live links on my blog to some of the amazing folks<br>who spoke there - ANN WRIGHT, KATHY KELLY, FELICE and JACK<br>COHEN-JOPPA, BERNARD LAFAYETTE, MARJORIE COHN, STEPHEN ZUNES, SAMI<br>RASOULI and more more more ... It was a tremendously moving<br>experience and I learned so much there.<br><br>From Portland, on to Malmo, Sweden for the EUROPEAN SOCIAL FORUM.<br>Thousands of activists from all over Europe converged on this<br>gorgeous town in southern Sweden... activists from the labor,<br>environmental, peace and feminist movements talking about food<br>security, an end to the war, declining labor standards, poverty,<br>patriarchy... it was a BLAST.<br><br>Then the most wonderful tour of Denmark. More later, but I am so<br>grateful to Gerd Berlev and Jan Lars Nielsen for their hospitality<br>and help here in Denmark.<br><br>%%%%%%%%%%%%%%%%%%%%%%%%%%%<br><br>HELP!!!<br><br>I could REALLY use a fill in date for FRIDAY, NOVEMBER 7th... if you<br>are anywhere in MA or CT or RI and would consider hosting a house<br>concert... or know of an event that I could plug into for that<br>evening... it would be terrific! Please drop me a line -<br>anne@annefeeney.com<br><br>(If the budget permits, CHARLIE KING could join me for this show!)<br><br>Also, Charlie and I will be touring together down to the School of<br>the Americas Watch Vigil and we're looking for a gig somewhere<br>between Norfolk, VA and Atlanta, GA on November 17th.<br><br>If you could host me and Charlie for a show, that would be great!!<br>Drop me or Charlie a line at anne@annefeeney.com or<br>VaguelyRem@aol.com.<br><br><br>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br>HAPPY BIRTHDAY<br><br><br>Casey Horne. Oct 5 - Dan Berlin, Oct 6 - Jennifer Erin McCahill,<br>Oct 6 - Maureen Metcalfe, Oct 6 - Jan Boyd, Oct 9 - Bill Feeney, Oct<br>16 - Jill Merrill, Oct 16 - Steve Merrill, Oct 20, Carolyn Weldon,<br>Oct 28 !!!!<br><br><br>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br><br>I'll have more news on my blog soon at<br>http://fellow-travelers-advisory.blogspot.com/2008/09/october-2008-anne-feeneys-fellow.html<br><br>but, I've got to leave for the airport now!<br><br><br>&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;<br><br>THE TOUR<br><br><br>September 30-October 9th<br>Tour Ireland with me! This is Enchanted Way Tour of Ireland - #3 -<br>http://enchantedwaytours.ie<br>I've got three more wonderful tours of Ireland coming up in 2009...<br>drop me a line at anne(@)annefeeney.com to get more information. We<br>have soooooo much fun on these tours... the scenery, the music, the<br>history, the poetry, the politics!! YES!!! Come along in 2009.<br><br>Friday, October 10th, 2008 8:00 PM<br>Anne Feeney, George Mann, Julius Margolin, The DC Labor Chorus, Chris<br>Chandler, and Anne Hills. A concert to celebrate the release of<br>&quot;Farewell to the Thief!&quot;<br>Communications Workers of America Headquarters<br>501 3rd Street NW, Ground Floor conference center<br>Washington, DC 20001<br>http://georgeandjulius.com<br>Price: $12<br>no one turned away for lack of funds! A great show, the first of<br>several CD release parties/concerts featuring artists from the &quot;Hail<br>to the Thief!&quot; CD series. For more info:<br>georgemann(@)worldnet.att.net<br><br>Saturday, October 11th, 2008 8:00 PM<br>&quot;Farewell to the Thief!&quot; A benefit concert for the Julius Margolin<br>Scholarship Fund<br>Local 802, American Federation of Musicians<br>322 W. 48th Street (between 8th and 9th Avenues<br>New York, NY<br>http://georgeandjulius.com<br>Price: $10/12<br>no one turned away for lack of funds.<br>Anne Feeney, George and Julius on the bill...for more info, contact<br>georgemann(@)worldnet.att.net<br><br>Sunday, October 12th, 2008 5:00 PM<br>23rd Annual Mother Jones Dinner: FDR Meets Anne Feeney<br>University of Illinois at Springfield Public Affairs Center -- Ground<br>Floor Sangamon Auditorium Lobby (New location)<br>Springfield, IL<br><br>5:00 p.m. Social Hour 6:00 p.m. Dinner 7:00 p.m. Program<br><br>Dinner tickets for this year's event are $25.00 each. Reserved tables<br>for groups of eight are available upon request, arranged the evening<br>of the program on first-come-first-serve basis. Tickets will be<br>mailed upon receipt of payment -- so please reply promptly.<br>Attendance for the program which begins following the meal is free,<br>and seating will be available at 7:00 p.m.<br><br><br>FRANKLIN DELANO ROOSEVELT COMES TO LIFE in the capable hands of<br>historical dramatist R.J. Lindsey. Through extensive research, a<br>meticulous attention to detail and the use of only documented<br>speeches, letters and anecdotes, a vivid living portrait emerges.<br>Extensive experience as a teacher, researcher and actor have<br>contributed to the success of his living history programs which have<br>been seen from Jerusalem to London to the Democratic National<br>Convention. Lindsey draws upon a rich family history as a descendant<br>of ancestors who served in the Virginia militia during the Revolution<br>in 1776, settled the Great Plaines by covered wagon and joined the<br>Kansas Volunteers during the Civil War. As an educator, Lindsey<br>taught speech and theater for twelve years. As a theatrical<br>professional he has appeared on stage and television. His credits<br>include: She Stood Alone, Fatal Judgment, Will. He is a member of<br>Actor's Equity, the Screen Actor's Guild, and the American Federation<br>of Television and Radio Artists. R.J.'s website: www.rjlindsey.com.<br><br>Please return reservations and checks payable to:<br><br>Mother Jones Foundation<br>P.O. Box 20412<br>Springfield, Illinois 62708-0412<br><br>For more information call:<br><br>Jack Dyer at 217-787-3043 Terry Reed at 217-789-6495<br><br><br><br>Friday, October 17th, 2008 12:00 PM<br>Gandhi-King Conference<br>Christian Brothers University<br>650 East Parkway<br>Memphis,, TN 38104<br>(901)725-4990<br>http://www.gandhikingconference.org/<br>Price: $30-70 sliding<br><br>Saturday, October 18th, 2008 8:00 PM<br>Gandhi-King Conference: Continuing the Dream...Constructing the World<br>House<br>Christian Brothers University<br>650 East Parkway<br>Memphis,, TN 38104<br>(901)725-4990<br>http://www.gandhikingconference.org/<br>Price: $30-70 sliding<br>Friday, October 24th, 2008 8:00 PM<br>Celebration of the Life of Utah Phillips: With Anne Feeney, Doug<br>Wilkin, Sue Powers, Jack Erdie, Sue Gartland, Robert Wagner, Bruce<br>Hoffman, David King<br>First Unitarian Church<br>605 Morewood Ave<br>Pittsburgh, PA 15213<br>http://utahphillips.org<br>Price: $10/20 suggested<br>Gary Doebler is the contact...esterhazy22(@)hotmail.com<br><br>Join us as we celebrate the Golden Voice of the Great Southwest --<br>Utah Phillips. Read more about him at his website above, and bring a<br>generous donation for the charity of Utah's choice - Hospitality<br>House of Grass Valley, CA.<br><br>Saturday, October 25th, 2008 8:00 PM<br>The Eighth Step Presents: Election Day Special with Anne Feeney, Jay<br>Mankita, Peter Siegel, Addie and Olin, Terri Roben<br>GE Theatre, Proctors<br>432 State Street<br>Schenectady, NY 12305<br>(518) 434-1703<br>http://eighthstep.org<br><br>Wednesday, November 5th, 2008 2:00 PM<br>Worcester State University<br>email me - anne@annefeeney.com if you want to come<br><br>Thursday, November 6th, 2008 8:00 PM<br>Association for Humanist Sociology<br>hootenanny with Jim Infantino!<br>Boston, MA<br>email me - anne@annefeeney.com if you want to come<br><br>Friday, November 7th, 2008 7:00 PM<br>Anne Feeney in Concert<br>Lee's House Concerts - CANCELLED!<br>Sharon, MA<br>Please keep Lee and his family in your thoughts .. His son is<br>undergoing surgery.<br><br><br>PLEASE PLEASE email me if you can do a house concert on this night -<br>FRIDAY, NOVEMBER 7th!<br>anne@annefeeney.com<br><br><br>Saturday, November 8th, 2008 8:00 PM<br>Anne Feeney and Charlie King in Concert at the One World Coffeehouse<br>First Universalist Church<br>59 Main Street<br>Essex, MA 01929<br>978-768-7056<br>Price: $15 suggested<br><br>Sunday, November 9th, 2008 10:00 AM<br>Charlie King and Anne Feeney<br>First Universalist Church Sunday Service<br>59 Main Street<br>Essex, MA 01929<br>978-768-7056<br>http://www.uuessex.org/worship/sundayService.html<br>Price: free, all welcome<br><br>Sunday, November 9th, 2008 4:30 PM<br>Anne Feeney and Charlie King - EARLY SHOW!!<br>Passim Folk Music &amp; Cultural Center<br>47 Palmer Street - Harvard Square<br>Cambridge, MA 02138<br>(617) 492-7679<br>http://www.clubpassim.org/passimcalendar/viewEvent2.php?evt=1221855943<br>Price: $15<br>Main: 617.492.5300<br><br>I am so looking forward to sharing the stage at this venerable venue<br>with my friend and mentor Charlie King! Please come, and stay for<br>dinner!<br><br>Saturday, November 15th, 2008 8:00 PM<br>Anne Feeney and Charlie King in Concert<br>Westminster Church<br>400 I Street SW<br>Washington, DC 20024<br>Price: $15 suggested<br>sponsored by DC Labor for Peace and Justice - Bruce Wolf is the<br>contact ... haunteddog(@)aol.com<br><br>Sunday, November 16th, 2008 7:00 PM<br>Charlie King and Anne Feeney in Concert<br>40th St. Stage<br>809 W. 40th St<br>Norfolk, VA 23508<br>Price: donations<br>contact willbaggs2002(@)yahoo.com for more information<br><br>Thursday, November 20th, 2008 8:00 PM<br>Concert for SOA Watch with an All-Star Cast (from the left side of<br>the galaxy!)<br>Eyedrum Gallery<br>290 MLK Drive, SE<br>Atlanta, GA 30312<br>http://www.eyedrum.org<br>Price: donations<br><br>Friday, November 21s- Sunday, November 23rd<br>School of the Americas Watch Vigil<br>Fort Benning<br>Columbus, GA<br>http://soaw.org\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
