{
	"date": "Sunday, July 03, 2005",
	"title": "Greetings from Eugene",
	"body": "I'm still glowing from the fabulous midwest trip.  It was so great to stay with Ed &amp; Marlene Sadlowski, although, as always, I wish we had had more time together.  The IWW concert was great fun.  Larry Long, Citizens' Band, Charlie King &amp; Len Wallace, John Berquist, Rebel Voices, Mark Ross, Utah Phillips and I took turns swapping songs, adding harmonies, instrumentals, and, at least once,  a chorus line !  I sure hope the live recording that was made captures the magic of that evening at the Peoples' Church. I was stunned to learn that my pal Len Wallace was recovering from a heart attack... He looked great, tho...and sounded strong as ever...<br><br>What a great surprise to see Al and Dotty Dale from Bellingham, WA at the show -- they were in town for a wedding and visiting son Dan. The Wobbly conference that took place that weekend was terrific too... it was so inspiring to hear the organizers from the South Street Workers' Union. And Ernie Beal has a great UU congregation that meets in the same church on Sundays.  I had the pleasure of singing at that service.<br><br>Mother Jones Fest was interesting.  Cecil Roberts, President of my beloved United Mineworkers of America, spoke.  He talked more about Mother Jones and the old days -- not a word about the mineworkers supporting mountain-top mining in WV, or their *not* supporting a national park and monument at Blair Mountain, where striking miners were the victims of the only aerial bombing of US civilians in our history until the MOVE bombings in Philadelphia many decades later.  The turnout for the Mother Jones Fest was fantastic.  More than 400 tickets sold to the banquet ... and there were a host of activities that weekend... including a Mother Jones Golf Tourney! <br><br>The Midwest Labor Press Association conference was fantastic.  How nice to see Mike Rankert, and so many folks from Hedy Hilburn's Louisville local ... Gary Brown did a great job putting it together.<br><br>Got to spend lots of time with Janet Stecher and Susan Lewis of Rebel Voices, and a little with Citizen's Band and Charlie King. I flew from Chicago to Dulles, to pick up my car where I had left it after the Great Labor Arts Exchange.  Mark Ross had missed his plane, so we had lunch at the airport.  When I got to DC, my son Dan and his sweetheart Monique and I went to Silver Spring and had dinner with my best friend from college, Shirley Shultz.  Shirley and I had a glorious day of self-indulgence ... gym, manicures, new shoes... and I got back to the Burgh at 11 PM with 36 hours to unpack from the MN, DC and Midwest swing and pack for the 5 week tour of the great Pacific Northwet and Canadian Southwewst...<br><br>Now I'm in Eugene where my daughter Amy is sleeping sweetly until I wake her to help me find a birthday cake for the big Brian QTN/Anne Feeney Birthday Celebration at Sam Bond's tonight.  That should be great fun. <br><br>I'm sick about Sandra Day O'Connor's resignation.  I was hoping Bush would resign before any of them did.\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
