{
	"date": "Sunday, December 05, 2004",
	"title": "Who Da Bitch Now? - The Controversy Returns",
	"body": "I want to post a response to a very heartfelt and sincere complaint about one of the songs on my CD <a href=\"http://www.cdbaby.com/cd/annefeeney2\">Have You Been to Jail for Justice?</a> that I received from Willy, who writes:\n<br>\n<br>&quot;The first song is great, the reason I bought the album, but MAN- the\n<br>who the bitch now song - sickens me and makes me lose all respect for\n<br>you and your work.  Condoning  violence is wrong, even to violent\n<br>people - a terrible message for someone representing those seeking a\n<br>just world!&quot;\n<br>\n<br>\n<br>My response: \n<br>\n<br>This is by no means the first sincere complaint I have received about this remarkably complex and disturbing song by my friend Eric Schwartz. I was totally shocked and startled into stunned silence the first time I heard Eric perform it informally to a crowd gathered under a tree at the Kerrville Folk Festival.  I didn't laugh either, although the large crowd found it utterly hilarious.  I couldn't get the song and its imagery out of my head.  I had Eric play the song for me again alone and we talked about it some.  I discussed it with friends who had heard it, and were also anxious to talk about the experience of hearing this song.  After a few days of this, I realized that this 2 and half minute song had provided me with three days of intensive reflection on the sufferings of James Byrd, Matthew Shepard and Abner Louima -- and provoked hours of reflection on the subject of retribution. I've always been a sucker for songs that make me think.\n<br>\n<br>If you listened to the entire album I hope you noticed that the theme of this recording is jail. All sixteen new songs (and two of the four bonus tracks) include references to prison. I wanted to do an album that dealt specifically with the many aspects of life in prison after reading an article that pointed out that the US has more people in prison per capita than any nation on the planet except possibly China.  We have 2,000,000+ people behind bars.  Being a great admirer of Gene Debs, I despise prisons and believe that they create more problems than they solve.\n<br>\n<br>That being said, I believe everyone (inlcuding me) has rejoiced -- if only for a few moments -- when hypocrites are chastised. When the pious and self-righteous Jimmy Swaggart is discovered in a rent-by-the-hour motel with a prostitute, I think most people say &quot;Aha!&quot; -- It certainly doesn't mean that they condone prostitution or exploitation of women. And while in our nobler hearts, I'm sure that we all wish Jimmy spiritual growth and other good things, we wouldn't be humans if we couldn't appreciate the irony of his situation.  This is exactly what Eric is calling our attention to in this song. If we become too self righteous to appreciate irony, we may be heading for a fall ourselves.\n<br>\n<br>It was the first song that brought you in, and the eighth song that turned you off. (I hope you listened to the last twelve songs...)  &quot;Who Da Bitch Now?&quot; has introduced a lot of people to my music and they listen to the other nineteen songs on the recording.  It's a trade off.  Not every song will resonate with every person.  I've had people tell me they hate &quot;Joe Hill&quot; or &quot;The Internationale.&quot; The music itself goes from folksy to urban to reggae to Celtic to polka.  Sometimes I wonder if I'm the only person who totally enjoys all the songs and styles on this recording. I think Eric Schwartz is a very skilled writer.  When I sing it, I'm applauding the verdict - the public acknowledgment that what they did was wrong wrong wrong. \n<br>\n<br>That being said, I promise that one of these days I'll put &quot;Have You Been to Jail for Justice?&quot; on an anthology of inspiring songs and leave &quot;Who Da Bitch Now?&quot; for my compendium of &quot;Songs that Always Get Me in Trouble.&quot; (I've had quite a few of them over the last 30 years... some of them seem quite innocent now.)\n<br>\n<br>So, Blogmates, let the discussion begin... Your comments are welcome.\n<br>\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
