{
	"date": "Sunday, July 31, 2005",
	"title": "Fellow Travelers' Advisory from Anne Feeney: VOLUME One, Number 5 - August 2005",
	"body": "IMMEDIATE DESTINATIONS:<br><br>July 31 - Yachats, OR<br>August 4 - Newport, OR<br>August 6 - Eugene, OR (FREE show!)<br>Harrisburg, PA; Hershey, PA; Springfield, IL; Mt. Olive, IL; Ann Arbor, MI; Detroit, MI; Terre Haute, IN<br><br>You can buy my CDs at <a href=\"http://cdbaby.com/all/unionmaid\">CDBaby</a><br><br>Then, YOIKS! -- I've been so busy I haven't had time to book any new work! I don't even have Labor Day 2005 confirmed anywhere! Holy Cow, what was I thinking? Email me at: anne@annefeeney.com if you have some ideas for all these blank dates!<br><br>Well, I'll tell ya... I've been on the road for over a month with my 23 year old daughter, Amy Berlin. It's been such a luxury and joy to have so much of her company. It's been so much fun to introduce her to all my friends in the Pacific Northwest (and the great Canadian Southwest)... what an adventure!<br><br>Walking into the Oregeon Country Fair (a magnificent three day extravaganza of vaudeville/puppeteering stilt-walkers, contortionists, firebreathers and swordswallowers) I overheard a woman talking. She says &quot;How much worse can things get? Bush in the White House, this horrible war in Iraq, Sandra Day O'Connor resigning, bombs in London, and the AFL-CIO falling apart! Well.... at least I live in a state where I can kill myself!!&quot;<br><br>Shall we propose that to the Oregon Convention and Visitors' Bureau? Billboards that say &quot;Welcome to Oregon --- at least you can kill yourself here.&quot; .... maybe on the license plates...<br><br>And the tour has been wonderful. All my hosts have been conspicuously generous, competent and gracious. <br><br>Congratulations to my companero David Rovics, who is going to be a daddy! And good luck to Nathalie, who'll be doing all the work on that project! <br><br>The brilliant Prince Myshkins CD &quot;Total Myshkin Awareness&quot; has kept me laughing for the whole tour. I highly recommend it, and you'll be hearing me singing some of their material in the coming months.<br><br>I've also really enjoyed performing Pittsburgh songwriter Jack Erdie's terrific song &quot;Let Their Heads Roll.&quot; I'll put information on how to listen to and/or order both of these CDs on my blog soon.<br><br>In the meantime, a gazillion people have asked me what I think about the current turmoil in the US Labor movement. I've put a few links on my blog to people whose opinions I greatly respect, and I encourage you to read their thoughtful opinions. It's a good thing that so many people are hearing and thinking about unions ... there has never been a social engine like it for ending poverty and improving the quality of working life. I mourn the end of the AFL-CIO women's divisions, education department, the layoffs and firings of the field representatives and the uncertain future of labor education. I hope this crisis evolves into the end of labor's love affair with its abusive spouse, the Democratic party. We need a real progressive political party in this country and the Democrats have demonstrated time and againt that they are not interested. Meanwhile, millions of people work draconian hours and suffer debilitating stress-related and repetitive motion injuries. Millions work with no pensions, or find their pensions looted at the end of a 35 year working career. Millions endure invasive spying, prying and over-management of their waking hours. Millions have no health care, or are stuffed into some crappy HMO. Parents have no time for their children. Working adults have no time for service to their communities, civic life, cultural life. We need a vital and energetic labor movement more than ever ... and I'm still ready to work hard for it.<br>********************************<br><br>At the AFM national convention (American Federation of Musicians) in Las Vegas we passed the US Labor Against the War resolution calling for an immediate end to the war! It was very exciting. One brother came up to the mic and says, &quot;Does anyone in this room remember Inchon?? Does that name mean anything to you? I was there! I invaded Korea! I know what war is!!! and I'm telling you now, I wish to hell someone in the United States had been working to bring ME home!!&quot; of course I'm paraphrasing his remarks, but we all thought he was headed in a different direction with that speech! I'm so proud of my union. The same resolution passed at the AFL-CIO convention in Chicago, too.<br><br>******************************<br><br>Please forward this on to anyone you think might enjoy it, and tell your friends and relations to come and see me if I'm headed to where they live! I'm never going to have any corporate sponsors, folks, so YOU are my publicists...<br><br>***************************************<br><br>Sunday, July 31st, 2005 8:00 PM<br>Music for Troublemakers<br>Yachats Commons<br>Highway 101<br>Yachats, OR<br>541.265.9747<br>Price: $10 sugggested<br>no one turned away.... this will be a great night... co-sponsored by the local Folklore Society... you can also email blancanegro@earthlink.net for more info. <br><br>Thursday, August 4th, 2005 8:00 PM <br>Music for Troublemakers<br>Cafe Mundo<br>NW Coast and 2nd St<br>Newport, OR<br>541-265-9747<br>Price: $10 suggested<br>no one turned away... all welcome..more info at blancanegro@earthlink.net <br><br>Saturday, August 6th, 2005 7:30 PM<br>U Oregon Labor Summer School<br>University of Oregon - Erb Memorial Ballroom<br>Eugene, OR<br>Price: FREE!!<br>Bob Bussell is the contact.<br>Bob Bussell be reached at 541 346-2784 (w) or 541 232-1764 (Cell) <br><br><br>Sunday, August 21st, 2005 8:00 PM<br>Looking for Work<br>Bay Area or north... enroute to Eureka<br><br>Monday, August 22nd, 2005 8:00 PM<br>Vacation/Retreat in Northern CA thru August 31<br><br><br>Friday, September 9th, 2005 8:00 PM<br>PA Labor History Society Annual Meeting<br>Harrisburg, PA<br><br>Saturday, September 10th, 2005 8:00 PM<br><br>PA Labor History Society Annual Meeting<br>Hershey, PA<br><br>Saturday, October 8th, 2005 6:00 PM<br>Mother Jones Banquet <br>U of IL at Springfield PAC Cafeteria<br>Springfield, IL<br>http://motherjonesfoundation.org<br><br>Sunday, October 9th, 2005 10:00 AM<br>Mother Jones Memorial Service <br>Mt Olive, IL<br><br>Wednesday, October 19th, 2005 8:00 PM<br>IWW Centenary Event<br>University of Michigan<br>Ann Arbor, MI<br>julie herrada is organizing this <br><br>Friday, October 21st, 2005 8:00 PM <br>Labor History Conference<br>Wayne State University<br>Detroit, MI<br>ML Liebler is coordinating this event <br><br>Saturday, October 29th, 2005 8:00 PM <br>2005 Eugene V Debs Dinner<br>Terre Haute, IN<br>http://eugenevdebs.com<br><br>Thursday, November 10, 2005 - 6PM<br>Thomas Merton Center Award Dinner<br>Sheraton Station Square<br>Pittsburgh, PA<br>This year's awardee is Father Roy Bourgeois!<br>http://thomasmertoncenter.org<br><br>Friday, Nov 18th - Sunday, Nov 20th, 2005 12:00 PM<br>SOA Vigil<br>details TBA<br>Fort Benning, GA `<br>http://soaw.org\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
