{
	"date": "Sunday, August 08, 2010",
	"title": "Sad  health news from Anne Feeney ... can you help?",
	"body": "How much one conversation with a doctor can change your life!<br>\n<br>\nThis time last week I thought the next time I'd be writing to you  would be with my exciting September news and Labor Day special...<br>\n<br>\nThis time last week I thought I'd be in Sweden tonight&#xA0; packing to go to Ireland to meet up with all my wonderful tourmates.<br>\n<br>\nInstead, here I am in Pittsburgh packing to go Shadyside Hospital.&#xA0;  On August 3rd, in Sweden, a lung specialist advised me that I have an 11  cm tumor on my lung that is stressing both my heart and lungs in  dangerous ways.&#xA0; As terrifying as this diagnosis is, it is in many ways a  relief to get an explanation for the several mysterious and troubling  symptoms I've had for the past few months... including increasing  fatigue, shortness of breath, terrible coughing, and bizarre heart  rhythms.&#xA0; <br>\n<br>\nI could have stayed in Sweden for the bronchoscopy, biopsy and  surgery ... my health insurance would have covered everything in Sweden  that it covers here.&#xA0; But even the best case scenario here will involve a  protracted recovery period and probably at least six months out of  work.&#xA0; It was also hard to think about being so seriously ill so far  away from my children, and my lifelong network of friends in Pittsburgh.<br>\n<br>\nSo here I am, at home in Pittsburgh, surrounded by friends and family.<br>\n<br>\nLuckily, Tom Pigott and I have been able to arrange full and  wonderful coverage for both the Ireland tours in August.&#xA0; The wonderful  Charlie King will be joining the August 10-19th tour, and Tom will be  hosting the August 22-31st tour with some of my favorite folks in  Ireland.&#xA0; Both tours will continue uninterrupted, but, alas, without me  this year.<br>\n<br>\n<br>\nMy friend Jan Boyd has set up a Caring Bridge page for those of you  who want regular medical updates on my condition.&#xA0; The URL is <a href=\"http://www.caringbridge.org/visit/annefeeney\" style=\"color: #ad0078;\" target=\"_blank\" title=\"This external link will open in a new window\">http://www.caringbridge.org/visit/annefeeney</a> ...&#xA0; (The only reason you have to log in to the site is to keep spam robots from posting stupid messages...)<br>\n<br>\nI hope to be posting updates on Facebook as well as soon as I feel up to it.<br>\n<br>\nI'm pretty sure it will be difficult for me to talk on the phone for a  while.&#xA0; I would love it if you'd post get well wishes, stories &amp;  jokes for me on my guestbook... <a href=\"http://annefeeney.com/guestbook.html\">http://annefeeney.com/guestbook.html</a>&#xA0;  ... (It's a moderated guestbook, so what you write won't appear on the  guestbook until I read it and approve it--- otherwise I'm pretty sure  the guestbook would be nothing but ads for viagra and such..)<br>\n<br>\nThis diagnosis has wiped out most of my meager folksinger's savings.&#xA0;  I've had to cancel a lot of work that I was counting on, and incurred a  lot of unexpected travel expenses.&#xA0; Although most of my medical bills  will be covered (now that I've come up  with the $6000 in deductibles  and copay), it seems unlikely that I'll be  able to return to my hectic  tour schedule, or any full time work, for  several months.<br>\n<br>\nIf you want to help me out with what are going to be fairly  staggering expenses by folksinger's standards... I'm hoping to find 1000  folks who'll pony up $50 ...&#xA0;&#xA0; I really *don't* want any larger  donations ... I don't want anyone to dig deep for this... and if $50 is  hard for you to come by, PLEASE don't think about sending me a cent. &#xA0; I  know I have enough dear friends who are doing okay that those of you  who are struggling shouldn't spend a second worrying about my finances.<br>\n<br>\nYou could send a check to me:<br>\n<br>\nAnne Feeney<br>\n2240 Milligan Ave<br>\nPittsburgh&#xA0; PA 15218<br>\n<br>\nor you can send a donation via Paypal to getwellanne@annefeeney.com.&#xA0;  If you're not sure how to do that...&#xA0; there's also a &quot;donate&quot; button  you can click about 4 inches down on the right hand side of&#xA0; this page.. clicking on that &quot;donate&quot; button will also allow you to make a safely encrypted online donation.<br>\n<br>\n<br>\nI'll have a lot more to say and share about health care... especially  the amazing Swedish health care system, when I'm not so tired.<br>\n<br>\nI hope that you'll spread the word to any of our friends that may not subscribe to the Fellow Travelers' Advisory.<br>\n<br>\nAs I'm wandering around the sweet little house I get to spend so  little time in, I keep finding boxes and boxes of thank you cards that I  have purchased and never mailed.&#xA0; So many of you reading this are on my list of people to write and thank ... You're a generous group and there are no words to thank you for the countless things you do to make this a better world for all of us. &#xA0; My heart overflows with gratitude to  all of you for your daily work for justice, art and truth - for your  steadfast support of the many projects I've brought to you in the  past...&#xA0;&#xA0; I am so honored to call you my friend.<br>\n<br>\nMany of my oldest and dearest friends are gathering here with me at  the house to help me prepare for the coming ordeal.&#xA0; I cherish them, and  you, and hope to be in touch with all of you soon.<br>\n<br>\n<br>\n<input id=\"gwProxy\" type=\"hidden\"><!--Session data--><input id=\"jsProxy\" onclick=\"jsCall();\" type=\"hidden\"><div id=\"refHTML\"></div>\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
