{
	"date": "Sunday, August 23, 2009",
	"title": "SEPTEMBER 2009 - Anne Feeney's Fellow Travelers' Advisory - VOLUME 5, #6",
	"body": "SEPTEMBER 2009 - Anne Feeney's Fellow Travelers' Advisory - VOLUME 5, #6<br><br><br><span style=\"font-weight:bold;\">IN THIS ISSUE:<br><br><br>IMMEDIATE DESTINATIONS<br>LABOR DAY &amp; AFL-CIO COMES TO PITTSBURGH!<br>COME TO PITTSBURGH FOR THE G-20!<br>SING OUT FOR SINGLE PAYER FINANCIAL REPORT<br>FAMILY NEWS/BIRTHDAYS<br>THE TOUR<br></span><br><br>&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;&#xA7;<br><br><br><span style=\"font-weight:bold;\">IMMEDIATE DESTINATIONS:<br><br>PEORIA, IL<br>PITTSBURGH<br>CHICAGO<br>MIDWEST TOUR IN OCTOBER WITH DAVID ROVICS!<br><object height=\"344\" width=\"425\"><param name=\"movie\" value=\"//www.youtube.com/v/s4BGrNrkbMU&amp;hl=sv&amp;fs=1&amp;\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"//www.youtube.com/v/s4BGrNrkbMU&amp;hl=sv&amp;fs=1&amp;\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\"></object><br>David Rovics <a href=\"http://davidrovics.com\">http://davidrovics.com</a> is a great friend and a wonderful writer... Amy Goodman calls him &quot;the musical version of Democracy Now!&quot;  I'm thrilled to be touring the midwest with him in October.  Be sure to tell your friends to come and see us. The schedule is below.<br><br></span><br>Details for my upcoming shows appear below and continuously update at <a href=\"http://annefeeney.com/calendar.html\">http://annefeeney.com/calendar.html</a><br><br>Kopparberg, Sweden<br>August 23rd<br><br>Hi All<br><br>If you've been to any of my shows you've probably heard me quip that I have no corporate sponsorship.  It's more than a joke, though... It's absolutely and permanently true.  My work is labor of love spread by word-of-mouth ... so PLEASE spread the word. If you don't tell your friends and relations that I'm headed to their town, they probably won't find out any other way.<br><br>This is also my monthly invitation to you to stay in touch with me.  Let me know what you're up to.  If you've got something going on that would interest my readers, let me know about that, too.  If you'd like to see me perform in your hometown, or at your next event, get in touch. We'll figure out how to make it happen.<br><br>You can get my cds (and I hope that you will!) at <a href=\"http://cdbaby.com/all/unionmaid\">http://cdbaby.com/all/unionmaid</a> - you can also download single songs or whole albums there!<br><br>I'm leaving for Ireland tomorrow afternoon, so if I don't get back to you right away, be patient.<br><br>In solidarity<br><br>Anne<br><br><br><br>%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%<br><br><br>LABOR DAY<br><br><br>Monday September 7th is Labor Day in the United States.  The rest of the world honors labor on May 1st.  But we do things differently from the rest of the world.  Like our corporate-controlled health care system, we observe a corporate-controlled Labor Day weekend filled with shopportunities and blowout back-to-school sales.  And both our health and the health of the labor movement suffer as a result.  Very little goes on in the way of remembering the sacrifices and victories of the labor movement in the United States.  Unfortunately, many of the Labor Day Parades held around the country are little more than excuses to have a picnic &amp; get loaded.<br><br><br>I'm so excited to be welcoming the AFL-CIO to Pittsburgh for its national convention.  My friend Rich Trumka will assume the responsibility of leading labor through the difficult times ahead.  In a movement that celebrates great oratory  - with fantastically inspiring speakers like Cecil Roberts, RoseAnn DeMoro and Leo Gerard - Rich Trumka stands alone.  Millions of workers across the country have been encouraged, inspired and ennobled by his words.  He will be a great spokesperson for labor.  And God knows we need one.  But we need a lot more than talk.  We need bold leadership. This Labor Day I want to talk about the workers at Vincent Bach in Elkhart, Indiana.<br><br><br>Elkhart, Indiana is the brass instrument capital of North America.  If you or anyone you know ever played a tuba, trumpet, trombone or horn it was almost certainly made at Vincent Bach in Elkhart. Generations of students and professionals alike have played these quality instruments. Big band leaders regularly stopped by to visit (and jam with)  their colleagues at Vincent Bach.  Eventually the predominantly musician board of directors was replaced by profiteers and bean counters and the company sold several times.  In 2006 the company posted a $63 million profit. <br><br><br>So it was quite a shock to the workers when the company came to the table demanding dramatic pay cuts, concessions, and the end of many work rules that made working at Vincent Bach a career instead of a job.  Many of these workers are second and third generation employees.  Many had decades of service to the company when the ultimatum was presented.  The 230 member of UAW 394 voted to strike on April 1, 2006.<br><br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//1.bp.blogspot.com/_yPZWeXAMdds/SpFGAwWe2SI/AAAAAAAAAak/mxw12SsuGNs/s1600-h/conn+selmer+strike+rally.jpg\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5373152809222854946\" src=\"//1.bp.blogspot.com/_yPZWeXAMdds/SpFGAwWe2SI/AAAAAAAAAak/mxw12SsuGNs/s400/conn+selmer+strike+rally.jpg\" style=\"float:center; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 320px; height: 240px;\"></a><br>photo (c) wsbt-tv<br><br><br><br><br>The company outsourced much of its production to China.  They brought scabs into the plant.  The strikers couldn't imagine how the company could afford to train scabs to make these instruments... but the Republican governor of Indiana appropriated almost $50,000 of tax dollars from the so-called &quot;Skills Enhancement Fund&quot; specifically to subsidize the training of the scabs, as part of a $1.1 million dollar package of taxpayer subsidies to this profitable union-busting corporate bad neighbor.  The company engaged in multiple unfair labor practices, which the union filed charges on, but these take years to be adjudicated by the understaffed National Labor Relations Board. <br><br><br>In the meantime, the workers walked the picket line, and took their story to the community and to other unions. As the strike dragged on, those who could find other jobs and/or relocate did so.  The remaining 130 workers were consigned to subsisting on $200 a week strike benefits.  They were mostly folks with 20 or more years of service at Vincent Bach.  Employment prospects at their age were slim to none. They hung tough, confident that the Labor Board would side with them and they would get their jobs back. Their options were limited by a number of factors.  Unemployment in Elkhart is among the highest in the nation.  There were no other jobs, and with real estate values tanking, moving wasn't a good option either. <br><br><br>On November 7, 2007  the scabs (no doubt at the company's behest) called for an election to decertify the United Auto Workers union.  On Thursday, July 30th, 2009 an understaffed NLRB panel decertified the union, ending the strike.  Part of the reason the union lost the election is because desperate strikers who liquidated their 401 (k) plans to survive during the strike were ruled inelegible to vote in the election! After 40 months of faithfully staffing the picket line, the loyal 130 workers of Vincent Bach/Conn Selmer have no union, no jobs, no benefits, and no recourse.  That is just wrong.<br><br><br>$63 million dollars should have been enough profit for Vincent Bach.  I believe that if Vincent Bach were locally owned, it undoubtedly would have been enough profit.  Vincent Bach's profits didn't stay in Elkhart, or Indiana, and probably not even in the United States.  The people making money from the work done in Elkhart don't give a rat's ass about Elkhart, Indiana - they don't give a rat's ass about anyone but themselves. We need to regulate corporate acqusitions more closely to stop this &quot;race to the bottom.&quot; <br><br><br>The Vincent Bach plant is still operating, but the jobs there are no longer living wage jobs. Over 100 good workers left Elkhart during the strike... stranding elders, depleting the tax base, driving down property values as they sold quickly to relocate.  The overburdened taxpayers of Elkhart will face more cuts to social services, more deterioration of the infrastructure, increased demand for social services.  And Vincent Bach pays absolutely nothing in reparations for the damage they have done to this community.  This kind of tragedy has been played out countless thousands of times in the United States.  I've been an eyewitness to a lot of it. It's got to stop.<br><br><br>This Labor Day, we must commit ourselves to standing up for good, living wage jobs in this country, and around the world.  We must rein in these greedy multinational corporations that ruthlessly shift capital around the globe (often with taxpayer subsidies), pillaging the planet and exploiting the poorest, weakest and most desperate among us.  We can, and must, do better.  Our parents and grandparents missed meals, risked (and sometimes sacrificed) their lives to bring us an 8 hour day, vacations, paid sick days, pensions, seniority, safety regulations, grievance procedures and the right to organize.  These past few decades we have been spendthrift children - squandering this sacred inheritance in the name of &quot;cooperation,&quot;  &quot;flexibility&quot; and &quot;teamwork.&quot;  We must do better.  This legacy, and what we can add to it, belongs to future generations.<br><br><br>(This Labor Day message is gratefully offered in tribute to the sacrifices and devotion of the members of UAW 394 - especially Don Wagner, Deneen Siegler, Ron Czarnecki... and the workers of Boilermakers 484, AFSCME 3494, the Coalition of Immokalee Workers, United American Nurses, the Charleston Five, UE Republic Workers, UAW 174 at Hercules Drawn Steel, Local 459 OPEIU Nurses, AK Strikers, Delphi workers, Staley workers, Frontier Casino Strikers,  and millions more who have struggled against this monstrous corporate greed.)<br><br><br>And a Labor Day salute to Kay Tillow, Jerry Tucker, David Newby, Shelley Kessler, Paul Bigman, Jeff Crosby, Turner Wright, Dave Johnson, John David,  Rosemary Trump, Amy Newell, Ron Kaminkow, Barb Ingalls, Brian McWilliams, Angaza Laughinghouse, Karen Newman, Barbara Byrd, Dexter Arnold, Laura Griffin, Stan Swart, Mike Matejka, Amy Niehouse, David Elsila, Charlie McCollester, Rose Feurer, Nathanette Mayo, Judy Ancel, Robin Alexander, Henry Nicholas, Nick Molnar, Betsy Pernotto, Larry Daves,  Ed Sadlowski (the elder and the younger!) and Julius Margolin (safe journey, dear comrade) for your tireless work for working people.<br><br><br>&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;&#xA4;<br><br><br>COME TO PITTSBURGH FOR THE G-20!!<br><br><br>Looks like the first amendment isn't repealed in Pittsburgh after all!<br><br><br>Pittsburgh will be a very happening place in the month of September.  Beginning with the pre-AFL-CIO conferences on the 10th and running through the G-20 (September 24th &amp; 25th)  there will be lots of action - teach-ins, demonstrations, marches, concerts, direct action and more.<br><br><br>Thanks to a grant from the Hen Foundation, I'll be presenting some cultural activities ... Look for the Coop D'Etat logo that Julie just made for me. <br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//1.bp.blogspot.com/_yPZWeXAMdds/SpHFZR189NI/AAAAAAAAAa8/0K8xuUxwbIY/s1600-h/Annes+chicken.jpg\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5373292868506809554\" src=\"//1.bp.blogspot.com/_yPZWeXAMdds/SpHFZR189NI/AAAAAAAAAa8/0K8xuUxwbIY/s320/Annes+chicken.jpg\" style=\"float:right; margin:0 0 10px 10px;cursor:pointer; cursor:hand;width: 320px; height: 279px;\"></a><br><br><a href=\" http://www.g20media.org/sectors\"><br>http://www.g20media.org/sectors</a> is a great list of the activities planned in my hometown.  Come join us!<br><br><br>I was disgusted to see that Channel 11 has a &quot;What is the G20?&quot; story on their website and I'd bet my bottom dollar they just printed up a G20 press release and ran it as &quot;news.&quot;  What crap.  Leave them a comment at:<br><br><a href=\" http://www.wpxi.com/politics/20429438/detail.html\"><br>http://www.wpxi.com/politics/20429438/detail.html</a><br><br><br>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br><br><br>SING OUT FOR SINGLE PAYER FINANCIAL REPORT<br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//1.bp.blogspot.com/_yPZWeXAMdds/SpFaYlMH7II/AAAAAAAAAas/M2QApKL228Q/s1600-h/cbandjasonbham.jpg\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5373175208776035458\" src=\"//1.bp.blogspot.com/_yPZWeXAMdds/SpFaYlMH7II/AAAAAAAAAas/M2QApKL228Q/s400/cbandjasonbham.jpg\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 400px; height: 300px;\"></a><br>Citizens Band with Jason Luckett in Bellingham - July 27th<br><br><br><br><br><br><span style=\"font-weight:bold;\">Expenses</span><br>Payroll:        $17,000 (197 performances)<br>Rental Car:       2,825<br>Travel:             835<br>Hotels:             191<br>Meals:              984<br>Supplies:<br>  Tee Shirts      1,690<br>  Car Signs<br>  + shipping        284<br>  Office            120<br>  Sound Syst        800<br> Banner Frame        42<br> Buttons            200<br> Shipping            58<br> Fuel               522<br><span style=\"font-weight:bold;\">Total           $25,551<br></span><br><br><span style=\"font-weight:bold;\">INCOME:</span><br><br><br>Donations &amp; Grants:                                             <br>      prior to 7/1 $15,818<br><br>Los Angeles             -                                <br>LaJolla                600                              <br>Santa Cruz             500                                <br>El Cerrito             100                                 <br>Ashland              1,000                                <br>Bend                    -                                <br>Florence               300                                <br>OCF                     -<br>Corvallis               -                            <br>Coos Bay                -                                <br>Newport                150                                 <br>Yachats                200                                <br>Eugene                 300                               <br>Portland               300                            <br>McMinnville            200                              <br>Astoria                300                                 <br>Vancouver              125                               <br>Olympia               -125                               <br>Port Angeles            -                                <br>Seattle              2,145                             <br>Tacoma                  -                                <br>Bellingham             200 <br><br>Income Subtotal    $22,133  <br><br><br>post 7/1             2,253 <br><span style=\"font-weight:bold;\"><br>Total Income       $24,386</span><br><br><span style=\"font-weight:bold;\">Shortfall            1,165<br></span><br><br><br>By folk musicians' standards, this was a howling success!  To have this much fun and do this much great work and only have it cost me $1165 ... pretty fantastic.  I know that I haven't written to the folks who mailed checks to me.  I just had no time at all before I left for the tour, and I came straight to Sweden afterward.  I hope I have time to write to each of you and thank you for your generous support of this amazing Road Show. <br><br>I hear that we were instrumental in inspiring the Mad As Hell Doctors' Road Show <a href=\"http://www.madashelldoctors.com/\">http://www.madashelldoctors.com/</a>, leaving from Oregon for Washington, DC on September 8th<br><br>I hear we may have inspired a Senate campaign.<br><br>I hear we raised enough money in Portland to finance a radio advertising campaign for single payer.<br><br>I know we have more than 60 musicians traveling the country now who know how vital this issue as and they're talking about it at their shows.<br><br>I know that thousands of people took literature to educate themselves and their neighbors.<br><br>I know we raised thousands of dollars for our host communities.<br><br>It couldn't have happened without your help.  You're fantastic!<br><br>I extend my profound gratitude to all of you who made this happen...<br><br><br>&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;&#xE5;<br><br>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br><br><br>FAMILY NEWS/BIRTHDAYS<br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//3.bp.blogspot.com/_yPZWeXAMdds/SpFa7B_folI/AAAAAAAAAa0/iWCnVG5ypjc/s1600-h/faithpetric.jpg\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5373175800623243858\" src=\"//3.bp.blogspot.com/_yPZWeXAMdds/SpFa7B_folI/AAAAAAAAAa0/iWCnVG5ypjc/s400/faithpetric.jpg\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 180px; height: 240px;\"></a><br><br><br><br><br>My wonderful friend Faith Petric will be 94 on September 13th.  Many of you  already know this indefatigable &quot;Fort Knox of Folk Music.&quot;  You can watch her sing &quot;I Wanna Be a Dog&quot;  at <a href=\"//www.youtube.com/watch?v=12pW6LfQJEo\">http://www.youtube.com/watch?v=12pW6LfQJEo</a>  You can send her a birthday card at:<br><br><br><span style=\"font-weight:bold;\">Faith Petric<br>885 Clayton Stret<br>San Francisco, CA  94117</span><br><br><br>My son Dan got a nice break after studying for and taking the DC Bar Exam.  He and Monique got to go to the Greek Islands for her brother's romantic 'destination' wedding.  He keeps a terrific blog at <a href=\"http://balancingtheegg.blogspot.com/\">http://balancingtheegg.blogspot.com/</a><br><br>My long-lost cousin Debbie Metcalfe Humphrey had a great visit with my sister Kathleen in New Jersey.  It's great to be back in touch with her.<br><br>My sister and her daughter Kimberly, and Kim's son Casey have decided to come spend Christmas in Sweden with me and Julie!  I'm so excited.<br><br>And in January, Julie and I will visit Dan and Monique in Ecuador!  Cool beans.<br><br>My dear friend Julius Margolin celebrated his 93rd birthday in hospice care.  Julius was stealing every heart at the nursing home, but he wanted to go home from the nursing home.  Now he's back in his apartment in Manhattan, surrounded by friends.  He sent our pal George Mann out to buy him a sixpack the night before last.  I hope you'll make time to send him a card at:<br><br><span style=\"font-weight:bold;\"><br>Julius Margolin<br>PO BOX 697<br>New York, NY 10033</span><br><br>Birthdays - Friends<br><br>Windy Cooler-Stith, Aug 28th - Kris Deelane, Sep 12th, Faith Petric, Sep 13, 1915 - Danny Donnelly also Sep 13th - Tod Faller, Sep 14th -<br><br><br>Birthdays - Family<br><br>Jonas Engstr&#xF6;m, Aug 31 - Amy Sue Berlin, Sep 1st - Christina Mumphrey, Sep 3rd - Mary Grefenstette, Sep 11th - Mardy Weber McCahill, Sep 21st (60!) - Kay McCahill Mumphrey, Sep 25th, Charlie Warren, Sep 27 (3!)<br><br><br>&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;&#xA3;<br><br><br><br>THE TOUR<br><br><br>(<span style=\"font-weight:bold;\">always<span style=\"font-style:italic;\"></span></span> check with the contact people or call me at 412-877-6480 before heading off to the gig... I do my best to keep my schedule current at <a href=\"http://annefeeney.com/calendar.html\">http://annefeeney.com/calendar.html</a> ... but things change...)<br><br><br>Monday, September 7th, 2009 2:00 PM<br>Labor Day in Peoria!!<br>Riverfront Festival Park<br>Peoria, IL<br>n.paul9154(@)sbcglobal.net is the contact<br>Labor Day Picnic and Parade begins in front of the Fire Station on Monroe Street, and it ends at the Riverfront Festival Park. In 2008, the parade consisted of over 100 entries of various trade unions, etc. The picnic festivities run from 2 p.m. until 8 p.m. at Festival Park, and feature live music, beer garden and food vendors<br><br><br>Tuesday, September 15th, 2009 7:30 PM<br>Sing Out for Single Payer Road Show!<br>Allegheny Unitarian Universalist Church<br>416 W North Ave<br>Pittsburgh, PA 15212<br>412.877-6480<br><br><a href=\"http://www.unitedforsinglepayer.org/multimedia/Anne%20Feeney%20Concert%207-25-09-H.264%20300Kbps%20Streaming.mov\">http://www.unitedforsinglepayer.org/multimedia/Anne%20Feeney%20Concert%207-25-09-H.264%20300Kbps%20Streaming.mov</a><br>Price: $10-20 suggested<br>I'm rounding up as many members of the tour as I can to give you a sample of the fabulous show that we took from San Diego to Bellingham over 26 days in July!<br><br><br><br>Sunday, September 20th, 2009 8:00 PM<br><object height=\"344\" width=\"425\"><param name=\"movie\" value=\"//www.youtube.com/v/lPClWkEdES8&amp;hl=sv&amp;fs=1&amp;\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"//www.youtube.com/v/lPClWkEdES8&amp;hl=sv&amp;fs=1&amp;\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\"></object><br><br>Roy Zimmerman and Anne Feeney in Concert!<br>Allegheny Unitarian Universalist Church<br>416 W North Ave<br>Pittsburgh, PA 15212<br>412.877-6480<br><a href=\"http://royzimmerman.com\">http://royzimmerman.com</a><br>Price: $10-20 suggested<br>Join me as I welcome the pre-eminent political satirist of our time to Pittsburgh. Roy is the author of &quot;Defenders of Marriage,&quot; &quot;Creation Science 101,&quot; and dozens of other hard-hitting and hilarious songs. Don't miss this show! Come after the huge march for jobs!<br><br><br>Wednesday, September 30th, 2009 8:00 PM<br>IBEW conference<br>Adams Mark Holiday Inn<br>Chicago, IL<br>Price: members only<br>darlene johnson is the contact... 630-434-1683<br><br><br>Friday, October 2nd, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>details tba<br>Chicago, IL<br><br><br>Saturday, October 3rd, 2009 6:00 PM<br>Eugene Debs Annual Award Dinner<br>Indiana State University<br>Terre Haute, IN<br><a href=\"http://eugenevdebs.com/pages/announ.htm\">http://eugenevdebs.com/pages/announ.htm</a><br><br><br>Sunday, October 4th, 2009 10:30 AM<br>Anne Feeney and David Rovics at UU Service<br>Tentative - All Souls<br>Indianapolis, IN<br><br><br>Sunday, October 4th, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert<br>probably at the IMC<br>Champaign, IL<br>jrbarret@uiuc.edu is the contact<br><br><br>Monday, October 5th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tentative<br>Bloomington/Normal, IL<br>mike matejka is the contact<br><br><br>Tuesday, October 6th, 2009 8:00 PM<br>Anne Feeney and David Rovics on Campus and in Concert<br>Western Illinois University (tentative)<br>Macomb, IL<br>lj-barr(@)wiu.edu Lisa Barr is the contact<br><br><br>Wednesday, October 7th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba<br>Quad Cities area<br>Chris Dunn is the contact crisplydone(@)hotmail.com<br><br><br>Thursday, October 8th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba<br>Dubuque, IA<br>(563) 584-9300<br>for more information contact Art Roche rocheart3@msn.com or phone Mary Moody at the number above.<br><br><br>Friday, October 9th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tentative<br>Des Moines, IA<br><br><br>Saturday, October 10th, 2009 8:00 PM<br>Anne Feeney and David Rovics<br>The Art Center<br>228 East Fifth Street<br>Winona, MN 55987<br>507-453-9959<br>Price: $15 suggested<br>Polly Gower is the contact pollygower(@)hotmail.com<br><br><br>Sunday, October 11th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba<br>Minneapolis, MN<br>Colleen Rowley<br>rowleyclan(@)earthlink.net and Larry<br>Olds 612-722-3442, lolds(@)popednews.org are the contacts...<br><br><br>Monday, October 12th, 2009 8:00 AM<br>Anne Feeney<br>Women's Breakfast or Lunch (tentative)<br>Minneapolis, MN<br><br><br>Tuesday, October 13th, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert<br>Goodman Center<br>Madison , WI<br>matt and john peck are working on this show<br><br><br>Wednesday, October 14th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba<br>Rockford, IL<br>David Stocker is the contact<br><br><br>Thursday, October 15th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba<br>DeKalb , IL<br>td0raf1(@)wpo.cso.niu.edu Rose Feurer is the contact<br><br><br>Friday, October 16th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba - University of Indiana<br>Indianapolis, IN<br>Greta Pennell gpennell@uindy.edu is the contact<br><br><br>Saturday, October 17th, 2009 8:00 PM<br>Anne Feeney and David Rovics on Tour in the Midwest<br>AVAILABLE<br>call me at 412-877-6480 or email me at anne@annefeeney.com if you have any ideas for this lovely Saturday night!<br><br><br>Sunday, October 18th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba<br>Lafayette, IN<br>Harry Targ targ@purdue.edu is the contact<br><br><br>Tuesday, October 20th, 2009 7:00 PM<br>David Rovics and Anne Feeney in Concert<br>tba<br>Columbus, OH<br>bruce bostick and victoria parks are looking into this date for us!<br><br><br>Wednesday, October 21st, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba<br>Cincinnati, OH<br>mfwood(@)fuse.net Maureen Wood is the contact<br><br><br>Thursday, October 22nd, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba<br>Lexington, KY<br>Janet Tucker is the contact...<br><br><br>Friday, October 23rd, 2009 7:00 PM<br>Anne Feeney and David Rovics in Concert<br>St John's Day Center<br>700 E Muhammad Ali Blvd<br>Louisville, KY 40202<br>dos4@insightbb.com - for more information<br><br><br>Saturday, October 24th, 2009 8:00 PM<br>Anne Feeney and David Rovics<br>Charleston, WV<br>plantandgnome(@)verizon.net - Chris Higgins is the contact<br><br><br>Sunday, October 25th, 2009 10:00 AM<br>Unitarian Universalist Congregation<br>520 Kanawha Blvd W<br>Charleston, WV<br>304-345-5042<br>Price: all welcome<br>chris@plantandgnome is the host<br><br><br>Sunday, October 25th, 2009 8:00 PM<br>Anne Feeney and David Rovics in Concert<br>tba<br>Pittsburgh, PA<br>any ideas, folks?<br><br><br><br><br>Anne Feeney<br>http://annefeeney.com<br>http://cdbaby.com/all/unionmaid - Buy CDs!<br>412-877-6480 (cell)<br><br><br>&quot;Anne Feeney is the greatest labor singer in North America.&quot; -- Utah Phillips\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
