{
	"date": "Sunday, May 29, 2005",
	"title": "Help Gokal and Shiela get out of detention",
	"body": "<a href=\"http://www.stopdetention.org/\">Help Gokal and Shiela get out of detention</a><br><br>Please click on this link to send a fax to Virginia Senators Allen and Warner ... the rest of the text below explains a little about the ordeal this family is going through...<br><br><strong>Please help our family! </strong><br>On June 22, 2005 -- the day of their son's graduation from high school -- there was a knock on my Uncle Gokal and Aunt Shiela's door. Several uniformed officers were outside, and told my cousin they needed to bring his parents in for questioning, and that they would bring them back in just a few hours. <br>A week later, our family members languish in a detention center in northern Virginia. No one knows why they are in detention. They are in their 70s, and in failing health. They are truly kind and gentle people, and have done nothing wrong. We have been told nothing about why they are there and when or if they'll get out. They have not been charged with anything. We are extremely concerned about their health and their ability to deal with the harsh conditions of the detention facility. <br><br>After experiencing religious persecution in Afghanistan, Gokal and Shiela, who are from a small religious minority, applied for asylum in the United States almost a decade ago. They did everything right - obtaining work permits, paying their taxes, and enrolling their son in one of the best school districts in Virginia. Gokal and Shiela began working at an age when most Americans would retire, so they could provide for their only son. They worked, lived, and settled into a community full of family and friends who cared for them, loved them and supported them, and lived quiet lives, following all the rules of their new country. We want them back with us, safe and sound!\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
