{
	"date": "Thursday, November 30, 2006",
	"title": "Fellow Travelers' Advisory from Anne Feeney - DECEMBER 2006, VOLUME TWO, #9",
	"body": "<a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/x/blogger/5548/167/1600/614816/PC020958.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/x/blogger/5548/167/320/607083/PC020958.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><br><br><br><br>Fellow Travelers' Advisory from Anne Feeney - DECEMBER 2006, VOLUME TWO, #9<br><br><br>IMMEDIATE DESTINATIONS:<br><br><br><br>US LABOR AGAINST THE WAR IN CLEVELAND WITH CINDY SHEEHAN!<br>PITTSBURGH READING OF JERRY STARR'S NEW PLAY ABOUT SAGO<br>JOE GLAZER TRIBUTE CONCERTS IN WASHINGTON, DC<br>details at the <a href=\"http://annefeeney.com/calendar.html\">tourdates page</a><br><br><br>JAN-FEB - CA, OR, WA &amp; BC<br>FEBRUARY - TEXAS!!<br><br>*******************************************<br><br>If this was forwarded to you, you can subscribe by going to http://annefeeney.com/newsletter.html - If you've changed your mind and need to unsubscribe, click on the link at the bottom of this email<br><br>You can also read this with live links and photos at http://fellow-travelers-advisory.blogspot.com/<br><br>Order CDs at http://cdbaby.com/all/unionmaid<br><br>********************************************<br>IN THIS ISSUE:<br><br>HOLIDAY GREETINGS<br>NORTHWEST TOUR<br>TEXAS IN FEBRUARY<br>NOW AVAILABLE IN UK<br>A GOOD LAUGH FROM PEGGY SEEGER<br><br>********************************************<br><br>Hi Folks --<br><br>Now that &quot;Buy Nothing Day&quot; is over, I'm sure that some of you are looking for unique holiday gifts. I hope you'll stop by <a href=\"http://cdbaby.com/all/unionmaid\">CDBaby</a> and stuff some stockings with my CDs. I've replenished CDBaby's inventory of Have You Been to Jail for Justice?, Union Maid, and If I Can't Dance ... and you can also get the Wild Wimmin for Peace CD, Heartland, Vote in November, Look to the Left, and the last three copies of Live from the Wholly Stolen Empire.<br><br>AND I've got ten of those hand-cranked Swedish music boxes that play &quot;The Internationale.&quot; You can order them directly from me. Email me at anne@annefeeney.com if you want one... They're $50 + $5 shipping/handling. If CDBaby sells out, I'll also be doing CD sales directly from the house during December... just email me.<br><br>I'll be leaving tomorrow for the US Labor Against the War national conference in Cleveland, and I'm very excited to finally be meeting Cindy Sheehan.<br><br> <br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/x/blogger/5548/167/1600/169974/PC021004.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/x/blogger/5548/167/320/511545/PC021004.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><br><br>(We meet at last!! Cindy and I wearing our &quot;Jail for Justice&quot; Tee Shirts from Will Covert)<br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"//photos1.blogger.com/x/blogger/5548/167/1600/648331/PC020992.jpg\"><img alt border=\"0\" src=\"//photos1.blogger.com/x/blogger/5548/167/320/134091/PC020992.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><br><br><br><br><br><br><br><br>thanks to Patrick Carano for the photos!<br><br><br><br><br><br>I'll be doing a year-in-review Fellow Travelers' Advisory at the end of December, but for now I'll say that my trips to Canada, New England and Florida were very wonderful. Gary and Pauline O'Dwyer were spectacular hosts in Cobourg - and getting so much quality time with Eric LeCompte, Kathy Kelly and Stephanie Schaudel was energizing. Stan Swart, Candice Carter and Ken and Cee Cee made the Florida visit a joy. And all my New England hosts were terrific - love and thanks to Guy and Lorraine, Margi, Greg, Gail and David, Paul, Robyn, Geoff, Stan and Joanna............<br><br><br>On Monday night, Dec 4th, my friend Jerry Starr debuts his new play, BURIED: the story of the Sago Mine Disaster in a standing-room-only reading at Pittsburgh Playwrights. Directed by the amazing Marci Wood, the play features an all-star cast and music by me and Sue Powers. The reading will be filmed in the hope of finding funding for full-scale productions in 2007.<br><br>This was a challenging year. This is the first year that I bought more sympathy cards than birthday cards. Both my mother-in-law and father-in-law died this year in Sweden. I'm mourning the loss of so many friends this year, as well as my generous mentor, Joe Glazer, my beloved Kerrville camping companero Blair Powell, and especially my longtime performing partner and dear friend, DC Fitzgerald.<br><br>As this holiday season approaches, I hope you're surrounded by family and friends. I'm hoping to have both my kids and my husband here in Pittsburgh for the holidays.<br><br>Keep the folks of Oaxaca in your thoughts and prayers.<br><br>I look forward to seeing you in 2007, and thank you from the bottom of my heart for all the kindness and generosity you have shown me. We'll have plenty of work to do next year, so take a little time off now to enjoy each other and relax!<br><br>Peace on earth,<br><br>Anne<br><br>********************************************<br><br>NORTHWEST (&amp; CANADIAN SOUTHWEST) TOUR - JAN &amp; FEB 2007<br><br>Still quite a few dates left to fill... If you live in between Watsonville, CA and Vancouver, BC - please visit my calendar at <a href=\"http://annefeeney.com/calendar.html\">http://annefeeney.com/calendar.html</a> to check availability, and then email me at anne@annefeeney.com to arrange a fill in date on this tour...<br><br>********************************************<br><br><br>TEXAS IN FEBRUARY<br><br>I'd like to tour in Texas between February 8th and 23rd... If you'd like to see me perform in Houston, Dallas, Fort Worth, College Station, Austin, or points in between please talk to me - 412.877.6480 or email me - anne@annefeeney.com -- Folk clubs, rallies, riots, conferences, classrooms and of course UU congregations... and house concerts, too! If you'd like to host a house concert, I'll tell you how...<br><br><br><br>********************************************<br>NOW!! ORDER MY MUSIC IN THE UK!<br><br>Four Dogs Music is a new UK music site operated by Ethical Wares and featuring great music from all over the world... including mine! If you're across the pond, order from Four Dogs for prompt delivery.<br><br>Vist <a href=\"http://www.fourdogsmusic.co.uk/_S_167_by-artists-name/#alphaF\">Four Dogs Music</a><br><br>********************************************<br>A GOOD LAUGH FORWARDED TO ME FROM PEGGY SEEGER:<br><br>(Peggy's always sending me hilarious and/or informative emails... This one made me laugh out loud...enjoy!)<br><br>It takes a college degree to fly a plane but only a high school diploma to fix one: a reassurance for those of us who fly routinely in our jobs.<br><br>After every flight, Qantas pilots fill out a form, called a &quot;gripe sheet,&quot; which tells mechanics about problems with the aircraft. The mechanics correct the problems; document their repairs on the form, and then pilots review the gripe sheets before the next flight.<br><br>Never let it be said that ground crews lack a sense of humour. Here are some maintenance complaints submitted by Qantas Pilots (marked with a P) and the Solutions Recorded (marked with an S) by Maintenance Engineers.<br><br>(By the way, Qantas is the only major airline that has never had an accident)<br>-----------------------------------------------------------------------<br><br>P: Left inside main tyre almost needs replacement.<br>S: Almost replaced left inside main tyre.<br><br>P: Test flight OK, except auto-land very rough.<br>S: Auto-land not installed on this aircraft.<br><br>P: Something loose in cockpit.<br>S: Something tightened in cockpit.<br><br>P: Dead bugs on windshield.<br>S: Live bugs on order.<br><br>P: Autopilot in altitude-hold mode produces a 200-feet per minute descent.<br>S: Cannot reproduce problem on ground.<br><br>P: Evidence of leak on right main landing gear.<br>S: Evidence removed.<br><br>P: DME volume unbelievably loud.<br>S: DME volume set to more believable level.<br><br>P: Friction locks cause throttle levers to stick.<br>S: That's what they're for.<br><br>P: IFF inoperative.<br>S: IFF always inoperative in OFF mode.<br><br>P: Suspected crack in windshield.<br>S: Suspect you're right.<br><br>P: Number 3 engine missing.<br>S: Engine found on right wing after brief search.<br><br>P: Aircraft handles funny.<br>S: Aircraft warned to straighten up, fly right, and be serious.<br><br><br>P: Target radar hums.<br>S: Reprogrammed target radar with lyrics.<br><br>P: Mouse in cockpit.<br>S: Cat installed.<br><br><br>P: Noise coming from under instrument panel. Sounds like a midget pounding on something with a hammer.<br>S: Took hammer away from midget<br><br><br>********************************************<br><br>Merry Christmas, Happy Hanukkah, Joyous Solstice, Festive Kwanzaa --- however you're celebrating, I wish you all the best and thank you so much for your friendship and love and support!\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
