{
	"date": "Thursday, November 06, 2008",
	"title": "SPECIAL READING OF BURIED: THE SAGO MINE DISASTER",
	"body": "SPECIAL READING OF BURIED: THE SAGO MINE DISASTER <br><br> <br><br>Jerry Starr has been passionate about theatre and human rights all of his life. In 2006, he wrote BURIED: THE SAGO MINE DISASTER to illuminate the costs to worker health and safety of corporate greed unrestrained by government public interest regulation. BURIED is not a political screed, but an intimate portrait of the victims, survivors, corporate and government officials involved in the event in their very own words, as taken from hearings and interviews. It makes matters of life, death and grief personal in ways that are poignant, educational, and even amusing. BURIED was produced to excellent reviews in San Diego in 2007 and IUP in 2008.<br><br> <br><br>In September, Jerry, 67 years old, although a nonsmoker, was advised that he had stage four lung, brain and spine cancer with only months to live. He shared this with his theatre friends, director Marci Woodruff and Mark Clayton Southers, Executive Director of the Pittsburgh Playwrights Theatre Company where Jerry had served as Managing Director. As a tribute, Mark decided to produce a staged-reading of BURIED on November 9 (8 pm) at the CLO Cabaret (Theatre District in the Cultural District.)  <br><br> <br><br>My friend Marci Woodruff has agreed to direct BURIED. For Jerry's support, Marci recommended the Cancer Caring Center, an organization that had helped her and so many others in this community deal with this dreaded disease. So, the proceeds from BURIED are dedicated to support the excellent work of the Cancer Caring Center.  <br><br> <br><br>Actors donating their time and talent include Doug Mertz, Karen Baum, Bruce Hill, Debra Gordon and Ken Boldon. Fabulous music will be provided by Jack Erdie and Sue Powers. A suggested donation of $25 includes a post-show reception and can be made through the Center at 412-622-1212 or info@cancercaring.org .<br><br> <br><br>The Cancer Caring Center is a local charity that has been providing free emotional support services to cancer patients and families since 1988.\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
