{
	"date": "Thursday, May 13, 2004",
	"title": "Were you in SEATTLE in 1999 at the WTO Protests?",
	"body": "Do you know someone who was?\n<br>Were you arrested?\n<br>Do you know someone who was???? Or someone who knows someone who....?\n<br>\n<br>There has been a victory from a class action lawsuit and those involved need to take action now!!!! PLEASE READ the message below and use your networks to get this message out. AND join us in celebrating this victory!\n<br>\n<br>Please help get information out to folks arrested in the afternoon of Dec 1 1999 at 1st &amp; Broad during the WTO protests in Seattle.\n<br>\n<br>As the attorneys explain below, the judge agreed to the settlement so now people must TURN IN THEIR PAPERWORK BY JUNE 22nd to be included in the class and receive the $$ they are due. It's no longer just a possibility, this is happening and the time frame is short so please help now.\n<br>\n<br>Yes, NOW is the time to work those networks to get this information out to folks who might be out of the loop. This is no small task and the attorneys can only do so much:\n<br>We know folks.\n<br>We have websites on which we can post announcements that arrestees might see (hint hint)\n<br>We have the networks and, without them, many will never know that the city settled their case ...\n<br>\n<br>LET'S USE THESE NETWORKS TO GET THE WORD OUT.\n<br>TELL FOLKS TO CONTACT the attorneys (info below) so they can send them forms to complete. NOW is the time to do it since they will only have until JUNE 22nd to return the forms.\n<br>\n<br>Wouldn't it be great is we could get everyone arrested at 1st &amp; Broad to participate!!!! What a great message that would send.\n<br>\n<br>It would also be great if folks would cc me their information so I can reach them better next time, but my own request and isn't a part of the legal stuff directly ....it's up to them if they want to get my occasional emails about this stuff.\n<br>... AND anyone arrested during WTO but not at this location should also get their current info to me so we can reach them better if the other case ever gets resolved.\n<br>\n<br>In solidarity,\n<br>Erica\n<br>Jane WTO #890\n<br>can@drizzle.com\n<br>206-568-7110\n<br>\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
