{
	"date": "Thursday, November 24, 2005",
	"title": "Fellow Travelers' Advisory from Anne Feeney - DECEMBER 2005: VOLUME ONE, #9",
	"body": "Fellow Travelers' Advisory from Anne Feeney - DECEMBER 2005: VOLUME ONE, #9 <br><br>IN THIS ISSUE:<br>Immediate Destinations<br>Holiday Sale<br>Thanksgiving Message<br>Email McDonald's<br>Remember Boilermakers' 484<br>Hoyas<br>Family News <br><br>IMMEDIATE DESTINATIONS: Stockholm, Oaxaca, Lund, Copenhagen, Austin, Houston, San Antonio, Denton, Fort Worth, Dallas, Tucson. Booking: Texas (Feb) &amp; Florida (March)<br><br>HOLIDAY SALE!! This year you can give my critically acclaimed recordings Union Maid, Have You Been to Jail for Justice? and the inspiring recording of Wild Wimmin from The Great Peace March to your friends and relatives at discounted prices at <a href=\"http://cdbaby.com/all/unionmaid\">CDBaby</a> -  - You'll also find Look to Left on sale for $9.99 and my 1994 live album, Heartland, on sale for only $5!! You can also find more music you'll love in my <a href=\"http://cdbaby.com/group/annespicks\">gallery</a>. Supporting independent artists is a unique way to express yourself this holiday season. Thanks to all of you for your ongoing support of my music!<br><br><br><br>THANKSGIVING DAY 2005<br>Smedjebacken, Sweden<br><br>It's always strange to be in Sweden on Thanksgiving. Needless to say, Thanksgiving is a non-event here. This is the third time I've been here on Thanksgiving day. It does help me to realize that the US is not the center of the universe. This Thanksgiving Day, I'm grateful to have love in my life, to have such wonderful children, to have such a large loving extended family, to have work that I love, and to have so many talented and inspiring friends out there working every day to effect positive change in the world. And I'm very grateful to you - you've brought me to your towns, given me a place to stay, bought me a meal, bought my music, made contributions to locked out workers in Illinois and Michigan, signed petitions and postcards, and signed up to receive the Fellow Travelers' Advisory! Thank you!!<br><br>I'm thankful we were able to forestall drilling in the Arctic National Wildlife Reserve. I'll be even more thankful if this corrupt regime is exposed for the anti-democratic corporatist cronies that they are.<br><br>This past weekend I was in Columbus, Georgia again for the School of the Americas Watch vigil. If you don't know about this terrorist training camp in Georgia, please visit their <a href=\"http://soaw.org\">website</a>. This year more than 20,000 came to hold a powerful vigil for the hundreds of thousands of people murdered by graduates of the School of the Americas in Guatemala, El Salvador, Panama, Venezuela and right now, every day, in Colombia. About forty people committed acts of civil disobedience over the weekend and will go to jail for justice. Four of them are already in jail. You can write to them at:<br><br>Christine Gaunt, Muscogee County Jail, 700 E. 10th St., Columbus GA 31901-2899<br><br>Louis Vitale, Muscogee County Jail, 700 E. 10th St., Columbus GA 31901-2899<br><br>Priscilla Treska, Muscogee County Jail, 700 E. 10th St., Columbus GA 31901-2899<br><br>Jerome Zawada, Muscogee County Jail, 700 E. 10th St., Columbus GA 31901-2899<br><br>SUPPORT THE COALITION OF IMMOKALEE WORKERS - WRITE MC DONALD'S<br><br>This Thanksgiving season, when we traditionally celebrate the harvest, let us also celebrate the harvesters. Join the CIW in calling on the world's largest restaurant chain, McDonald's to stop dragging its feet and to work with the CIW to improve the wages and working conditions for the men and women who pick its tomatoes. <br><br><a href=\"http://www.unionvoice.org/campaign/mcdonalds/\">Contact McDonald's today</a> and demand they, too, pay a fair price for their tomatoes and work with the CIW to end human rights violations in the fields! <br><br>You can also call 630-623-3000 (ask operator for Social Responsibility department), fax 630-623-7409, and <a href=\"http://www.mcdonalds.com/app_controller.custsat.custsat_form_social.html\">fill out an online form</a> <br><br><br>BOILERMAKERS' 484 STILL LOCKED OUT<br><br>Your generous contributions can make the holidays brighter for 156 families still locked out by Celanese Corporation in Meredosia, IL<br><br><a href=\"http://www.lockout484.org/\">Read about the lockout</a> and <a href=\"https://secure.unasecure.net/activedonation/index.cfm?siteID=boilermakers484\"><br>donate online</a> <br><br>or by mail to:<br><br>Boilermakers Local 484 Solidarity/Defense Fund, <br>P.O. Box258<br>300 Main Street<br>Meredosia, IL 62665<br><br>HOYAS<br><br>Thanks to Mary Cliff at WETA and my cousin Kevin McCahill for being the first to correctly answer the Hoya question -- (If you're just tuning in, the question was - What in the heck is a Hoya? - as in the Georgetown University Hoyas)<br><br>and the answer is.......(drum roll)<br><br>Many years ago, students well-versed in the classical languages invented the mixed Greek and Latin chant of &quot;Hoya Saxa,&quot; translating roughly as &quot;What Rocks!&quot; in reference to both the stalwart defense of the football team and the stone wall that surrounded the campus. 'Hoia' is Greek for 'what' or 'what a,' and 'saxa' is Latin for 'rocks.'<br><br>FAMILY NEWS<br><br>Cousin Kevin Metcalfe is in the pink following bypass surgery at the VA Hospital in Pittsburgh... sister Maureen flew in from AZ to help out. Bill Feeney and I missed seeing cousin Pat Metcalfe on our get well visit to the hospital.<br><br>Terry McCahill is recovering splendidly from abdominal surgery in St Augustine. I was in Jacksonville a few weeks ago &amp; went to St Augustine to visit cousins Joe &amp; Rhonda McCahill. Got a glimpse of their handsome offspring, Jon Christian and Justin... then we headed over to Ed &amp; Terry's place for a sumptuous dinner, hugs from Ryan and Collin, hot tub and marathon hootenanny poolside. It was such fun to sing all the old songs. Joe McCahill was the first person I ever saw play a guitar up close... It was on a family vacation to Deep Creek Lake - I was hooked.<br><br>That was indeed my song that Peter, Paul and Mary were featured singing in Get Up, Stand Up - the PBS documentary on protest music that aired in many cities last month.<br><br>Kimberly Sever has been skating for the past season with the &quot;Manhattan Mayhem&quot; - a for-real Roller Derby Team -- Check out this <a href=\"http://www.gothamgirlsrollerderby.com/photos/slideshow.php?set_albumName=album22\">wonderful slide show</a> of their last game with the Queens of Pain.<br><br>Kim's son Casey is the mascot of the Manhattan Mayhem... you'll see him in his &quot;Jail Bait&quot; uniform in the slide show. Kim is also featured this month in the <a href=\"http://www.gothamgirlsrollerderby.com/features/\">&quot;Ask a Gotham Girl&quot;</a> section. <br><br>Dan Berlin finished the <a href=\"http://active.doitsports.com/mcm/?event=&amp;posted_p=t&amp;refresh=3600&amp;bib_list=&amp;bib=&amp;last_name=berlin&amp;first_names=daniel&amp;x=0&amp;y=0\">Washington Marine Marathon</a> in 3 hours and 58 minutes - He finished 3100 out of 19211 total finishers - 2405 out of 11699 men in the race. Cool beans!  You can email congrats at danielfberlin @ hotmail.com ...<br><br>Dan should have beautiful organic cotton tee shirts for sale any minute now as a fundraiser for his new NGO, PARCA - to bring urgently needed supplies to the village he worked in while he was in the Peace Corps in Guatemala. It was devastated during the mudslides and supplies are still only being brought in by helicopter. <br><br>I don't remember all the details of Big D's recent golf triumph at the Naval Academy, but read up on cousin-in-law <a href=\"http://www.pga.com/tournaments/money-leaders/pga_money_leaders.cfm\">Charles Warren's</a> adventures (he's married to Kelly Grefenstette) -- scroll down to about #77.<br><br>It was great to see Jill Weldon and Steve Merrill at the <a href=\"http://fellow-travelers-advisory.blogspot.com/2005/11/house-concert-at-jim-llouises-pat.html\">concert</a> I produced at Jim and Llouise's last month. Steve's getting ready to retire!<br><br>That's all for now.  To subscribe, please click <a href=\"http://annefeeney.com/newsletter.html\">here</a>\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
