{
	"date": "Thursday, November 02, 2006",
	"title": "Fellow Travelers' Advisory from Anne Feeney - NOVEMBER 2006, VOLUME TWO, #8",
	"body": "Fellow Travelers' Advisory from Anne Feeney - NOVEMBER 2006, VOLUME TWO, #8<br><br>IMMEDIATE DESTINATIONS:<br><br>Youngstown, OH<br>Cobourg, ON<br>Kingston, RI<br>Florence, MA<br>Berlin, MA<br>Northampton, MA<br>Cambridge, MA<br>Albany, NY<br>Fort Benning, GA<br>Jacksonville, FL<br>Cleveland, OH<br>Washington, DC<br><br>I've got my ticket to the Northwest: arriving San Francisco on 11 January, departing Seattle on 5 February... If you'd like to book a show then, email me at anne@annefeeney.com<br><br>*******************************************<br><br>If this was forwarded to you, or you're reading it on my blog, you can subscribe by going to <a href=\"http://annefeeney.com/newsletter.html\">my website</a> and signing up! <br><br>Order CDs at <a href=\"http://cdbaby.com/all/unionmaid\">CDBaby</a><br><br>********************************************<br>IN THIS ISSUE:<br><br>DID YOU KNOW&#x2026;?<br>SAVE OAXACA<br>MIDDLE OF THE NIGHT RUMINATIONS<br>FAMILY NEWS<br>LINK<br>TOUR DATES<br><br>********************************************<br><br>DID YOU KNOW that....<br><br>1) almost all of my music is downloadable at most online stores, including iTunes, Yahoo music, AOL and many many more?<br><br>2) My recording of &quot;We Just Come to Work Here, We Don't Come to Die&quot; is included in the recently released &quot;Classic Labor Songs&quot; from Smithsonian Folkways CD -- Featuring Paul Robeson, Joe Glazer, Woody Guthrie, Hazel Dickens, Pete Seeger, John Handcox, and many more ... order it from <a href=\"www.laborheritage.org/music4.html\">Labor Heritage Foundation</a> <br><br>3) My recording of &quot;Defenders of Marriage&quot; is featured on the new anthology &quot;Hail to the Thieves III&quot; - which includes 19 other songs &quot;to take back our country&quot; by Billy Bragg, Utah Phillips, Chuck Brodsky, Steve Brooks, Colleen Kattau, Jolie Rickman, Jon Fromer, the DC Labor Chorus, Pat Wynne, Francisco Herrera, Evan Greer, Girlyman, Graham and Barbara Dean, John Lilly, George Mann and Julius Margolin.  You can order it at <a href=\"http://cdbaby.com/cd/gmjmaf2\">CDBaby</a><br><br>4) you can review CDs on CDBaby and Amazon? ... why not <a href=\"http://cdbaby.com/review/annefeeney6\">write a review of my newest CD</a>- &quot;IF I CAN'T DANCE&quot;  ...Here's a sample of the reviews of the new CD, which you can buy at <a href=\"http://cdbaby.com/cd/annefeeney6\">CDBaby</a>  <br><br>***** -- Great songs, great arrangements, great singing... Reviewer: Dennis Pearne   <br>Anne sings with all the joy and gusto of a true, dancing revolutionary. She is rare in her bare honesty. Her musicality is beyond reproach. I have to say that lots of times I don't get past the seventh cut, &quot;Let Their Heads Roll,&quot; because it's so good, and she performs is so perfectly, I put the CD player on &quot;repeat&quot; for a while. I'm sure I'll cover it, though it will be a challenge, given her fabulous rendition.<br><br>***** -- Anne Feeney is one of my favourite performers &#x2013; <br>Reviewer: kozima1848@aol.com<br>I have seen her LIVE several times and she never ceases to amaze. I will recommend this CD to all my friends on the left.<br><br>***** -- I loved it - Reviewer: Craig<br>It is a very good CD. Every song on the CD is enjoyable. I would recommend this to others. Gets an A in my book!<br><br>***** -- You'll be singing, dancing, and thinking - Reviewer: Larry Orr<br>I heard songs from this CD in concert in Tucson, bought it immediately, and love it! You'll have to dance with Emma Goldman, you'll want to sing along on &#x201C;Who's the Criminal,&#x201D; and you're going to be remembering and thinking about the songs for a long <br>time. The tribute to Rosa Parks (My Feet Are Tired) is the kind of song I thought no one sang any more, with lots of message, and oh, so much music. Anne, you're a knockout on this CD, a great singer with a sharp sense of humor and justice, and a fine touch in selecting songs. This CD is hard-hitting politically and terrifically musical. Get it, play it for yourself and your friends!<br><br>5) now you can pre-order or donate toward the new CD, &quot;Dump the Bosses Off Your Back,&quot;  using Paypal, VISA or MC finding the DONATE button on <a href=\"http://fellow-travelers-advisory.blogspot.com/\">my blog</a> or <a href=\"http://home.earthlink.net/~unionmaid\">my Earthlink site</a>,  or <a href=\"http://myspace.com/annefeeneyreally\">Myspace</a>  -- I'm still about $11,000 away from finishing it, but it will happen!<br><br>6) You could be the 100,000th visitor to my website if you hurry!  Kudos and hearty thanks to hardworking UBC member and talented web designer Dave Livingston of Nelson, BC for the terrific job he does maintaining my website.  Thanks to everyone who has visited <a href=\"http://annefeeney.com\">my website</a> in the last two years ... especially those of you who left a message in the guestbook or signed up for the newsletter.<br><br>************************************************************************<br>SAVE OAXACA!!<br><br>For more news on the Oaxaca teachers' struggle, check out <a href=\"http://www.corrugate.org/blog \">http://www.corrugate.org/blog </a> or <a href=\"http://www.narconews.com/\">http://www.narconews.com/</a>  and send a letter to President Vicente Fox of Mexico --<br><br>vicente.fox.quesada@presidencia.gob.mx <br><br>Sample letter (please write your own)<br><br><br>Dear President Fox:<br><br>For months we have been worried about the massing of repressive force threatening the teachers union and APPO in Oaxaca by state authorities of Governor Ulysses Ruiz. Now it appears they have begun the repression against people operating radio station Planton and shooting at people in the plaza. Newspapers are reporting that primary school teacher Emilio Alonso was gunned down and that Indymedia reporter Brad Will was shot in the chest and killed in the municipality of Calicante and a photographer Oswaldo Ramirez was shot and wounded. There are rumors that other teachers have been shot and killed and that there are many injured.<br><br>Is your government planning to repeat the shame of the massacre at Tlatelolco in 1968, which people around the world still remember? We are watching with alarm. We urge you in the strongest terms to stop the repression and violence against the people of Oaxaca and the teachers union. You must use your power to stop Governor Ruiz from committing a massacre.<br><br>********************************************<br><br><br>MIDDLE OF THE NIGHT<br><br>It's way too late at night for me to be prudently pondering world affairs... I don't know if it's the jetlag and time-zone shifting, or the endless barrage of death and sadness that shrouds our country right now, but I've been waking up a lot in the middle of the night.<br><br>I read an interesting article a while back that contended that mental illness skyrocketed in Great Britain when conservatives were in power. If my memory serves me correctly, the author maintained that the perceived mean-spiritedness of the many social safety net cutbacks that accompany conservative governments, as well as the actual decline in available services to the vulnerable, was responsible for the escalated instances of depression, paranoia and suicide.<br><br>How do you suppose that translates in the United States, where FOX news has a &quot;terror alert&quot; icon visible throughout most of its broadcast day? ... where we're told the threat is ubiquitous?  that we are to be vigilant reporting anything suspicious to the government?  what do you suppose happens to people on the edge of paranoid schizophrenia at times like that? add to the mix tens of millions of Americans with no health insurance, and millions more with no coverage for mental illness... and  public health agencies that are being slowly destroyed by hiring freezes and layoffs... as my friend John Handcox observed,  &quot;There's mean things happenin' in this land.&quot;<br><br>We constantly hear politicians reciting the mantra that this is the greatest country in the world.  There are concrete ways of measuring that claim.  The &quot;greatest country in the world&quot; shouldn't be 45th in infant mortality, have a higher illiteracy rate than Cuba, have the largest gap between productivity and wages, send 20% of its children to bed hungry every night.<br><br>I think of Alyssa Peterson, the idealistic 27 year old woman who enlisted in the Army to serve as a translator.  She actually arranged to switch places with someone who didn't want to be sent to Iraq.  After several &quot;harsh&quot; interrogations in &quot;the cage,&quot; where she served as translator, this young woman apparently turned her rifle on herself, becoming the third female soldier to die in Iraq.<br><br>I think of the woman who sold me my movie ticket tonight... she was well into her seventies.  The man who collected my ticket admitted to being 85.  What happened to those so-called &quot;golden years&quot;?  How many of our elders are out working to keep up <br>with the cost of prescription drugs and medicare supplements? Keep your eyes open.  I see men and women well into their 70's working at rest stops along the turnpike in the middle of the night, at convenience stores ... we are returning to the days where people must work until the day that they die.  There are plenty of folks in Washington who are nostalgic about their imagined &quot;good old days&quot; in America -- and those days included colorful old people on the street corners selling apples and pencils.  Coming soon to your neighborhood.<br><br>I think of the impending massacre in beautiful Oaxaca, Mexico, where schoolteachers have refused to work until they achieve decent wages, decent funding for education, and an end to the corrupt government of Governor Ulysses Ruiz.  Thousands of ordinary citizens in this ancient city have constructed makeshift barricades, shut down the city, and declared a general strike until the teachers' demands are met.  A 36 year old journalist documenting this grassroots movement, Brad Will, from New York City, was fatally shot in the chest on October 27th by plainclothes paramilitaries.<br><br>I think of the Congress and President that just passed an unfunded mandate for a 7+ billion dollar 700 mile wall along our border.<br><br>Is it possible that people in the United States have had enough of this macho, lying, corrupt regime in Washington? Will Bush, Cheney, Rumsfeld &amp; Rice become lame ducks? Is it finally Rick Santorum's time to go? I've already cast my absentee  <br>ballot... like you, I'll be tuning in on November 7th to find out.<br><br>********************************************<br><br><br>FAMILY NEWS<br><br>Sad news from my husband.  His stepfather, Nisse Johannson died suddenly on October 19th.  The memorial service is scheduled for November 17th.  Julie's mom, Sonia, died in April of this year.  You can send condolences to picasso77750@yahoo.se<br><br>November Birthdays - Kimberly Sever (November 6th) &amp; Julie Leonardsson (November 12th)<br><br>************************************************************************<br><br>NOVEMBER LINK<br><br>Please <br><a href=\"http://www.nrcat.org/statement.aspx\">sign this petition against torture</a>  <br><br>************************************************************************<br>UPCOMING DATES:<br><br>Friday, November 3rd, 2006 8:00 PM<br>WYSU Folk Festival<br>Peaberry's<br>YSU Kicawley Student Center<br>Youngstown, OH 44555<br><a href=\"http://wysu.org\">http://wysu.org</a><br>Price: FREE!<br><br>Saturday, November 4th-Monday, November 6th<br>Children and War: Impact Speakers' Forum<br>St Mary's School<br>Cobourg, ON<br>Canada<br>godwyer(at)pvnccdsb.on.ca - Gary O'Dwyer is the contact -- Thomas Merton Award winner Kathy Kelly from Voices in the Wilderness and Eric LaCompte from School of the Americas Watch will be there too!<br><br>Wednesday, November 8th, 2006 7:30 PM<br>Honors Symposium<br>University of Rhode Island<br>Edwards Auditorium<br>Kingston, RI 02881<br>401-874-2381<br><a href=\"http://www.uri.edu/hc/\">http://www.uri.edu/hc/</a><br>Price: free, with David Rovics!<br>Email debg@uri.edu<br><br>Friday, November 10th, 2006 7:30 PM<br>House Concert<br>Joanna Varadi and Stan Pollack's House<br>One Bardwell Street<br>Florence, MA 01062<br>413-585-9070<br>Price: $10-20<br>feel free to bring snacks and musical instruments for a little song swap afterward.<br><br>Saturday, November 11th, 2006 7:30 PM<br>Village Coffeehouse<br>First Parish Church<br>24 Central St<br>Berlin, MA 01503<br>978-838-2734<br><a href=\"http://www.fpcberlin.org\">http://www.fpcberlin.org</a><br>Price: $10<br>Robyn Tarantino coordinates the coffeehouse. Email her at guilfoyle20(@)charter(.)net<br><br>Sunday, November 12th, 2006 9:00 PM<br>Acoustic Open Stage Feature<br>The Elevens<br>140 Pleasant Street<br>Northampton, MA 01060<br>413-586-9155<br><a href=\"http://www.elevensmusic.com/index.html\">http://www.elevensmusic.com/index.html</a><br>Lisa and Naomi have turned this venue into a great music spot. Come by to hear some fabulous New England performers and my 45 minute feature set.<br><br>Monday, November 13th, 2006 9:00 PM<br>Geoff Bartley's Open Stage Feature<br>Cantab<br>738 Massachusetts Avenue<br>Cambridge, MA 02139<br><a href=\"http://www.cantab-lounge.com/public_html/cantab_directions.html\">http://www.cantab-lounge.com/public_html/cantab_directions.html</a><br>I'll be doing a 35 minute feature set at Geoff's legendary open stage -- you never know who might drop in to visit Geoff - one of the great talents and great hearts in folk music! The Cantab is a great spot to visit in Cambridge.<br><br>Tuesday, November 14th, 2006 7:15 PM<br>The Eighth Step and the Upstate New York IWW present Anne Feeney in Concert<br>Steamer No 10 Theater<br>500 Western Ave<br>Albany, NY 12203<br>518-861-5627<br><a href=\"http://www.upstate-ny-iww.org\">http://www.upstate-ny-iww.org</a><br>advance tickets widely available. check the website. and the theater is accessible too!<br><br>Thursday, November 16th, 2006 8:00 PM<br>School of the Americas Watch Benefit Concert<br>Eyedrum Gallery<br>290 MLK Drive, SE<br>Atlanta, GA 30312<br>http://www.eyedrum.org<br>Price: $20 donation/10 low income<br>Holly Near <a href=\"http://www.hollynear.com\">http://www.hollynear.com</a><br>emma's revolution <a href=\"http://www.emmasrevolution.com\">http://www.emmasrevolution.com</a><br>Chestnut Brothers<a href=\"http://www.chestnutbrothers.com\"> http://www.chestnutbrothers.com</a><br>Chris Chandler <a href=\"http://www.chrischandler.org\">http://www.chrischandler.org</a><br>Jon Fromer<br>Francisco Herrera<br>Colleen Kattau <a href=\"http://www.colleenkattau.com\">http://www.colleenkattau.com</a><br>Charlie King &amp; Karen Brandow <a href=\"http://www.www.charlieking.org\">http://www.www.charlieking.org</a><br>Jose Saavedra <a href=\"http://www.josesaavedra.com\">http://www.josesaavedra.com</a><br>Elise Witt <a href=\"http://www.elisewitt.com\">http://www.elisewitt.com</a><br>and more<br><br>EMCEES: Dave Lippman <a href=\"http://www.davelippman.com\">http://www.davelippman.com</a> &amp; Elise Witt<br><br><br>SPEAKERS from SOAW <a href=\"http://www.soaw.org\">http://www.soaw.org</a><br><br>Tickets available at Charis Books and More, 1189 Euclid Ave. in Little 5 Points, Atlanta GA 30307 &#x2013; (404) 524-0304<br><br>Friday, Nov 17th- Sunday, Nov 19th, 2006 <br>Close the School of the Americas Vigil<br>Fort Benning<br>Columbus, GA<br><a href=\"http://soaw.org\">http://soaw.org</a><br><br>Monday, November 20th, 2006 12:00 PM<br>Music in Social Movements<br>University of North Florida Campus Theater -- Robinson Student Services Building (Building #14, Room #1700)<br>4567 St. Johns Bluff Road South<br>Jacksonville, FL 32224<br>(904)-620-1654<br>Price: Free<br>Local Contact: Stan Swart, e-mail sswart@unf.edu or call (904)-620-1654<br><br>Saturday, December 2nd, 2006 2:00 PM<br>Anti-War Demonstration<br>March from Crowne Plaza Hotel to Federal Building<br>Cleveland, OH<br><a href=\"http://uslaboragainstwar.org/downloads/Dec%202%20Cleveland%20Rally%20Flyer.pdf\">http://uslaboragainstwar.org/downloads/Dec%202%20Cleveland%20Rally%20Flyer.pdf</a><br><br>Saturday, December 2nd, 2006 7:00 PM<br>Third Annual USLAW Labor Assembly Public Concert<br>Crowne Plaza Hotel<br>Cleveland, OH<br><a href=\"http://www.uslaboragainstwar.org/article.php?id=11234\">http://www.uslaboragainstwar.org/article.php?id=11234</a><br><br>Monday, December 4th - 8PM<br>Reading of &quot;BURIED&quot;  - a new play about the Sago mine disaster by Jerry Starr at<br>Pittsburgh Playwrights<br>Penn Avenue<br>Pittsburgh, PA<br>I'll be doing some music ... more details soon... save the date!<br><br>Friday, December 8th, 2006 3:00 PM<br>Joe Glazer Tribute<br>AFL-CIO Headquarters<br>815 16th Ave NW<br>Washington, DC<br>I'll be there.. hope to see you too!<br>Friday, December 8th, 2006 7:30 PM<br>Tribute Concert to Celebrate the Life of Joe Glazer<br>Saint Mark Presbyterian Church<br>10701 Old Georgetown Rd (near I-270)<br>Rockville/Bethesda, MD<br>301-754-3611<br><a href=\"http://imtfolk.org\">http://imtfolk.org</a><br>Price: $20<br>Proceeds benefit the Labor Heritage Foundation. Music by Magpie, DC Labor Chorus, U-Liners and Peter Jones/Steve Jones/Laurel Blaydes. I'll be there. Hope to see you there too!\n<div style=\"clear: both;\"></div>"
}
