{
	"date": "Thursday, May 12, 2005",
	"title": "Windy City",
	"body": "Hi folks... just a few quick thoughts in the midst of this whirlwind tour.<br><br>The IWW fest in Milwaukee and Madison was fantastic.  John Peck and the Wisconsin Wobs did a great job organizing.  It was great to see Rose Daitsman, and to hear Larry Penn again.  And singing with David Rovics was a total joy. I got to drown some worms in Lake Mendota with Ed Sadlowski and his gorgeous family... and then spent two days in South Chicago soaking in some labor history from Big Ed.<br><br>I'm in Chicago at the Regina Polk Institute for Union Women Leadership.<br><br>It's a very inspiring gathering.  Many of the women at the conference work for United Airlines.  The greed of the CEO and stockholders at United is disgusting.  I flew here on United Airlines.  The fare from pittsburgh to chicago was $53.96 + taxes.  How can the CEO have a 4.5 million dollar guaranteed &quot;signing bonus&quot; and sell tickets for next to nothing when he's defaulting on pension obligations to workers who have already given so much back????  and now he wants wage concessions too?<br><br>He belongs in jail.<br><br>At the morning workshop CJ Hawking showed &quot;Struggle in the Heartland&quot; -- the powerful video that Rose Feurer did for LaborVision about the Staley strike in the early 90's during the Decatur labor wars.  To see so many of my dear friends from that era and think of how hard and well they fought brought tears to my eyes. Her book about the Staley strike, co-written with her husband Steven Ashby, should be out soon.<br><br>Labor's history is written in blood, each page filled with struggle, sacrifice and suffering.  We just can't let these bastards take away everything that our parents and grandparents missed meals to win for us.  I hope we have a general strike if United tries to add wage cuts to the pension theft.<br><br>I'm looking forward to my upcoming tour of Sweden and Denmark. My<br><a href=\"http://jan.l.nielsen.homepage.dk/turne%20program.htm\">itinerary</a> is posted in Danish at the clickable link.<br><br>Welcome to Baby Frances - Congratulations Chris and Liana!<br><br>If you're near Lewiston, PA, extend some solidarity to the Carpenters on strike at Overhead Door since April 1, 2005.  I'll be visiting them as soon as I get back from Europe.<br><br>Adelante!<br>Anne\n<div style=\"clear: both;\"></div>"
}
