{
	"date": "Tuesday, July 26, 2005",
	"title": "IFCO/Pastors for Peace 2005 Caravan to Cuba",
	"body": "<a href=\"http://caravan16.blogspot.com/\">IFCO/Pastors for Peace 2005 Caravan to Cuba</a> has run into a roadblock and could use your help....\n<br>\n<br>AID DESTINED FOR CHILDREN IN CUBA SEIZED BY U.S. CUSTOMS\n<br>Call the Department of Commerce and Demand The Release of the Aid!\n<br>\n<br>On Thursday July 21st, US Customs and Border Protection officers, acting on instructions from the US Department of Commerce, seized 43 boxes of computer equipment &#x2013; toner, cables, calculators, modems, keyboards, 2 printers, and a dozen computers &#x2013; intended for Cuban children from the 16th Pastors for Peace Friendshipment Caravan...........\n<br>\n<br>HOW YOU CAN HELP!\n<br>\n<br>&#x2022; Call your congressional representative and your senators (202-225-3121); urge them to personally call Carlos Gutierrez, Secretary of Commerce and insist that he let the computers go!\n<br>\n<br>&#x2022; Call Michael D. Turner, Director of Export Enforcement for the Department of Commerce and insist that the computers be released. 202.482.1208, Ext. 3\n<br>\n<br>&#x2022; Call Wendy Wysong, Assistant Secretary of Commerce, for Export\n<br>Enforcement, and insist that the computers be released and allowed to continue to Cuba. 202.482.3618\n<br>\n<br>&#x2022; Ask your church or congregation to sign on to our Pastoral Letter in support of releasing the aid and allowing it to continue on to Cuba (available soon on our website).\n<br>\n<br>&#x2022; Organize a solidarity prayer vigil on Wednesday, July 27.\n<br>\n<br>Our Prayer Vigil will be taking place on the Hidalg-Reynosa International Bridge, Wednesday, 4:30- 6:30pm\n<br>\n<br>&#x2022; Hold a Rally at the Federal Building in your town to demand the release of the computers.\n<br>\n<br>For more information, visit the Pastors For Peace website,\n<br>\n<br>www.pastorsforpeace.org\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
