{
	"date": "Tuesday, November 01, 2005",
	"title": "Fellow Travelers' Advisory from Anne Feeney - NOV. 2005: VOLUME ONE, #8",
	"body": "Thanks for being on my mailing list! It's the best way I've found to stay in regular contact with my friends and family and activist heroes. Let me know what you're up to... I love it when you write back! Please feel free to forward this to your friends and relations! You can subscribe by clicking <a href=\"http://www.annefeeney.com/newsletter.html\">here</a>  <br><br>********************************<br><br>You can order my CDs at <a href=\"http://cdbaby.com/all/unionmaid\">CDBaby</a> and you can also download most of my music at Itunes and many many other download services. Music is a great holiday gift!!<br><br>********************************<br><br>IMMEDIATE DESTINATIONS: <br>For all the details click <a href=\"http://annefeeney.com/calendar.html\">here</a><br><br>Lexington, KY - Oct 27th<br>Louisville, KY - Oct 28th<br>Terre Haute, IN - Oct 29th<br>Cincinnati, OH - Oct 30th<br>Pittsburgh, PA - Nov 5th<br>Jacksonville, FL - Nov 11th &amp; 13th<br>Tallahassee, FL - Nov 13th<br>Fort Benning, GA - Nov 18th-20th<br><br>and then -- I'm booking Sweden and Denmark through early February 2006 -- any ideas?<br><br>NOW BOOKING--<br>TEXAS in February<br>FLORIDA in late February/early March<br>the great Northwest in March<br>PA, upstate New York &amp; Ontario in April?<br><br>*****************************<br><br>My friend Doug Gauss just bought a license plate frame that says 'My next license plate will be made by Dick Cheney and Karl Rove.' I'm trying not to get giddy as the house of cards trembles. Why is this <a href=\"http://www.yeeguy.com/freefall/\">game</a> so much fun? <br><br>*****************************<br><br>PAT &amp; SANDY &amp; GINA &amp; ANNE<br><br>Pittsburgh &amp; vicinity -- Check this out!!! On November 5th my wonderful friends Pat Humphries and Sandy O aka <a href=\"http://emmasrevolution.com\">Emma's Revolution</a> will be coming to town and I'm arranging a house concert for them. Pat and Sandy are great writers and performers and their show is always terrific.. *and* they're bringing my wonderful pal <a href=\"http://ginaforsyth.com\">Gina Forsyth</a> with them!! Gina is a fabulously talented New Orleans fiddle and guitar player and singer and wordsmith ... a Kerrville pal ... displaced by Katrina... I'll be doing a short set too... this will be my last Pittsburgh show until spring of 2006. This show will also be a fundraiser for the Molly Yard Title IX Fund established to carry on the work of hellraiser Molly Yard who died on September 21st after decades of feminist activism.<br><br>**********************************<br>ROY BOURGEOIS to receive MERTON AWARD<br><br>also, Pittsburgh Folks -- Thursday November 10th is the annual Thomas Merton Center Awards Dinner. This year it's a new location - the Greek Orthodox Community Center of St Nicholas Church. The Merton Award goes to Father Roy Bourgeois of the <a href=\"http://soaw.org\">School of the Americas Watch.</a> We've got a New Orleans-style Cajun band, too! Sit at my table! Let me know if you can come and join me. anne@annefeeney.com<br><br>************************************<br><br>HELP!!!<br><br>The lockout of the 156 families employed by Celanese in Meredosia, IL <br>continues - please read up on this struggle at their <a href=\"http://www.lockout484.org/\">website</a> and I'm sure you'll want to <a href=\"https://secure.unasecure.net/activedonation/index.cfm?siteID=boilermakers484\">donate online</a> or by mail to:<br><br>Boilermakers Local 484 Solidarity/Defense Fund<br><br>P.O. Box258<br>300 Main Street<br>Meredosia, IL 62665<br><br>Remember how very difficult it is for other hardhit people to raise money right now and please be generous<br><br>***********************************<br><br>FAMILY NEWS<br><br>My New Orleans cousins are still living in exile just outside of Austin. It looks like my cousin Kathleen's second child will be born in Austin instead of New Orleans. No hope of immediate return.<br><br>My son Daniel is running a marathon in Washington, DC this weekend. He's also working with other ex-Peace Corps volunteers in DC to set up a relief organization for Guatemala. The village where my son lived for 2 years in the district of San Marcos was hit very hard by the mudslides with many homeless and clean water and food only available by helicopter delivery. I should have an address for donations in time for the December Fellow Travelers' Advisory...<br><br>My cousin Bill Feeney is the pastor of Immaculate Conception Church in Washington, PA. The parish celebrated its 150th anniversary on October 15th and it was a grand celebration! Bishop William Winter was joined by eight past and present pastors and vicars including Fathers Rich Wesoloski, Jim Young and Nick Spirko. My cousins Mary and Tom Weldon were there. (They'll celebrate their 50th wedding anniversary on April 22, 2006) Rich W was hilarious as emcee at the dinner afterward.<br><br>My sister Kathleen is healing miraculously from her motorcycle accident and is back full time at her legal practice.<br><br>Happy Birthday to Bill Feeney &amp; Jill Merrill (October 16); Casey Horn (October 5th); Dan Berlin (October 6th), Steve Merrill (October 20th); Coming up - November 6th - Kimberly Sever (35!) November 12th - Julie Leonardsson (63)<br><br>***********************************<br>Midwest Tour notes...<br><br>If you're headed to Michigan----<br><br>The IWW exhibit which opened on October 19th in the Hatcher Library at the University of Michigan in Ann Arbor will continue for a while. It's an extraordinary exhibit. So many rare photos, artifacts ... you can see an envelope that contained Joe Hill's ashes... Julie Herrada did a fantastic job of putting the show together, and my friend and gracious host Joyce Kornbluh gave a very inspiring speech at the opening.<br><br>Another fine exhibit of Wobbly memorabilia is on display at the Reuther Library in Detroit.<br><br>If you get to Lansing, visit Magdalena's Tea House ... A charming spot doing great live music. Many thanks to Margabeth and Dave and Marya and Miko and Indigo and Susan.<br><br>and stop by the picket line of striking OPEIU nurses local 549 at Ingham Memorial Hospital.<br><br>The 15th Annual Bernie Firestone Tribute of Labor Poetry and Music at the Scarab Club was sensational. Kudos to ML Liebler for putting together such a wonderful event.<br><br>Locked out workers at Hercules Drawn Steel in Romulus, MI gathered at Local 174 for a great evening of solidarity... delicious catering by the Wobbly Kitchen and then Evan and I did a show. Thanks to Jim and Sue Burton.<br><br>Traveling with Evan Greer was so much fun. Check out http://riotfolk.org and listen to and download some of this anarchist collective's fine music.<br><br>Last month's trivia: A &quot;Sooner&quot; was someone who pre-emptively homesteaded Oklahoma (i.e. got there sooner) during the land rush ... no one told me what a Hoya was, tho...<br><br>************************************\n<div style=\"clear: both;\"></div>"
}
