{
	"date": "Wednesday, May 04, 2005",
	"title": "Fellow Travelers' Advisory from Anne Feeney - MAY 2005: VOLUME ONE, Number Two",
	"body": "IMMEDIATE DESTINATIONS: Milwaukee, Madison, Chicago, Sweden, Denmark, Ontario, Madison (again!), Winona, MN, Washington, DC, St Louis, Mt. Olive and Chicago - then off to the left coast! Full schedule at: http://www.annefeeney.com/calendar.html or in Danish at http://www.booking.prognet.dk/index.aspx?F_ID=50 and http://www.kultunaut.dk/perl/nyheder/type-nynaut?n=4542<br><br>CDs available at http://cdbaby.com/all/unionmaid<br><br><br>Hi there Brothers and Sisters! <br><br>Last night we celebrated Pete Seeger's 86th birthday with a sing-along fundraiser at the Bloomfield Bridge Tavern. All over the US people gathered to sing together on Pete's birthday. I was joined by Ken Gaines of Houston and Pittsburgh's John Hayes. Special guest Jack Erdie sang &quot;Let Their Heads Roll&quot; to the delight of all. The SRO crowd raised a couple hundred dollars for the Hudson River Sloop Clearwater and had a great time. This month is also the 70th birthday of both Utah Phillips and Peggy Seeger.<br><br>Welcome aboard to all the labor educators I met at the UALE conference in Philadelphia in March. If you (or anyone else) want to unsubscribe from this monthly missive, just click on the link at the end of this newsletter. If you got a forwarded copy of this newsletter, click http://www.annefeeney.com/newsletter.html to subscribe to the Fellow Travelers' Advisory.<br><br>My recent swing through northeastern PA gave me a chance to visit the Eckley Miners' Village, where they made the film &quot;Molly Maguires,&quot; as well as the monument to the September 10, 1897 Lattimer Massacre. Definitely worth a stop. &quot;It was not a battle because they were not aggressive, nor were they defensive because they had no weapons of any kind and were simply shot down like so many worthless objects, each of the licensed life-takers trying to outdo the others in butchery.&quot;<br>-Inscription on the Monument erected at Lattimer, 1972. Check it out... http://www.phmc.state.pa.us/ppet/lattimer/page1.asp?secid=31<br>Saul Schniderman at the Labor Heritage Foundation has made a terrific inventory of American Labor Landmarks http://laborheritage.org/landmark.htm that you should consult before heading out on the road. A slight detour from your appointed route may show you a side of American history that you didn't learn in school.  Many thanks to Walt and Rosemary Brasch, <img src=\"https://lh5.googleusercontent.com/proxy/tix0ohs8y7gogeTaMkeTKcr0ctL8R2mXH0ESFA4YL_yQivIfr1dGyoyJZyHvqoqJ1BDY6dmfoQ8=s0-d\"> my most gracious Bloomsburg hosts.<br><br>The Labor Heritage Foundation has decided to give the 2005 Joe Hill Award (http://laborheritage.org/JoeHill.htm) to me <gasp, blush> at this year's Great Labor Arts Exchange. I'm overwhelmed.<br><br>A highlight of my upcoming hellraising tour of Scandinavia with David Rovics will be a plane trip to remote northwestern Sweden to a NATO summit where Condoleeza Rice will be speaking. More about that in next month's issue.<br><br>Still looking for a gig on July 13th in northern California, July 24th in Vancouver, July 29th and 30th in Portland or Olympia or thereabouts. Email me if you have any ideas......\n<div style=\"clear: both;\"></div>\n</gasp,>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
