{
	"date": "Wednesday, December 02, 2009",
	"title": "DECEMBER 2009 - Anne Feeney's Fellow Travelers' Advisory - VOLUME  FIVE -  #9",
	"body": "IMMEDIATE DESTINATION<br>\nCopenhagen, Denmark<br>\n<br>\n<div style=\"text-align: right;\">December 2nd<br>\n</div><div style=\"text-align: right;\">Pittsburgh, PA<br>\n</div>Hi All<br>\n<br>\nIt's been a great great year for me in so many ways, but I end 2009 depressed, disgusted and demoralized ... 30,000 more soldiers headed to the place where empires go to die - Afghanistan...  And the cobbled piece of dung that they're calling our health care plan is so disappointing.  It seems like the only thing politicians in this country can agree on is that women are second-class citizens (what with all their crazy bodily parts that are not at all like normal penises). What happened to all the hope and change we were promised?  Obama can't even sign the Land Mines Treaty.  Bah, humbug...<br>\n<br>\nI'm headed in a couple days to Copenhagen, where the pundits say the chances of any meaningful action on climate change range from extremely unlikely to utterly impossible. Still, I will gladly join the 30,000+ people in the streets urging our leaders to do better.  And I'll continue to work and hope that next year will be better.<br>\n<br>\n<br>\nOn the plus side, 2009 was a great year with too many highlights to mention - but I'll mention a few anyway... The Sing Out for Single Payer Road Show (July) was clearly the highlight of my year - I'm still basking in the warmth of your response to my call for help in organizing that wild and wonderful cultural extravaganza. There are no words to express the gratitude I feel to all of you for making that dream a reality. But the Irish tour was fantastic (August), as was marching on Blackwater (April) with the Catholic workers, seeing my son Dan graduate from Georgetown Law School (May), and adding a new province (Manitoba) to the places I have performed, meeting Reps. Bob Filner and Dennis Kucinich, the wonderful midwest tour with David Rovics, Reiko and Leila (October), the Graduate Students' Union victory at the University of Illinois, the victory for Heartland Human Services in Effingham, IL.<br>\n<br>\nThe thing that keeps me going is you.  You are such a big part of my life... My work would be impossible without you.  I know you're busy, but if you can, PLEASE take a good look at my 2010 (below) and let me know if you have any ideas about where I can or should perform in the coming year.  I hope your holidays are restful, joyous, and that the coming year brings us better news.<br>\n<br>\nMerry Christmas, Happy Chanukah, Glorious Solstice, Joyous Kwanzaa  etc etc<br>\n<br>\nMuch love<br>\n<br>\nAnne<br>\n<br>\n<div style=\"color: #274e13; text-align: center;\"><b>IN THIS ISSUE</b><br>\n</div><div style=\"color: #274e13;\"><b><br>\n</b><br>\n</div><div style=\"color: #274e13;\"><b>IRELAND 2010</b><br>\n</div><div style=\"color: #274e13;\"><b>2010 AT A GLANCE - PLEASE HELP ME TO PLAN MY YEAR!</b><br>\n</div><div style=\"color: #274e13;\"><b>DAVID ROVICS AND I ARE ON PROGRESSIVE RADIO and DEMOCRACY NOW!</b><br>\n</div><div style=\"color: #274e13;\"><b>HELP MAKE THE HOLIDAYS MERRY FOR STRIKERS IN PEKIN, ILLINOIS</b><br>\n</div><div style=\"color: #274e13;\"><b>FAMILY NEWS</b><br>\n</div><div style=\"color: #274e13;\"><b>TERRIFIC HOLIDAY SHOPPING TIPS - REVIEWS OF ROVICS, QTN, CHANDLER &amp; MORE</b><br>\n</div><div style=\"text-align: center;\"><br>\n</div><div style=\"text-align: center;\">****************************************************<br>\n</div><div style=\"text-align: justify;\"><br>\n</div><div style=\"text-align: center;\"><b>IRELAND 2010</b><br>\n</div><br>\n<a href=\"//3.bp.blogspot.com/_yPZWeXAMdds/SYyGGtXGuPI/AAAAAAAAASc/es1kLrmryn4/s1600/ireland.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"//3.bp.blogspot.com/_yPZWeXAMdds/SYyGGtXGuPI/AAAAAAAAASc/es1kLrmryn4/s320/ireland.jpg\"></a><br>\nIf you'd like to go to Ireland with me next year, how about letting me know that?  So far I've got about half a dozen commitments.. but I need more than that to go ahead...  Email me if you want more information... <a href=\"mailto:anne@annefeeney.com\">anne@annefeeney.com</a>  The dates are August 10-19 and/or August 22-31.<br>\n<br>\n<br>\n<br>\n<div style=\"text-align: center;\">**************************************************************<br>\n</div><div style=\"text-align: center;\"><br>\n</div><div style=\"text-align: center;\"><b>2010 AT A GLANCE - PLEASE HELP ME TO PLAN MY YEAR!</b><br>\n</div><br>\nThe coming year is taking shape for me.  In January I'm visiting my son Daniel and his wife Monique in Quito, Ecuador - I haven't seen them since last May - I'm just aching with loneliness for them ... I'll be there from January 11th to January 25th.  Then my work year begins in earnest.  I'd love to see you.  If you'd like to see me in your hometown in 2010, please take a look at this and see if you have any ideas on how to get me there...  I need a *lot* more work!<br>\n<i><br>\n</i><br>\n<i>THE LEFT COAST - FEBRUARY 2010</i><br>\n<br>\nFebruary 5th I'm flying to Seattle and picking up a rental car.  I'm still looking for lots of dates on the left coast mostly between Seattle and the Bay Area ... <a href=\"http://annefeeney.com/calendar.html\">http://annefeeney.com/calendar.html</a> - If you know someone in San Luis Obispo or thereabouts who could put together a show on February 27th, I might extend the tour back down to LA/San Diego.<br>\n<br>\n<br>\n<br>\n<i>FLORIDA - MARCH 2010</i><br>\n<br>\nMarch 10th I'm flying to Jacksonville, and still have lots of Florida dates to fill.  Let me know your ideas! <a href=\"http://annefeeney.com/calendar.html\">http://annefeeney.com/calendar.html</a><br>\n<br>\n<i><br>\n</i><br>\n<i>THE MIDWEST WITH EVAN GREER - APRIL 2010</i><br>\n<br>\nIn early April, Evan Greer and I will be doing a tour of the midwest.  If you're ready for a return visit - especially if I missed you last October (Cleveland, Kansas City, Cape Girardeau, St Louis) - please get in touch.<br>\n<br>\n<br>\n<i>MINI MID-ATLANTIC TOUR WITH ROY ZIMMERMAN - LATE APRIL/EARLY MAY 2010</i><br>\n<br>\nIn late April I'm hoping to line up a mini-tour, quite possibly with my pal Roy Zimmerman, from Detroit to New York City.<br>\n<i><br>\n</i><br>\n<i><br>\n</i><br>\n<i>PITTSBURGH TO KERRVILLE TO DETROIT - MAY/JUNE 2010</i><br>\n<br>\nThen, I'll be driving to the Kerrville Folk Festival and picking up gigs along the way.  My flexible route takes me along I-70 to Columbus, down through Cincinnati, Louisville, Nashville, Memphis, Little Rock, Texarkana, Dallas, Austin, Kerrville. While I'm at the festival, I'll fly up to Long Island for the Working Class Studies Conference and then return to the festival. After the festival I'll be looking for<br>\nJune 13 in Fort Worth <br>\nJune 14 in Oklahoma City<br>\nJune 15 in Fayetteville, AR<br>\nJune 16 in  Kansas City or Springfield MO<br>\nJune 17 in St. Louis<br>\nJune 18 in Indianapolis and <br>\nJune 19 arrive at the Great Labor Arts Exchange followed by the US Social Forum in Detroit.  <br>\n<br>\n<i><br>\n</i><br>\n<i>OREGON COUNTRY FAIR - July 9-11, 2010</i><br>\n<br>\nIf I'm accepted into Oregon Country Fair, I'll fly out to Oregon for that the weekend of July 9-11.  I'd be happy to add something a day or two before or after the fair.<br>\n<br>\n<i>ON TO SWEDEN! - mid-July to mid-August 2010</i><br>\n<br>\nIf you have any ideas for work in Sweden, please contact Fredrik Gleisner - <a href=\"mailto:fredrik@goatbridge.com\">fredrik@goatbridge.com</a> - and he'll be happy to arrange shows in Sweden.<br>\n<i><br>\n</i><br>\n<i>AUGUST IN IRELAND</i><br>\n<br>\nAugust 10th I meet my first group in Ireland.  You should think about coming to Ireland with me.  These trips are fantastic!  Email me and I'll send you lots of information.<br>\n<br>\n<i>LABOR DAY???</i><br>\n<br>\nI'll be back in the United States for Labor Day, which is still not confirmed... so if you're interested, let me know.<br>\n<i><br>\n</i><br>\n<i>FALL 2010</i><br>\n<br>\nAt some point in the fall Bev Grant and I will do a tour together.  I'm really looking forward to that.<br>\n<br>\n<br>\n<i>SCHOOL OF THE AMERICAS WATCH VIGIL - NOVEMBER 2010</i><br>\n<br>\nI'm thinking about driving to SOAW next year as part of a HEN FOUNDATION fundraiser.  If you're along the route - Washington, DC and on down the I-95 corridor - let me know if you'd like to try a show between November 12 and 18th.<br>\n<br>\nThat's as far as I've gotten in my 2010 plans... but I sure hope that my plans bring me to wherever you are!<br>\n<br>\n<div style=\"text-align: center;\">*******************************************************************<br>\n</div><div style=\"text-align: center;\"><br>\n</div><div style=\"text-align: center;\"><b>DAVID ROVICS AND I ON PROGRESSIVE RADIO and DEMOCRACY NOW!</b><br>\n</div><br>\nWhile we were on tour in the Midwest, David Rovics and I did a radio interview with The Progressive - a great magazine celebrating 100 years of independent progressive journalism.  You can listen to the interview at <a href=\"http://progressive.org/radio/feeney09.html\">http://progressive.org/radio/feeney09.html</a><br>\n<br>\nand...<br>\n<br>\nDemocracy Now! will be in Copenhagen for the summit.  I spoke to Amy Goodman today, and it's very likely that David Rovics and I will be guests on DN! while we're all in Denmark.  That will be exciting.  Keep your eye out for us... <a href=\"http://democracynow.org/\">http://democracynow.org</a><br>\n<br>\n<div style=\"text-align: center;\">*******************************************<br>\n</div><div style=\"text-align: center;\"><br>\n</div><div style=\"text-align: center;\"><br>\n</div><div style=\"text-align: center;\"><b>HELP MAKE THE HOLIDAYS MERRY FOR STRIKERS IN PEKIN ILLINOIS</b><br>\n</div><br>\nThe strikers of Laborers' Local 231 in Pekin, IL - on strike against PAL health technologies - come into the holiday season with no paycheck and no strike fund.  You can help.  Send a contribution to:  <br>\n<br>\nLaborers Local 231<br>\nBOX 374<br>\nPekin, IL 61554<br>\n<br>\n<div style=\"text-align: center;\">************************************************************<br>\n</div><div style=\"text-align: center;\"><br>\n</div><div style=\"text-align: center;\"><b><br>\n</b><br>\n</div><div style=\"text-align: center;\"><b>FAMILY NEWS</b><br>\n</div><br>\nIf you are familiar with myspace, try<a href=\"//www.blogger.com/%20http://www.myspace.com/guitarcarols\"> http://www.myspace.com/guitarcarols</a> and play the wonderful instrumental winter music my cousin Sean McCahill has recorded, but unfortunately, not released ... they're lovely and great music to play while you have holiday guests.<br>\n<br>\nCongratulations to Gary Huck and Tavia LaFollette on the birth of their beautiful twin sons, Maxwell and Calder on December 1st!  <br>\n<br>\nAnd Chris Chandler <a href=\"http://chrischandler.org/\">http://chrischandler.org</a> is engaged! He popped the question to Bay Area based Welsh artist Jen Delyth <a href=\"http://www.kelticdesigns.com/\">http://www.kelticdesigns.com/</a> last month. No wedding date is set as of this writing.<br>\n<br>\nThe fabulous David Elsila is recovering well from very serious surgery.&#xA0; I'm sure he'd love to hear from his friends. <br>\n<br>\nMy daughter Amy, her friend Jesse Dalton, my sister Kathleen, her daughter Kimberly and Kimberly's son Casey will all join me and my husband in Sweden for the holidays.  We're even planning a trip to the north pole (almost)!<br>\n<br>\nBirthdays - Ben Mumphrey - Dec 2nd,  Olivia Grefenstette - Dec 6th,  Mick Madera - Dec 11th, Dennis McCahill - 70!!! on Dec 12th, Gail Skidmore - Dec 16th, Pat McArdle - Dec 17th, and picker extraordinaire Geoff Bartley on Dec 30<br>\n<br>\n<div style=\"text-align: center;\">*******************************************************<br>\n</div><div style=\"text-align: center;\"><br>\n</div><div style=\"text-align: center;\"><br>\n</div><div style=\"text-align: center;\"><b>HOLIDAY SHOPPING TIPS</b><br>\n</div><br>\nWhy not treat yourself and a friend to a trip to Ireland with me and a few other exciting activist types!  or come alone and meet wonderful new friends!  <br>\n<br>\n<br>\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"//2.bp.blogspot.com/_yPZWeXAMdds/SxbK3yNapBI/AAAAAAAAAb8/NBMYQ43-7L4/s1600-h/iPhonethruSept+19+071.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"//2.bp.blogspot.com/_yPZWeXAMdds/SxbK3yNapBI/AAAAAAAAAb8/NBMYQ43-7L4/s640/iPhonethruSept+19+071.jpg\"></a><br>\n</div><br>\nThe 2010 tours are August 10-19 in the west and August 22-31 in Dublin, Belfast and Derry!  $250 to Anne Feeney, 2240 Milligan Avenue, Pittsburgh, PA  15218 holds your seat.  Email me for more details.... <a href=\"mailto:anne@annefeeney.com\">anne@annefeeney.com</a><br>\n<br>\nIf you're buying books this holiday season, let me recommend Powell's books in Portland.  They have an inventory to rival Amazon's *and* the workers are happy members of the ILWU - a great union.  Use this link<br>\n<a href=\"http://www.ilwulocal5.com/shop-union/\">http://www.ilwulocal5.com/shop-union/</a> to shop at the world's best union bookstore!<br>\n<br>\nBreaking news!! Our friends at the Center for the Study of Working Class Life have released a DVD just in time for the holidarys called &quot;Why Are We in Afghanistan?&quot;  Written by Michael Zweig and illustrated by the fabulous Mike Konopacki, this 27 minute DVD will really enlighten you on what's going on.  Only $9.95 + shipping from <a href=\"http://whyareweinafghanistan.org/\">http://whyareweinafghanistan.org</a>  (The website wasn't up when I checked this link, but Michael says it should be up and running very very soon...)<br>\n<br>\nYou can download my Christmas single - &quot;Brave New Christmas&quot; (by my wonderful friend John William Davis) at <a href=\"http://www.cdbaby.com/cd/annefeeney7\">http://www.cdbaby.com/cd/annefeeney7</a> - for only 99 cents - or download the whole cd, &quot;Dump the Bosses Off Your Back,&quot; for $9.99, or have a CD sent right to you, or your favorite working class pal for only $14.99<br>\n<br>\nMy other CDs make great gifts too - <a href=\"http://annefeeney.com/all/unionmaid\">http://annefeeney.com/all/unionmaid</a><br>\n<br>\nI also want to highly recommend Chris Chandler's new cd - So, Where Ya Headed? <a href=\"http://www.cdbaby.com/cd/chrischandler12\">http://www.cdbaby.com/cd/chrischandler12</a> - His partnership with Paul Benoit is generating some of Chris' finest work ever.  You'll love it.<br>\n<br>\nFinally! a beautifully produced full length CD from my occasional touring buddy (and great young songwriter) Evan Greer. Evan composed &quot;Ya Basta!&quot; which is on my &quot;Dump the Bosses Off Your Back&quot; and a staple of my current repertoire.  &quot;Never Surrender&quot; is available at <a href=\"http://www.cdbaby.com/cd/evangreer\">http://www.cdbaby.com/cd/evangreer</a> and includes all my Evan Greer favorites - &quot;The Picket Line Song,&quot; &quot;Never Surrender,&quot; &quot;Ya Basta!,&quot; &quot;I Want Something.&quot;<br>\n<br>\nYou can hear a four song sampler of Brian QTN's stunning new release, &quot;Guitarred and Feathered&quot; at www.myspace.com/QTNstrumentals ... this instrumental guitar album is simply gorgeous.  A check for $17 to Brian Cutean, 85444 Teague Loop, Eugene, OR 97405 will land this in your mailbox before you can say, &quot;How'd that get here so quick?&quot; (sez Brian)<br>\n<br>\nMy talented pal Roy Zimmerman has a refreshingly different album of holiday songs called &quot;Peacenick&quot; <a href=\"http://www.cdbaby.com/cd/rzimmerman4\">http://www.cdbaby.com/cd/rzimmerman4</a> which include, &quot;Buy War Toys for Christmas,&quot; &quot;Christma-Hanu-Rama-Ka-Dona-Kwanzaa,&quot; and the charming &quot;Christmas is Pain&quot; and nine more. All of Roy's stuff is great.<br>\n<br>\nIf there's a more beautiful holiday song than John McCutcheon's &quot;Christmas in the Trenches,&quot; I don't know what it would be. You'll find it on his wonderful &quot;Winter Solstice&quot; album at<a href=\"//www.blogger.com/goog_1259819405786\"> </a><a href=\"http://www.folkmusic.com/record/r_sols.htm\">http://www.folkmusic.com/record/r_sols.htm</a><br>\n<br>\nDavid Rovics has just released two cds... one a retrospective of his finest compositions to date - &quot;Waiting For the Fall&quot;, and the other brand new songs -  &quot;Ten Thousand Miles Away.&quot;  I bought them both.  You should too. <a href=\"http://davidrovics.com/\">http://davidrovics.com</a>  You might also be interested in David's children's album &quot;Har Har Har! Songs About Pirates, Penguins and Punk Rock Babies&quot; - also available on his site.<br>\n<br>\nAnd single-payer advocates will enjoy The Austin Lounge Lizards &quot;The Drugs I Need&quot; <a href=\"http://www.cdbaby.com/cd/austinll2%20\">http://www.cdbaby.com/cd/austinll2 </a>- which also includes a children's song.<br>\n<br>\nYou'll find a lot more great music at <a href=\"http://www.cdbaby.com/group/annespicks\">http://www.cdbaby.com/group/annespicks</a><br>\n<br>\nHappy shopping!<br>\n<br>\n<div style=\"text-align: center;\">*******************************************<br>\n</div><div style=\"text-align: center;\"><br>\n</div><div style=\"text-align: center;\"><b>THE TOUR</b><br>\n</div><br>\n<br>\nWednesday, December 9th, 2009 9:30 PM<br>\n<span class=\"calendar_event_title_text\">Open Peace mic  and Workshop/Concert  </span><br>\n<span class=\"calendar_venue_text\"><span class=\"calendar_venue_name\">No Borders, Climate Info Cafe</span><br>\nRavnhildsgade 1<br>\nCopenhagen 2100<br>\nDenmark<br>\n26170186<br>\n<a href=\"http://www.fredsfestival.dk/091209.pdf\" target=\"_blank\">http://www.fredsfestival.dk/091209.pdf</a><br>\n</span>   <span class=\"calendar_notes_text\"><a href=\"mailto:mberlev@hotmail.com\">mberlev@hotmail</a>. is the contact, sponsored by KODA's songwriterforum</span><br>\n<br>\nThursday, December 10th, 2009 7:00 PM<br>\nBrett Perkins' Songwriters In The Round<br>\nBETA (Formerly CafeKino)<br>\n&#xD8;resundsvej 6, Kbh S<br>\nCopenhagen<br>\nDenmark<br>\nPrice: 50kr - all ages<br>\nFeaturing Bob Cheevers, Anne Feeney, others tba<br>\n<br>\n<br>\nFriday, December 11th, 2009 7:00 PM<br>\nAnne Feeney in Concert in support of David Rovics<br>\nBoserup with David Rovics!<br>\nBoserupvej 100<br>\nRoskilde 4000<br>\nDenmark<br>\n<br>\nSaturday, December 12th, 2009 8:00 PM<br>\nClimate rally! Anne Feeney and David Rovics<br>\nTvind Flatbed<br>\nCopenhagen<br>\nDenmark<br>\n<br>\n<br>\nSunday, December 13th, 2009 7:00 PM<br>\nDavid Rovics, The Lurkers and Anne Feeney in Consert!<br>\nKlimaforum - DGI-Byen<br>\nGymnastikhuset<br>\nCopenhagen<br>\nDenmark<br>\n<a href=\"http://en.cop15.dk/blogs/view+blog?blogid=2465\">http://en.cop15.dk/blogs/view+blog?blogid=2465</a><br>\n<a href=\"http://www.facebook.com/home.php#/group.php?gid=51323908663\">http://www.facebook.com/home.php#/group.php?gid=51323908663</a> is another spot you can learn more about this -<br>\nSponsoring Organisation: Budskab fra Gr&#xE6;sr&#xF8;dderne (Message from the Grassroots)<br>\nContact person: Gerd Berlev / <a href=\"mailto:gerd@berlev.dk\">gerd@berlev.dk</a><br>\n<br>\n<br>\n<br>\n<input id=\"gwProxy\" type=\"hidden\"><input id=\"jsProxy\" onclick=\"jsCall();\" type=\"hidden\"><br>\n<div id=\"refHTML\"></div><input id=\"gwProxy\" type=\"hidden\"><input id=\"jsProxy\" onclick=\"jsCall();\" type=\"hidden\"><br>\n<div id=\"refHTML\"></div><input id=\"gwProxy\" type=\"hidden\"><!--Session data--><input id=\"jsProxy\" onclick=\"jsCall();\" type=\"hidden\"><div id=\"refHTML\"></div>\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
