{
	"date": "Wednesday, September 05, 2007",
	"title": "LABOR DAY 2007",
	"body": "<a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://bp3.blogger.com/_yPZWeXAMdds/RuEfH9QBd2I/AAAAAAAAAEM/uv_G3zjZ6Ew/s1600-h/DSC00124.JPG\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5107397673976166242\" src=\"https://lh5.googleusercontent.com/proxy/FA5H_LHw3bnxOrvuhtDgRRM_w2bNL2dJSghBseREZ3k-tkJj8voWwJMRHyEij09QnHdCEKMw-9ZtATrJlChBXRaLge5_uuMiGayhGcTI_uM_r3HcXyFbjfhM0KxUOdpZ-KSgFOwZNk3CZTW0FQ=s0-d\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;\"></a><br><br>My friend Hilary Chiz of USW took this photo of me and her mother -  Bertha K. Luks, from Birmingham, Alabama (the &quot;Pittsburgh of the South&quot;).  Her mom is much older than she looks and just amazing.  She stood there serenely in the blistering heat through over an hour of speeches....<br><br>The photo shows us standing on the newly-dedicated Phillip Murrray Bridge.  Phil Murray and my granddad, William Patrick Feeney, were contemporaries. Murray emigrated to the US from Scotland the same year that my granddad set sail from England.  They both worked the mines.  They both became organizers.  Phil Murray formed the Steelworkers' Organizing Committee, and became the first President of the United Steelworkers of America. <br><br>My grandfather served one term in the Pennsylvania legislature (1908-1910), where he introduced the first mine safety bill in America.  The law didn't pass during his term in office, but was subsequently reintroduced in every session until it passed in the 1930s.  The governor of Pennsylvania invited my granddad to the signing of that piece of legislation and gave him the pen.<br><br>Phil Murray and my grandfather were lead organizers during the Great Steel Strike of 1919.  I have a picture of the two of them and Mother Jones waiting to address a rally.<br><br>Happy Labor Day!\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
