{
	"date": "Wednesday, November 28, 2007",
	"title": "Anne Feeney's Fellow Travelers' Advisory - DECEMBER 2007, VOLUME THREE, #9",
	"body": "Anne Feeney's Fellow Travelers' Advisory - DECEMBER 2007, VOLUME THREE, #9<br><br>IMMEDIATE DESTINATIONS: (details at the end of this post)<br><br>NURSES' RALLY IN LEXINGTON, KY!!  - NOV 29th<br><br>SYRACUSE (NY) PEACE COUNCIL BENEFIT  - DEC 1st<br><br>JACKIE ALPER TRIBUTE in SCHENECTADY, NY  - DEC 2nd<br><br>PITTSBURGH BENEFIT CONCERT FOR STRIKING NURSES <br><br>*******************************************<br><br>Thank you for signing up for my monthly email news - The Fellow Travelers' Advisory. If this was forwarded to you, you can subscribe by going to <a href=\"http://annefeeney.com/newsletter.html\">http://annefeeney.com/newsletter.html</a> <br><br>Order CDs at <blockquote>http://cdbaby.com/all/unionmaid<a href=\"http://cdbaby.com/all/unionmaid\"></a></blockquote> -- the sale on my CDs continues through December 8th...<br><br>I'm always looking for work: email me at anne@annefeeney.com if you'd like to help set up a concert, or have me play at your college, conference, convention or riot.<br><br>********************************************<br>IN THIS ISSUE<br><br>750 NURSES ON STRIKE FOR SAFE STAFFING LEVELS!<br>BENEFIT CONCERT FOR STRIKING NURSES<br>&quot;BURIED&quot; PRODUCTIONS FOR 2008<br>MILESTONES &amp; HIGHLIGHTS OF 2007<br>SEASONAL JOKE<br>IRISH TOURS UPDATE<br>LAST MINUTE GIFT IDEAS<br><br>********************************************<br><br><br>750 NURSES ON STRIKE FOR SAFE STAFFING LEVELS!<br><br>On October 1, 2007 750 nurses went on strike against Appalachian Regional Health Systems.  The incessant mandatory overtime and chronic understaffing is endangering patients and limiting the nurses' ability to do their jobs properly.<br><br>When I played in Charleston, WV in early November, I stopped by the nurses' picket line in Beckley.  They're a great group of folks, and determined to stick this out.<br><br>Read more here:<br><a href=\"http://news.yahoo.com/s/ap/20071116/ap_on_re_us/nurses_strike_6\"><br>http://news.yahoo.com/s/ap/20071116/ap_on_re_us/nurses_strike_6</a><br><br>You can help by signing this petition:<br><a href=\"http://www.unionvoice.org/campaign/nurses_kywv\"><br>http://www.unionvoice.org/campaign/nurses_kywv</a><br><br>Or clogging up their scab hotline -- apply for a job... hell apply for several jobs ... if they're getting 10,000 job applications a day it might make it hard for them to find the three creepy lowlife scabs willing to come to WV or KY to break this strike.<br><br><a href=\"http://www.arh.org/Employment/ImmediateOpenings.php\">http://www.arh.org/Employment/ImmediateOpenings.php</a><br><br>I applied for a job as an RN at Beckley ... My name was Ms. Scab E. Scab.  I obtained my BS in BackStabbing.  I was referred to their site by Benedict Arnold.  My references included Satan Himself, beelzebub@hotmail.com, telephone (666) 666-6666<br><br>You can amuse yourself filling out the application, and help the striking nurses by making it just a little harder for management to sort through the job applications looking for real scabs.<br><br>AND, you can contribute securely online at:<br><br><a href=\"https://secure.ga6.org/08/arhstrikefund\">https://secure.ga6.org/08/arhstrikefund</a><br><br>or by check to: <br><br>Kentucky Nurses' Association<br>1400 South First Street<br>P.O. Box 2616<br>Louisville, KY 40201-2616<br><br>********************************************<br><br>BENEFIT CONCERT FOR STRIKING NURSES<br><br>I will almost certainly be doing a benefit concert for the striking nurses at a Pittsburgh location on Saturday, December 15th.  It will be a free concert with your generous donations to the strike fund ... food, cash, checks, clothing, toys ... all delivered to the nurses on the 16th in time for Christmas.<br><br>Check <a href=\"http://annefeeney.com/calendar.html\">http://annefeeney.com/calendar.html</a> for the location.<br><br>In the meantime, gather up your generous gifts for the striking nurses.  If I don't get a location for the concert, I'll come to your house to pick up your gifts and even sing you a song!<br><br><br><br>********************************************<br><br>&quot;BURIED&quot; PRODUCTIONS FOR 2008<br><br><br>Jerry Starr's powerful play, BURIED: The Story of the Sago Mine Disaster, will be produced in Detroit, Chicago and Indiana, PA in 2008.  I'm hoping to be a part of all three productions, although my 2008 schedule may make that difficult.  I'll *definitely* be doing the music for the Indiana, PA production at the end of March/beginning of April 2008.<br><br>********************************************<br><br>MILESTONES &amp; HIGHLIGHTS OF 2007<br><br>Just back from the School of the Americas Watch vigil - as moving and powerful as ever - 25,000 say NO! Not in my name! Close the SOA!!  Holly Near, the Indigo Girls and Dennis Kucinich and a fabulous collective of musicians were on hand.  I've put some photos by Al Viola on my blog and there's a great slide show at: <br><a href=\"http://pak05.pictures.aol.com/NASApp/ygp/EmailLanding.ygp?event=DirectView&amp;shareInfo=1uXYxRKKm4RodfltjcbjBX%2fKrZPRZQ92XLRN9Bg2B4pWGd%2bBXiXp6w%3d%3d&amp;pageName=AlbumViewFromEmails&amp;locale=en_US\">http://pak05.pictures.aol.com/NASApp/ygp/EmailLanding.ygp?event=DirectView&amp;shareInfo=1uXYxRKKm4RodfltjcbjBX%2fKrZPRZQ92XLRN9Bg2B4pWGd%2bBXiXp6w%3d%3d&amp;pageName=AlbumViewFromEmails&amp;locale=en_US</a> and <br><a href=\"http://pak05.pictures.aol.com/NASApp/ygp/EmailLanding.ygp?event=DirectView&amp;shareInfo=1uXYxRKKm4SqiMXicviPr7BFtTDy4XiewY4eZ9%2fM%2bJVWGd%2bBXiXp6w%3d%3d&amp;pageName=AlbumViewFromEmails&amp;locale=en_US\">http://pak05.pictures.aol.com/NASApp/ygp/EmailLanding.ygp?event=DirectView&amp;shareInfo=1uXYxRKKm4SqiMXicviPr7BFtTDy4XiewY4eZ9%2fM%2bJVWGd%2bBXiXp6w%3d%3d&amp;pageName=AlbumViewFromEmails&amp;locale=en_US<br>Your holiday gift to </a><a href=\"http://soaw.org\">School of the Americas Watch</a>  will help to close our terrorist training camp.<br><br><br><br><br><br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://bp1.blogger.com/_yPZWeXAMdds/R0z_ntipvlI/AAAAAAAAAGA/D4sPHOAwDo4/s1600-h/mechrissoa.jpg\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5137762332627811922\" src=\"https://lh5.googleusercontent.com/proxy/OBWBApSSFgHub7Tnm13HocnEeBxS5CPWB0nwoqCbXaMCWiLij-5R4qmNAs00y2aHK0DsvclWeeq0gzMtxjIwaMmjib7ZaRd-F2uybrbwZjBdQJOIzYgrz5Xvudk3ecLiVLmTJ9bCFr8Zh2kel75G=s0-d\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;\"></a><br><br><br>Chris Chandler and I on stage at the SOAWatch Vigil 2007 <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://bp2.blogger.com/_yPZWeXAMdds/R1CLwbtrVmI/AAAAAAAAAGQ/TyIPWSl9gqA/s1600-R/soamusicians.jpg\"><img alt border=\"0\" id=\"BLOGGER_PHOTO_ID_5138760839019058786\" src=\"https://lh4.googleusercontent.com/proxy/4B2uXWt0_guV9N9kuuXdCq00I0z8NH56lbTUzCBjsymknlXxH8yBggyIOra1YqUlcRrIfBwt8LkP2i9fiBLE9jtNA9gX2shpa8W3vYeXz-EdFqE2ow5QapM5Pm1WZYpZ2nWxJO5Zcnesmv5Hpc6kZZA=s0-d\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;\"></a><br>The Musicians' Collective<br><br><br><br>2007 was a year of tragic and devastating losses - starting with the murder of brilliant 36 year old Helen Hill in New Orleans last January 4th; Santiago Cruz, FLOC organizer, only 29 years old when he was found murdered in the union office in Monterrey; my friend Jackie Brown, dead at 47 from breast cancer in Jacksonville; my dear friend Berk Snow, dead in a plane crash at 55; my son's childhood best friend, Joel Daniels Walker - dead at 27 here in Pittsburgh; the dynamic young president of United American Nurses, Cheryl Johnson - dead of a brain aneurism at 57 -- The world is diminished by the loss of Molly Ivins, George Becker, Jackie Alper, Pat Jardine and Victor Rabinowitz. And my hometown won't be the same without Ralph Kelly and Leon Swimmer.  The tragic, preventable deaths at the Crandall Canyon mines in Utah remind us all to &quot;Mourn the Dead and Fight Like Hell for the Living!&quot;<br><br>2007 was also filled with joys.  Lots of wonderful new babies to play with, lots of weddings - most notably (for me) the wedding of my son Dan to the brilliant and lovely Monique Murad.  This Thanksgiving holiday was the best ever - family, friends, music, games, jokes, food and lots of laughs and hugs.  My wonderful daughter Amy is almost a certified massage therapist.<br><br>I was blessed with too many wonderful performance opportunities to list (... but the Salt Spring Folk Club will give me lovely memories for a lifetime!).  <br><br>Still, I am so touched by the kindness, generosity, dedication and hard work of my wonderful presenters and tour mates: Rick Smith, all the NOLSW folks, Celeste Howard and Georgia Pinkel, Inger and Bo in Gothenburg, Charles King, Kathleen Culver and Noel Beasley of the Eugene Debs Foundation, Don Scheiber, my Telus pals in Smedjebacken, Sarah &amp; Tarmo, Shelley Kessler &amp; all the WWLHF folks, Kay and Walter Tillow, Eleanor Walden, Pat Hogan, Michael Goodman &amp; Sharon Sjerven (!), Ken Orchard &amp; Sharon Hazelwood, Al &amp; Dotty Dale &amp; Betsy Pernotto &amp; Bob Marshall, Leon Peek, Lu Mitchell, Danny Yeager, Jenny Brown &amp; Joe Courter, Ward Broderson, Julia Ayres, Alexis, Arlene &amp; Dave, Wendyl, Martha Shunn, Melanie Crawford, Alan Patrusevich, Dale Morris, Jamie and Matt in IA City, Corey Dolgon, Art &amp; Melanie, Dave Johnson, Ron Haldeman, Helena Worthen,  Margie Rosenkranz, Terry Irons, Robert Ford, Teresa Allen, Adam &amp; Kris, Brian QTN, my OCF Faire Family, Ken &amp; Janet Bates, Jim Gorman &amp; Joey Hartman, Larry Olds, all my wonderful new friends in Florence, OR, Amy Newell, Maureen and Al Cholger, Maureen Wood, Jim Cook &amp; the NW Labor Arts committee (!), Cecile and Axel Myer, Dan Kenney, Chris in Charleston, Jim &amp; Jenny Barrett, the Anathoth Community folks, Janet Tucker, Julienne and John Oldfield, Liz Long, Polly Grubb, Alex, Paul Kotheimer, Rosanne Barker, Julius Margolin, David Rovics, Evan Greer and Chris Chandler.  (I'm sure I missed some folks I'm going to kick myself over, but it's a start!)<br><br>********************************************<br>SEASONAL JOKE (From Karen Newman)<br><br>Two Santas from rival department stores walk into a bar and get into a fight. Fortunately, a comma and a period are in the same bar. They get together and separate the two Clauses.<br><br>********************************************<br><br>IRISH TOURS UPDATE<br><br>The Irish tours are filling up fast.  I've got room for six more folks in June, five more in August, and still sixteen more folks for the Sept/Oct tour (when the airfares should be lower).  I've set up Google discussion groups for folks on the tour, and we're busy planning our adventures, making reading lists and more. It's not too late to join us.  We'll need $750 by December 20th to hold your spot, and the balance eight weeks before departure.<br><br>After some preliminary investigation, it doesn't appear likely that I'll be able to arrange any &quot;group discount&quot; with the airlines.  So you should start looking into air fares to Ireland.  I hope the dollar gets stronger soon...  although it's sure making this tour even more of a  bargain now!!!  Nine days in Ireland with all accommodations, all ground transportation, all breakfasts, three dinners, and admission to most group events only $1750.  (This does NOT include airfare to Shannon, Ireland where each tour begins).<br><br>We'll have the best of the West - the best scenery, the best music, and many opportunities to learn about Irish history, politics, poetry and more!  Send me an email if you'd like more information.<br><br>********************************************<br><br>LAST MINUTE GIFT IDEAS<br><br><a href=\"http://cdbaby.com/all/unionmaid\">My CD sale at CDBaby continues through December 8th.  Take advantage of my seasonal sale!!</a> <br><a href=\"http://northlandposter.com/\"><br>Northland Poster Collective</a> carries a fabulous inventory of union made posters, tee shirts and so much more!<br><br>A great source for activist books and more is <a href=\"http://www.burnedbookspublishing.com\">Burned Books Publishing</a> -- check out my friend John Storhm's fine selection of hard-to-find books!<br><br>I've still got a couple music boxes that play &quot;The Internationale&quot; left... $40<br><br>Powell's Books is a superior source of books and more.  Use this link and the ILWU local that represents Powell's workers will benefit! <a href=\"http://www.powellsunion.com/shop-smart/shop-smart/buy-books\">http://www.powellsunion.com/shop-smart/shop-smart/buy-books</a><br><br>It's still not too late to give a special someone a unique gift - credit in the liner notes of my new CD!!  For $100 I'll list your name, or your sweetheart's name, or the name of someone you admire in my forthcoming CD &quot;Dump the Bosses off Your Back.&quot;   I've got 41 of the 62 sponsors I need to finish this CD.  Send a check for $100 to ANNE FEENEY, 2240 Milligan Ave, Pittsburgh, PA 15218<br><br>If you want to use a credit card, email me at anne@annefeeney.com and I'll tell you how to do that.<br><br><a href=\"http://www.aflcio.org/aboutus/thisistheaflcio/publications/magazine/cooltools.cfm\"><br>http://www.aflcio.org/aboutus/thisistheaflcio/publications/magazine/cooltools.cfm</a><br>is more than a guide to union made goods... the facts &amp; stats box in the bottom left corner is a goldmine of useful information<br><br>and remember -- this season is NOT about the gifts... spend time with friends - do something unexpected and wonderful for someone else.  Thanks for staying in touch with me... I hope to see you in 2008!<br><br>Happy holidays and much love<br><br>Anne<br><br>********************************************<br><br>UPCOMING DATES:<br><br>Thursday, November 29th, 2007 12:00 PM<br>CODE RED RALLY!! Appalachian Regional Health Care RNs Fighting Back<br>ARH Headquarters<br>2285 Executive Drive<br>Lexington, KY<br><a href=\"http://www.uannurse.org/ufiles/UAN37-07flyerfinal.pdf\">http://www.uannurse.org/ufiles/UAN37-07flyerfinal.pdf</a><br>Price: free<br>Exit 110 off I-75<br><br>Saturday, December 1st, 2007 7:30 PM<br>The Syracuse Peace Council presents Anne Feeney with Colleen Kattau<br>Pebble Hill Church<br>5299 Jamesville Road<br>DeWitt, NY<br>(315) 475-6251<br>Price: $1-=20 suggested<br>Colleen is a fabulously talented singer and songwriter in both English and Spanish. This will be a wonderful evening.<br><br>Sunday, December 2nd, 2007 7:00 PM<br>Truth and Artichokes: A Fabulous Tribute Concert for Jackie Alper!<br>Eighth Step at Proctors<br>432 State Street<br>Schenectady, NY 12305<br>(518) 434-1703<br><a href=\"http://eighthstep.org\">http://eighthstep.org</a><br>Price: $tba<br>This concert will benefit the Eighth Step and features Ronnie Gilbert, Bernice Johnson Reagon, Steve Gillette and Cindy Mangsen and many more special guests. I'm ecstatic to have this opportunity to honor the memory of my friend, Jackie Alper, and to benefit the Eighth Step.<br><br>Saturday, December 15th, 2007 4:00 PM<br>Support Striking RNs at Appalachian Regional Health<br>tba<br>Pittsburgh, PA<br>Price: donation<br>Drop off new toys, food, cash, checks, new clothing -- From 7 - 9 PM we'll have a sing-along of union songs, carols and more.<br><br>Checks to: Kentucky Nurses' Association<br><br>Sunday, December 16th, 2007 10:00 AM<br>Caravan to ARH Picket Line<br>I'm driving down to Beckley or Lexington or Louisville (I'll know soon) with whatever we collect on the 15th... does anyone want to come along?<br><br>Friday, February 22nd, 2008 8:00 PM<br>Four Shillings Short and Anne Feeney in Concert<br>Allegheny Unitarian Universalist Church<br>416 W North Ave<br>Pittsburgh, PA 15212<br>412.877-6480<br>Price: $15 suggested<br>If you missed the first concert, you won't want to miss this one! And if you came to the last 4ss concert you'll be spreading the word, I'm sure.. what fun!!<br><br>also coming to Pittsburgh in February - THE PRINCE MYSHKINS!!\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
