{
	"date": "Wednesday, September 01, 2010",
	"title": "SEPTEMBER 2010 - Anne Feeney's Fellow Travelers' Advisory - VOLUME SIX #6",
	"body": "SEPTEMBER 2010 - Anne Feeney's Fellow Travelers' Advisory - VOLUME SIX #6<br>\n<br>\nImmediate Destinations:&#xA0; Radiation and Chemotherapy...<br>\n<br>\nIN THIS ISSUE:<br>\n<br>\nHealth News<br>\nThank you thank you thank you thank you <br>\nI'm a GRANDMA!!<br>\nUnion Song Contest <br>\nLabor Day 2010 <br>\nFamily News - Happy Birthday Amy!<br>\nPhoto Archive Request<br>\n<br>\n<br>\n<div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"//4.bp.blogspot.com/_yPZWeXAMdds/TH5XHJDLzHI/AAAAAAAAAmI/K5f6lIpAi7A/s1600/bald.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"640\" src=\"//4.bp.blogspot.com/_yPZWeXAMdds/TH5XHJDLzHI/AAAAAAAAAmI/K5f6lIpAi7A/s640/bald.jpg\" width=\"480\"></a></div><br>\n<br>\n<br>\nSeptember 1, 2010<br>\nPittsburgh, PA<br>\n<br>\n<b>Health News...</b><br>\n<br>\nIn the words of William Bendix (The Life of Riley) - What a revolting development this is!<br>\nMy hair mostly fell out yesterday, so Julie gave me a buzz cut with his beard trimmer.<br>\nNow I know why Chandler wears a hat - It's cold with no hair!<br>\n<br>\nIt was a month ago that Julie's best friend, Per Forsberg, ordered a lung CT scan for me.&#xA0; (He's a doctor in Julie's hometown of Smedjebacken.)&#xA0; He was afraid I might have blood clots in my lungs the way that I was coughing.&#xA0; I had to go to the next little town over, Ludvika, for the test.&#xA0; They did it at the hospital there.<br>\n<br>\nA young medical student was in charge at the ER that day.&#xA0; When the CT results came back I could tell from the look on his face that he had devastating news for me.&#xA0; What he said though, was:&#xA0; &quot;I am so sorry to tell you that we have found a fast growing tumor on your esophagus and windpipe.&#xA0; It's very large - around 11 cm - and in addition to the complications with your esophagus and windpipe this tumor is also putting terrible pressure some major weasels.&quot;<br>\n<br>\nThe dead serious look on his face as he described the pressure on my major weasels made me start to laugh.&#xA0; He was embarrassed, of course, realizing he had grabbed the wrong word.&#xA0; His mind racing, he started again...<br>\n<br>\n&quot;Wessels!&#xA0; Major Wessels!&quot;<br>\n<br>\nI think I had already figured out that he meant vessels.&#xA0; But I will be forever grateful to this young doctor for making me laugh - not just at that moment - but every time I've told anyone the story of my diagnosis.&#xA0;&#xA0; Indeed, from that day on, we have referred to this tumor as &quot;the weasel.&quot;&#xA0; Sometimes when the weasel is in there doing rodeo tricks with my esophagus or windpipe I have had these terrible chest pains.&#xA0; I think this first round of chemo has finally subdued the weasel to the point that those episodes are over.<br>\n<br>\nI returned to Pittsburgh and had a bronchoscopy and biopsy at Shadyside Hospital.&#xA0; It's small cell lung cancer, caused by smoking.&#xA0; This tumor couldn't really be surgically removed without completely resectioning lots of parts.&#xA0; But the oncologist says that this type of tumor is very &quot;chemo-reactive&quot; and will disappear entirely with an aggressive course of chemo and radiation. Subsequent brain MRI, CT scans, bone scans and Pet Scans have confirmed that the cancer is confined to the tumor and to the nearest lymph node.&#xA0; Because it hasn't spread anywhere else, I have a 20% chance of living out my lifespan.&#xA0; Four out of five people with my diagnosis will have a recurrence of the cancer within two years and it will not respond to treatment.&#xA0; I think I'm a likely candidate for the 20% group.&#xA0; It's been almost ten years since I quit smoking.&#xA0; I'm in great health otherwise.&#xA0; Singing all these years has kept my lungs very healthy and young. &#xA0; I am treating at the Hillman Cancer Center.&#xA0; It's part of the UPMC behemoth.&#xA0; People travel from all over to get to this center for cancer treatment, so I'm lucky to have it in my own back yard.<br>\n<br>\nStarting on Tuesday, I'll be having two radiation treatments daily for three weeks.&#xA0; In addition to that, on Wednesday I'll have six hours of chemo, Thursday two hours of chemo, and Friday, two hours of chemo.<br>\n<br>\nWhen I've finished up the radiation, I'll do another round of Chemo on September 29, 30 and October 1st.<br>\n<br>\nThree weeks later, another round of chemo, and then I'm finished with treatment.<br>\n<br>\nThere are a number of possible complications, but I'm hoping to avoid them.<br>\nFor ongoing medical updates, please visit <a href=\"http://www.caringbridge.org/visit/annefeeney\">http://www.caringbridge.org/visit/annefeeney</a><br>\n<br>\n<b>Thank you Thank you Thank you Thank You THANK YOU!!</b><br>\n<br>\nOne of my huge concerns as I began canceling all of my shows for 2010 and 2011 was certainly financial.&#xA0; The bills are rolling in at a startling rate.&#xA0; Even though my insurance is pretty good, I've had about $8000 in uncovered medical bills since July.&#xA0; Even if I manage to get Social Security Disability and the Musicians' Union Disability Pension, I won't receive my first payments until at least February of 2011.<br>\n<br>\nI know that so many people are really struggling right now that I was reluctant to ask for financial help from you.&#xA0; It looks like most people really took my request of last month to heart.&#xA0; People who are indeed struggling sent me their best wishes (lots of them are on my guestbook ... <a href=\"http://annefeeney.com/guestbook.html\">http://annefeeney.com/guestbook.html</a> ),&#xA0; some hilarious and touching letters and cards, and their prayers and hopes for my recovery.&#xA0; Perfect!<br>\n<br>\nAnd lots of you with an extra $50 sent it my way. I am so touched, so heartened by this rally to my recovery.&#xA0; I won't have to worry about money for a while.&#xA0; It's amazing to me. I have almost 10 months of basic expenses sitting in the bank right now.&#xA0; I'm working on individual thank you notes, but I have so little energy, it's going to take me a while to get everyone thanked.&#xA0; Please don't send me more than $50 - I'm hoping enough folks will come through at $50 that I won't have to seek out any larger donors...&#xA0; <br>\n<br>\nI would still welcome your contribution.&#xA0; You can send it to:<br>\n<br>\nAnne Feeney<br>\n2240 Milligan Ave<br>\nPittsburgh&#xA0; PA&#xA0; 15218<br>\n<br>\nor via the &quot;Donate&quot; button located about 5 inches down on the right hand side this page.<a href=\"http://fellow-travelers-advisory.blogspot.com/\"></a><br>\n<br>\nI hear there are some benefit shows being planned in Detroit, Eugene, Pittsburgh ... It's all very overwhelming and inspiring to me.&#xA0; If I had ever had any doubt about my so-called career choice, it's been put to rest by this amazing outpouring of love and affection and generosity from you, my friends.&#xA0;&#xA0;&#xA0; I've so loved the reminiscences enclosed in your letters.&#xA0; I've been feeling a little like Tom Sawyer at my own funeral .... some of these notes are practically eulogies.&#xA0; I'm glad that folks are feeling a little sentimental when they write.&#xA0; I'm feeling pretty sentimental these days myself.<br>\n<br>\nSo keep those cards &amp; letters &amp; love tokens coming - they absolutely are the highlight of every day.&#xA0; <br>\n<br>\n<b><br>\n</b><br>\n<b> I'm a GRANDMA!!</b><br>\n<br>\nLittle Sebastian Edward Berlin arrived five days early on August 22, 2010 weighing in at 5 lbs. 4 oz and almost 19 inches.&#xA0; He's perfect in every way.&#xA0; Monique is doing well after an emergency C-Section.&#xA0; Her Mom and Dad were in Quito for the birth.&#xA0; Dan was in the delivery room.&#xA0; I can't wait to hold the little fella in my arms!&#xA0; In the meantime, we have webcams, and I get to see Sebastian almost every day on the camera.&#xA0; He is so precious.<br>\n<br>\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"//4.bp.blogspot.com/_yPZWeXAMdds/TH6sIRN6c_I/AAAAAAAAAmg/i4tVVMDp4Y4/s1600/daddyandson.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"//4.bp.blogspot.com/_yPZWeXAMdds/TH6sIRN6c_I/AAAAAAAAAmg/i4tVVMDp4Y4/s400/daddyandson.jpg\" width=\"300\"></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"//3.bp.blogspot.com/_yPZWeXAMdds/TH6sFz8PSdI/AAAAAAAAAmY/6QNbGbILHTA/s1600/wideawake.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"300\" src=\"//3.bp.blogspot.com/_yPZWeXAMdds/TH6sFz8PSdI/AAAAAAAAAmY/6QNbGbILHTA/s400/wideawake.jpg\" width=\"400\"></a></div><br>\n<br>\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"//4.bp.blogspot.com/_yPZWeXAMdds/TH6sD5B4JEI/AAAAAAAAAmQ/k54xai3PaBs/s1600/mamaandson.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"300\" src=\"//4.bp.blogspot.com/_yPZWeXAMdds/TH6sD5B4JEI/AAAAAAAAAmQ/k54xai3PaBs/s400/mamaandson.jpg\" width=\"400\"></a></div><br>\n<br>\n<b><br>\n</b><br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<b>LABOR DAY 2010</b><br>\n<br>\nMy plan was to be in Pullman, in Chicago, for Labor Day this year.&#xA0; My friend Mike Hobbs has written a beautiful article about the Pullman Strike.&#xA0; I'm sure he'd be happy to send you a copy.&#xA0; You can write him at mhobbs(@)grics.net to request a copy.&#xA0; His article concludes with a quote about the strike from historian Virgil J. Vogel - <span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\">&quot;(The Pullman Strike) was a glowing light to prove that in a world governed largely by acquisitiveness and rapacity, there were still enough people responding to a different drummer, to give promise that freedom for the oppressed was not a utopian dream but a practical goal..&quot;&#xA0;</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><br>\n</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\">This Labor Day I salute all my brothers and sisters who have made the same idealistic stand against corporate greed - at Hormel, at Eastern Airlines, at Pittston, at Staley, at Bridgestone/Firestone, at Caterpillar, at MSI, at AK, at Conn-Selmer, at PAL Technologies, at Pottsville Hospital, at Canonsburg Hospital, at Ravenswood, at Hercules and at countless other places.&#xA0; It's been my honor and privilege to stand with you, then and now.</span><br>\n<b><span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><br>\n</span></b><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><b>UNION SONG CONTEST</b></span><br>\n<br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\">It's still too soon to actually vote in the union song contest, but you can go and preview&#xA0; the entries at <a href=\"http://members.unionsongcontest.org/entries\">http://members.unionsongcontest.org/entries </a>&#xA0;&#xA0; There are some great songs to listen to there.&#xA0; And I hope you'll all vote for my entry, &quot;War on the Workers,&quot; when the contest officially begins on Labor Day.&#xA0;</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><br>\n</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><b>FAMILY NEWS/BIRTHDAYS</b></span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><b></b><b> </b></span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><b></b>Obviously, Sebastian's arrival is the big big family news this month.</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><b><br>\n</b>But this newsletter is going out on my beautiful daughter Amy's 29th birthday... Happy Happy Birthday, darling!&#xA0; She and her dad leave soon for Quito to personally welcome Sebastian into the world.&#xA0;&#xA0;</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><br>\n</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\">My husband, Julie Leonardsson, is here from Sweden and taking fantastic care of me.&#xA0; He gave me the buzz cut last night with his beard trimmer once my hair began falling out in clumps.</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><br>\n</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\">My cousin Karen McCahill got to go to London to visit Kristin and Anthony and Anabel and Antonito.&#xA0; Condolences to all my McCahill cousins on the recent death of their Aunt Mary McCahill Ryan - a great lady, whose hospitality I enjoyed many times growing up.</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><br>\n</span><br>\n<b><span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\">BIRTHDAYS</span></b><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><br>\n</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\">Christina Mumphrey - September 3rd, Mary (Mimi) Grefenstette - September 11th, Kris Deelane - September 12th, Faith Petric - September 13th, Danny Donnelly - September 13th, Tod Faller - September 14th, Mardy Weber McCahill September 21st, Kay McCahill Mumphrey - September 25th, Charlie Warren - September 27th</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><br>\n</span><br>\n<span style=\"font-family: &quot;Times New Roman&quot;; font-size: 12pt;\"><b>Photo Archive Request</b></span><br>\n<br>\nMy pal George Mann has offered to create a photo archive for me.&#xA0; If you're sitting on some photos of me at your picket line, convention, rally, riot, party, house concert or riot, how about sending a copy to <a href=\"http://www.annefeeney.com/webmail/src/compose.php?send_to=annefeeneypics@gmail.com\" target=\"_blank\" title=\"This external link will open in a new window\">annefeeneypics@gmail.com</a> <br>\n<div>&#xA0;Be sure to include any information you have about the photo - when it was taken and where, by whom, the names of any other folks in the photo, etc.</div><div><br>\n</div><div></div><div><b><br>\n</b></div><div><b>THE TOUR</b></div><div><br>\n</div><div>The tour is on hold, indefinitely.&#xA0; I'm hoping to be well enough to join you at Allegheny Unitarian Church on November 13th when my wonderful pals - Lou and Peter Berryman - come here to perform.&#xA0; In the meantime, if your travels bring you to Pittsburgh, call 412-241-7664 and see if it's a good day for a visit.&#xA0; I look forward to seeing lots of you here at my house while I &quot;battle the weasel.&quot;&#xA0; My love and gratitude to all of you.</div><br>\nYou can still buy my CDs at <a href=\"http://cdbaby.com/all/unionmaid\">http://cdbaby.com/all/unionmaid</a>- and I hope you will!<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<input id=\"gwProxy\" type=\"hidden\"><input id=\"jsProxy\" onclick=\"jsCall();\" type=\"hidden\"><br>\n<div id=\"refHTML\"></div>\n<div style=\"clear: both;\"></div>",
	"author": "Posted by\n<span class=\"fn\" itemprop=\"author\" itemscope=\"itemscope\" itemtype=\"http://schema.org/Person\">\n<meta content=\"https://www.blogger.com/profile/13662499950125925391\" itemprop=\"url\">\n<a class=\"g-profile\" href=\"https://www.blogger.com/profile/13662499950125925391\" rel=\"author\" title=\"author profile\">\n<span itemprop=\"name\">Fellow travelers'Advisory</span>\n</a>\n</span>"
}
